{
  "file_name": "BL 0098-175 A Bylaw for Establishing Waste Collection and Fees.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\n\nBY-LAW NUMBER 98-175\n\nA BY-LAW FOR ESTABLISHING AND MAINTAINING A SYSTEM FOR THE\nCOLLECTION AND DISPOSAL OF WASTE AT THE EXPENSE OF THE\nCORPORATION OF THE CITY OF BELLEVILLE AND FOR THE ESTABLISHMENT\nOF USER FEES FOR THE COLLECTION AND DISPOSAL OF WASTE IN THE\nBELLEVILLE WARD OF THE MUNICIPALITY OF THE CORPORATION OF THE\nCITY OF BELLEVILLE.\n\nWHEREAS the Council of The Corporation of the City of Belleville hereinafter referred\nto as \"The City\" deems it expedient to provide for the collection of waste within the\nBelleville Ward boundaries of the City and the removal and disposal thereof and to\ndirect that the expenses of the said collection and disposal shall be borne by the City\nand for the establishment of user fees for the collection and disposal of waste and to\nprovide for such terms and conditions for the collection and disposal of waste for\nresidential, commercial and institutional establishments within the Belleville Ward\nboundaries of the City as established in this by-law.\n\nNOW, THEREFORE, THE COUNCIL OF THE CORPORATION OF THE CITY OF\nBELLEVILLE ENACTS AS FOLLOWS:\n\n1. CONTRACTS\n\nTHAT a contract or contracts be made from time to time with some person or\npersons, firm or corporation for the collection and disposal of all waste within the\nBelleville Ward boundaries of the City upon such terms and conditions and at\nsuch price or prices as may appear reasonable to the City Council and that the\nMayor and Clerk be and they are hereby authorized to execute such contract or\ncontracts on behalf of the City and to affix the City's seal to such contract or\ncontracts.\n\n2. DUTIES OF THE CONTRACTOR\n\nTHAT all waste within the Belleville Ward boundaries of the City except as\nhereinafter mentioned under Section 4 of this by-law shall be collected, removed\nand disposed of, by the contractor so employed to collect the same and the\nexpenses of collecting and disposing of such waste shall be paid by the said\nCity.\n"
    },
    {
      "page_number": 2,
      "text": "BY-LAW NUMBER 98-175 Page 2\n\n3. DEFINITIONS\n\n(a)\n\n(b)\n(c)\n\n(d)\n\n(e)\n\n(f)\n\n(9)\n\n(h)\n\n(i)\n\n(i)\n\n\"ashes\" means the solid residue of any household fuel remaining after\nburning, soot and other chimney deposits.\n\n\"The City\" means The Corporation of the City of Belleville.\n\n\"collection\" means the collection of waste as set out in Section 3(r) of\nthis by-law.\n\n\"collection date\" means the date for collection of waste as determined or\nrevised by the City from time to time.\n\n\"contract\" means any agreement entered into by the City for the\ncollection and disposal of waste.\n\n\"contractor\" means the person, persons, firm or corporation to whom\nthe City has contracted with for the collection and disposal of waste.\n\n\"dwelling\" means any building or other structure occupied or used as a\nplace of abode other than a hotel or motel, restaurant, apartment house,\ntenement or building in which more than two (2) families dwell or which\ncontains more than two (2) separate places of dwelling.\n\n\"downtown commercial area\" means the lands fronting on Front Street\nextending from Dundas Street northerly to Station Street, and the lands\nfronting on Pinnacle Street extending from Station Street southerly to\nDundas Street and shall include the lands fronting on Victoria Avenue,\nCampbell Street, Bridge Street, Market Street and McAnnany Street\nbetween Front Street and Pinnacle Street.\n\n\"garbage\" means any waste materials from the kitchens of dwellings,\nhotels, motels, institutions, restaurants and the vegetable and animal\nwaste from groceries, markets and other food establishments, discarded\napparel, wood and metal scrap, rags, excelsior, celluloid, straw, broken\nglass, crockery and earthenware.\n\n\"household trash\" means discarded household items, including but not\nlimited to bedsprings, mattresses, furniture, wooden boxes, wooden\nbarrels, wood and metal doors and windows, electronic equipment,\ncarpets and rugs which are rolled, folded and tied, and any other\ndiscarded material which would normally accumulate and not normally be\nincluded as garbage.\n"
    },
    {
      "page_number": 3,
      "text": "BY-LAW NUMBER 98-175 Page 3\n\n3. DEFINITIONS (Cont'd)\n\n(k)\n\n(I)\n\n(m)\n\n(n)\n\n(0)\n\n(P)\n\n\"leaf and yard waste\" means leaves, grass clippings, flowers, fruits,\nvegetables, organic plant materials generated from gardening and yard\nmaintenance, tree limbs and brush in accordance with size restrictions as\nset out in Section 8(e) of this by-law.\n\n\"lift\" means a receptacle as set out in Section 3(0) of this by-law\ncontaining specified waste as set out in Section 3(r) of this by-law. All\nsingular items placed for collection shall constitute one lift.\n\n\"manufacturers' or trade waste\" means any abandoned, condemned or\nrejected product or by-product or the waste from any product or by-\nproduct used by a manufacturer, builder or contractor in the operation of\nhis business or trade including but not limited to scrap metal and motor\nvehicle parts from garages and service stations.\n\n\"person\" means an owner, tenant, sub-tenant, occupant, lessee,\ncorporation, partnership, individual or person in charge of a dwelling,\nresidential unit, commercial unit or institution.\n\n\"receptacles\" means metal, plastic or other suitable watertight vessels or\npolyethylene or paper bags manufactured specifically as disposable\ngarbage bags and/or cardboard cartons.\n\n\"residential unit\" means any dwelling as set out in Section 3(g) of this\nby-law and shall include but not be limited to an apartment building,\nrooming house, condominium or any other building in which more than\ntwo (2) families dwell or which contain more than two (2) separate places\nof dwelling.\n\n\"street\" means any public highway, road, street, lane, alley or square.\n\n\"waste\" includes garbage, ashes, household trash and non-recyclable\nwaste.\n\n\"white goods\" means household appliances including but not limited to\nrefrigerators, freezers, air conditioners, dehumidifiers, humidifiers,\nmicrowaves, stoves, dishwashers, washers and dryers, whether or not\nthey use any gas in their operation.\n"
    },
    {
      "page_number": 4,
      "text": "BY-LAW NUMBER 98-175 Page 4\n\n4.\n\nGENERAL PROHIBITIONS AND RESTRICTIONS\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nIt shall constitute an offence for a person to put out for collection any\nwaste that is not:\n\n(i) the type or composition of waste; or\n(ii) placed during or removed after the time or times; or\n\n(iii) | in the receptacles or containers including the size and weight\nthereof; or\n\n(iv) | deposited within such receptacles or containers; or\n(v) secured or wrapped within such receptacles or containers; or\n(vi) placed in the location designated; or\n\n(vii) in receptacles or containers tagged with a \"Belleville Garbage Tag\"\nor a\"Leaf and Yard Waste\" tag as the case may be;\n\nas prescribed in accordance with the terms of this by-law.\n\nIt shall constitute an offence for a person to sweep, throw, cast, lay,\ndeposit or direct, suffer or permit any servant, agent or employee to\nsweep, throw, cast, lay or deposit any waste, dirt, leaves, stones or\ngarbage of any kind whatsoever in or upon any street within the Belleville\nWard boundaries of the City.\n\nIt shall constitute an offence for a person to permit the accumulation of\nany type of waste, swill and/or liquid waste upon his premises or upon\npremises occupied or controlled by him that he knows or ought to know is\nlikely to be detrimental to public health.\n\nIt shall constitute an offence for a person to pick over, disturb or scatter\nany waste placed for collection in accordance with the provisions of this\nby-law whether the waste is contained in a covered receptacle or not.\n"
    },
    {
      "page_number": 5,
      "text": "BY-LAW NUMBER 98-175 Page 5\n\n4. GENERAL PROHIBITION AND RESTRICTION (Cont'd)\n\n(e)\n\nNotwithstanding anything contained herein it shall constitute an offence\nfor a person to place for waste collection any of the following:\n\n(i)\n\n(ii)\n\n(iii)\n\n(iv)\n\n(vi)\n\n(vii)\n(viii)\n(ix)\n(x)\n\n(xi)\n\nany material, substance or object which may or is likely to detonate\nor explode as a result of improper handling, exposure to anything,\nor by any other means.\n\nany material classified as hazardous waste as defined by the\nschedules attached to \"Dangerous Goods Transportation Act\",\nRSO 1990, c. D1 as amended and regulations thereto or any\nOntario or Federal Statute of Canada.\n\nany scrap metal, including but not limited to bath tubs, hot water\ntanks, empty propane tanks, empty fuel tanks, and large metal\nitems.\n\nany white goods as defined in Section 3(s) of this by-law.\n\ntires used for automobiles, trucks, trailers, motorcycles or any other\nmobile mechanical equipment.\n\nbodies or large parts of motorized vehicles, boulders or blocks of\nconcrete or asphalt in excess of 28 cubic decimetres (1 cubic foot),\ntrade waste, industrial waste, or trash accumulated from a place of\nbusiness.\n\nanimal carcasses.\n\nleaf and yard waste.\n\ntree stumps larger than 15 centimetres (6 inches) in diameter.\n\nfor residential locations all cardboard except cartons that are\nutilized as receptacles under Section 5(b) of this by-law and\ncardboard that is contaminated or waxed or Asian.\n\nany other objects deemed unacceptable for collection by the City.\n"
    },
    {
      "page_number": 6,
      "text": "BY-LAW NUMBER 98-175 Page 6\n\n4. GENERAL PROHIBITION AND RESTRICTION (Cont'd)\n\n(f)\n\nIt shall constitute an offence for a person to exceed the following number\n\nof lifts for each regular waste collection\n\n(i) Residential - six (6) lifts.\n\n(ii) | Commercial and Institutional (excluding the downtown commercial\narea) - sixteen (16) lifts.\n\n(iii) | Commercial and Institutional in the downtown commercial area\n\n- eight (8) lifts per collection, twice weekly collections.\n\n5. RECEPTACLES\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nEvery person shall provide and maintain receptacles in good condition\nand in sufficient number to hold all waste or other garbage produced from\nor originating from their premises.\n\nDry waste or other garbage may be enclosed in cardboard cartons,\nhowever, it shall constitute an offence for a person to allow dry waste or\nother garbage to be enclosed in cardboard cartons that exceed a\nmaximum weight of 23 kilograms (50 Ibs.) and/or exceed a maximum size\nof 61 cm. x 61 cm. x 106 cm. (24 in. x 24 in. x 42 in.).\n\nExcept for disposable bags, it shall constitute an offence for a person to\nuse a receptacle that is not equipped with handles and properly fitted lids\nwhich cover the receptacle at all times. Such receptacles shall be in the\nform of a pail manufactured for the purpose of collecting garbage.\n\nIt shall constitute an offence for a person to use disposable bags unless\nthe disposable bags are tightly sealed with suitable enclosures.\n\nIt shall constitute an offence for a person to use a receptacle under this\nsection that exceeds 77 litres (17 imperial gallons) and exceeds in weight\nmore than 34 kilograms (75 Ibs.) including contents.\n\n6. COMPOSITION OF A LIFT\n"
    },
    {
      "page_number": 7,
      "text": "(a)\n\nIt shall constitute an offence for a person to place for collection, waste and\nother garbage in a receptacle before it is drained of all liquid.\n\nBY-LAW NUMBER 98-175 Page 7\n\n6. COMPOSITION OF A LIFT (Cont'd)\n\n(b)\n\n(c)\n\n(d)\n\nIt shall constitute an offence for a person to place in a receptacle\nhousehold, table and/or kitchen waste that is not first securely wrapped.\n\nWaste that will not readily fit into receptacles as set out in Section 5 of this\nby-law will be collected provided it is cut or folded into pieces not more\nthan 1.2 metres (4 feet) in length and securely tied in bundles.\n\nPaper products and cartons from commercial and_ institutional\nestablishments will be collected provided they are collapsed and securely\ntied in bundles measuring approximately 76 cm. x 76 cm. x 20 cm.\n(30 in. x 30 in. x 8 in.). A limit of two bundles per collection will apply.\nThe downtown commercial area shall be limited to one bundle for each of\nthe twice weekly collections.\n\n7. COLLECTION, REMOVAL AND DISPOSAL OF WASTE\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nThe Council of the City shall name one or more days in each week for the\ncollection of waste from within the Belleville Ward boundaries of the City\nor in any areas defined thereof.\n\nIt shall constitute an offence for a person to place waste for collection\nunless the waste is at the property side of the sidewalk abutting their\nproperty, or at the curb line where there is no sidewalk, or at the edge of\nthe travelled portion of the street abutting their property where there is no\ncurb or sidewalk.\n\nIt shall constitute an offence for a person to place waste on the street for\ncollection any earlier than 12:00 noon local time on the day before the\nscheduled collection of waste for that area and/or any later than 7:00 a.m.\nlocal time on the day scheduled for collection in that area.\n\nExcept as otherwise provided all waste placed for collection shall be\nplaced in receptacles as set out in Section 5 of this by-law.\n\nIt shall constitute an offence for a person to leave any receptacle on any\nstreet past 12:00 noon local time on the day after collection has taken\nplace.\n"
    },
    {
      "page_number": 8,
      "text": ""
    },
    {
      "page_number": 9,
      "text": "BY-LAW NUMBER 98-175 Page 8\n\n7.\n\nCOLLECTION, REMOVAL AND DISPOSAL OF WASTE (Cont'd)\n\n(f)\n\nNo employee of the City or the contractor engaged by the City to collect\nand dispose of waste on behalf of the City shall enter onto or into any\nlands, premises, dwelling, hotel, apartment house, tenement or building or\nascend any stairway or enter an elevator, hoist or lift for the purposes of\ncarrying out or returning thereto any receptacle.\n\nLEAF AND YARD WASTE\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\nThe Council of the City may name one or more days throughout the year\nfor the collection of Leaf and Yard Waste from within the Belleville Ward\nboundaries of the City or in any areas defined thereof.\n\nIt shall constitute an offence for a person to use any receptacle for Leaf\nand Yard Waste during the scheduled collection dates unless one of the\nfollowing receptacles is used:\n\n(i) receptacles and cardboard cartons used for waste as defined in\nSection 5 of this by-law but lids off the receptacles.\n\n(ii) an open, circular wooden basket or bushel basket with handles\nhaving a volume of approximately one bushel and not exceeding\n23 kilograms (50 Ibs).\n\n(iii) | double walled kraft paper bags without ties having a minimum total\nwall thickness of 0.23 millimetres, a flat base when unfolded and\nnot exceeding 23 kilograms (50 Ibs.).\n\nIt shall constitute an offence for a person to put out for collection Leaf and\nYard Waste in plastic garbage bags unless a Leaf and Yard Waste Tag\npurchased in accordance with Section 8(d) of this by-law is affixed to the\nexterior of the bag.\n\nLeaf and Yard Waste Tags must be purchased from the City or from\ndesignated outlets determined by the City at a cost established by the City\nas revised from time to time.\n\nTree limbs and brush shall be tied securely in small bundles and not\nexceed 23 kilograms (50 Ibs.) in weight. Tree limbs shall not exceed 70\nmillimetres (2% inch) trunk diameter and 1.2 metres (4 feet) in length.\n"
    },
    {
      "page_number": 10,
      "text": "BY-LAW NUMBER 98-175 Page 9\n\n8.\n\nLEAF AND YARD WASTE (Cont'd)\n\n(f)\n\n(9)\n\n(h)\n\n(i)\n\nAny Leaf and Yard Waste not placed during the scheduled times for\npickup; contained in the receptacles listed; bundled appropriately as\nrequired by this section; or in the case of plastic bags, not exhibiting a\n\"Leaf and Yard Waste Tag\" shall not be collected by the contractor. Such\nLeaf and Yard Waste may be collected by the City. The person who\ndirectly or by means of an agent discarded the Leaf and Yard Waste shall\nbe liable for the total expense incurred for the removal of such Leaf and\nYard Waste at a rate set by the City, as revised from time to time, plus\nany applicable interest or penalties. Payment shall be made within 30\ndays after receipt of an invoice indicating the total expenses incurred.\n\nAny invoices that remain unpaid for the removal of Leaf and Yard Waste\nshall be added to the tax roll of the person responsible to pay and\ncollected in like manner as municipal taxes.\n\nIn the case of a condominium corporation, the condominium corporation\nshall remain liable to the City for any costs incurred by the City, at a rate\nset by the City, as revised from time to time in collecting Leaf and Yard\nWaste without the appropriate \"Leaf and Yard Waste Tag\" or Leaf and\nYard Waste that is set out for collection which is not in accordance with\nthis section regardless of whether such Leaf and Yard Waste can be\nattributed to the condominium corporation, an owner or tenant of a\ncondominium unit or any other person. All invoices shall be payable\nwithin 30 days after receipt. Invoices that remain unpaid for such Leaf\nand Yard Waste shall be added to the tax roll of the condominium\ncorporation and be collected in like manner as municipal taxes.\n\nIn the case of multi-residential, institutional or commercial properties the\nowner of such property shall remain liable to the City for any costs\nincurred by the City at a rate set by the City as revised from time to time in\ncollecting Leaf and Yard Waste without the appropriate \"Leaf and Yard\nWaste Tag\" or Leaf and Yard Waste that is set out for collection which is\nnot in accordance with this section regardless of whether such untagged\nLeaf and Yard Waste can be attributed to such multi-residential,\ninstitutional or commercial property, an owner, tenant of such property or\nany other person. All invoices shall be payable within 30 days after\nreceipt. Invoices that remain unpaid for such Leaf and Yard Waste shall\nbe added to the tax roll of such property and collected in like manner as\nmunicipal taxes.\n"
    },
    {
      "page_number": 11,
      "text": ""
    },
    {
      "page_number": 12,
      "text": "BY-LAW NUMBER 98-175 Page 10\n\n10.\n\n11.\n\nMANUFACTURERS' OR TRADE WASTE\n\n(a) It shall constitute an offence for an owner or person responsible therefore\nto place manufacturers' or trade waste for disposal by the City. All costs,\ncharges and expenses incurred or necessitated in disposing of\nmanufacturers' or trade waste shall be borne by the owner or person\nresponsible who shall indemnify and save harmless the City regarding any\nliability therefore.\n\n(b) Where any expenses are incurred by the City in the arrangement for the\ndisposal of any manufacturers' or trade waste for which a manufacturer,\nbuilder, contractor or other person is responsible such person shall\nforthwith pay to the City within 30 days of receipt of an invoice indicating\nthe total expenses incurred.\n\n(c) Any expenses incurred by the City that remain unpaid for the removal of\nmanufacturers' or trade waste shall be added to the tax roll of the person\nresponsible to pay and collected in a like manner as municipal taxes.\n\nREQUIREMENT TO COVER WASTE IN TRANSPORTATION\n\nIt shall constitute an offence for a person to transport through the streets any\nwaste, swill, liquid, or offensive matter except through properly covered\nreceptacles or vehicles designed for that particular purpose or in vehicles\nequipped with canvas covers or tarpaulins which shall be placed and fastened in\nsuch a manner to prevent waste or refuse from falling onto the streets.\n\nOBLIGATION TO PROVIDE OWN WASTE COLLECTION\n\nIt shall constitute an offence for an owner, lessee, tenant or other person in\ncharge of a hotel, apartment house, tenement, condominium, shop, store,\ninstitution, office, manufacturer or person who finds that the regular waste\ncollection established by the City inadequate to keep their premises free of\naccumulated waste to not make suitable arrangements at their own expense for\nthe collection and removal of accumulated waste.\n"
    },
    {
      "page_number": 13,
      "text": "BY-LAW NUMBER 98-175 Page 11\n\n12.\n\nREQUIREMENT FOR BELLEVILLE GARBAGE TAG\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nIt shall constitute an offence for a person to set out for collection any bag\nor cardboard carton of waste unless:\n\n(i) ithas a \"Belleville Garbage Tag\" affixed to its exterior.\n\n(ii) the \"Belleville Garbage Tag\" is affixed in such as fashion as to be\nclearly visible to the contractor; and\n\n(iii) the \"Belleville Garbage Tag\" is purchased in accordance with\nSection 12(d) of this by-law.\n\nIt shall constitute an offence for a person to set out for collection a\nreceptacle of waste unless:\n\n(i) it has a \"Belleville Garbage Tag\" affixed to the top item inside the\nreceptacle.\n\n(ii) the \"Belleville Garbage Tag\" is affixed in such a fashion as to be\nclearly visible to the contractor upon removal of the receptacle's lid;\nand\n\n(iii) the \"Belleville Garbage Tag\" is purchased in accordance with\nSection 12(d) of this by-law.\n\nIt shall constitute an offence for a person to place any other item out for\ncollection in accordance with this by-law unless:\n\n(i) it has a \"Belleville Garbage Tag\" affixed to its exterior.\n\n(ii) the \"Belleville Garbage Tag\" is affixed in such as fashion as to be\nclearly visible to the contractor; and\n\n(iii) the \"Belleville Garbage Tag\" is purchased in accordance with\nSection 12(d) of this by-law.\n\n\"Belleville Garbage Tags\" must be purchased from the City or from designated\noutlets determined by the City at a cost established by the City as revised from\ntime to time.\n"
    },
    {
      "page_number": 14,
      "text": "BY-LAW NUMBER 98-175 Page 12\n\n12.\n\n13.\n\nREQUIREMENT FOR BELLEVILLE GARBAGE TAG (Cont'd)\n\n(e) — Any waste not exhibiting a \"Belleville Garbage Tag\" shall not be collected\nby the contractor. Waste without the appropriate \"Belleville Garbage Tag\"\nmay be collected by the City. The person who directly or by means of an\nagent discarded the waste shall be liable for the total expense incurred for\nthe removal of the waste at a rate set by the City as revised from time to\ntime plus any applicable interest or penalties. Payment shall be made\nwithin 30 days after receipt of an invoice indicating the total expenses\nincurred.\n\n(f) Any invoices that remain unpaid for the removal of non-recyclable waste\nshall be added to the tax roll of the person responsible to pay and\ncollected in like manner as municipal taxes.\n\n(g) In the case of a condominium corporation, the condominium corporation shall\nremain liable to the City for any costs incurred by the City at a rate set by the City\nas revised from time to time in collecting waste without the appropriate\n\"Belleville Garbage Tag\" from or adjoining the premises of the condominium\ncorporation regardless of whether such untagged garbage can be attributed to the\ncondominium corporation, an owner or tenant of a condominium unit, or any\nother person. All invoices shall be payable within 30 days after receipt. Invoices\nthat remain unpaid for such waste shall be added to the tax roll of the\ncondominium corporation and be collected in like manner as municipal taxes.\n\n(h) In the case of multi-residential, institutional or commercial properties the owner\nof such property shall remain liable to the City for any costs incurred by the City\nat a rate set by the City as revised from time to time in collecting waste without\nthe appropriate \"Belleville Garbage Tag\" from or adjoining the premises of such\nproperty regardless of whether such untagged garbage can be attributed to such\nmulti-residential, institutional or commercial property, an owner, tenant of such\nproperty or any other person. All invoices shall be payable within 30 days after\nreceipt. Invoices that remain unpaid for such waste shall be added to the tax roll\nof such property and collected in like manner as municipal taxes.\n\nPENALTIES\n\nEvery person who commits an offence pursuant to the provisions of this by-law\nshall be liable, upon conviction, to the penalties prescribed by the Provincial\nOffences Act, R.S.O. 1990 c.P33, or any legislation passed in succession\nthereto.\n"
    },
    {
      "page_number": 15,
      "text": "BY-LAW NUMBER 98-175 Page 13\n\n14. SEVERABILITY\n\nShould any section of this by-law be declared ultra vires by a court of competent\njurisdiction the remaining sections shall nevertheless remain valid and binding\nand shall be read as if the offending section had been struck out.\n\n15. SINGULAR, PLURAL AND GENDER\n\nWords in this by-law importing the singular shall include the plural and words\nimporting the plural shall include the singular and words importing the masculine\nshall include the feminine and neutered gender where the context so requires.\n\n16. That By-Law Number 14163 be and is hereby rescinded.\n\nTHIS BY-LAW SHALL COME INTO FORCE AND EFFECT IMMEDIATELY ON AND\nAFTER THE PASSING THEREOF.\n\nRead the first time this 14th day of December, 1998.\nRead a second time this 14th day of December, 1998.\nRead a third time and finally passed, this 14th day of December, 1998.\n\nROSS L. MCDOUGALL MAYOR\n\nJARY PLAMONDON CITY CLERK\n"
    },
    {
      "page_number": 16,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\nBY-LAW NUMBER 99-18\n\nA BY-LAW TO AUTHORIZE THE AMENDMENT AND EXTENSION OF AN\nAGREEMENT BETWEEN THE FORMER TOWNSHIP OF THURLOW (NOW CITY OF\nBELLEVILLE, THURLOW WARD) AND LAIDLAW WASTE SYSTEMS LTD. FOR\nCURBSIDE WASTE COLLECTION\n\nWHEREAS Sections 208.2 and 208.3.(1)(g) of the Municipal Act, R.S.O. 1990,\nChapter M.45, as amended, authorize a local municipality to pass by-laws to establish,\nmaintain and operate a waste management system and further to contract for same;\n\nAND WHEREAS the Council of The Corporation of the City of Belleville deems it\nnecessary and expedient to amend and extend the contractual agreement with Laidlaw\nWaste Systems Ltd. for Thurlow Ward for curbside waste collection.\n\nNOW THEREFORE, THE COUNCIL OF THE CORPORATION OF THE CITY OF\nBELLEVILLE ENACTS AS FOLLOWS:\n\n1. THAT Subsection 2. (b) of the Agreement made the 1st day of November, 1995\nbetween The Corporation of the Township of Thurlow and Laidlaw Waste\nSystems Ltd. be replaced with the following:\n\n\"2. (b) The per capita ratio of 10.27 shall be adjusted on January 1, 1999 in\naccordance with the Consumer Price Index for Canada for the change\nfrom the previous year. The rate commencing January 1, 2000 shall\nbe established on a similar basis.\"\n\n2. THAT the termination date in Section 6 be extended to December 31, 2000.\n\nTHIS BY-LAW SHALL COME INTO FORCE AND EFFECT IMMEDIATELY ON AND\nAFTER THE PASSING THEREOF.\n\nRead the first time this 1st day of March, 1999.\nRead a second time this 1st day of March, 1999.\nRead a third time and finally passed, this 1st day of March, 1999.\n\nROSS L. MCDOUGALL MAYOR\n\nJARY PLAMONDON CITY CLERK\n"
    }
  ]
}