{
  "file_name": "BL 14187 A Bylaw Reguating a Public Market space on the Market Square Belleville.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\n\nBY-LAW NUMBER 14187\n\nA BY-LAW TO PROVIDE FOR ESTABLISHING, MAINTAINING AND REGULATING A\n\nPUBLIC MARKET PLACE ON THE MARKET SQUARE IN THE CITY OF\nBELLEVILLE ; .\n\nTHE COUNCIL OF THE CORPORATION OF THE CITY OF BELLEVILLE ENACTS AS\nFOLLOWS:\n\nLocation\n\n4. The public Market place for the City of Belleville shall consist of the\nfollowing areas, which are hereinafter referred to as the Market Square:\n\n(a) McAnnany Street extending east from the front of the\n\nCity Hall building to the west boundary of Pinnacle\nStreet;\n\n(b) Market Street extending east from the front of the City\n\nHall building to the west boundary of Pinnacle Street,\nand;\n\n(c) The interior of the Square lying east of the City Hall\nbuilding;\n\nall of which are set out on a plan attached hereto as SCHEDULE \"A\".\n\nDefinitions\n\n2. In this By-Law:\n\n(a) “person” means an_ individual, sole proprietorship, partnership,\nunincorporated association, trust, or a body corporate.\n\n(b) \"farm\" means:\n(i) land, whether adjoining or not, operated as a farm, or;\n\n(ii) a production facility or facilities for the production or manufacture of\nproduce, livestock or handicrafts;\n\nany of which are owned or operated by the same person.\n\n(c) “vendor” means a person who holds a lease to occupy Market vendor\nspace at the Farmers' Market.\n\nMarket Clerk\n3. A Market Clerk shall be appointed by the Chief Administrative Officer to\nadminister the Farmers’ Market, to collect the annual lease payments and daily\nrentals and pay the same to the City Treasurer. Duties of the Market Clerk shall\n\nbe set out in a Post Description, which may be amended from time to time, in\naccordance with established City procedures.\n"
    },
    {
      "page_number": 2,
      "text": "BY-LAW NUMBER 14187 -2-\n\nThe Market Clerk shall be under the supervision and control of the City\nClerk, which Department may designate any person to assist the Market Clerk or\nto discharge the duties of that office in the absence of the Market Clerk. Said\nperson shall perform all the duties and have all the power and authority vested\n\nin the Market Clerk, as set out in this By-Law or any other regulations affecting\nthe operation of the Market Square.\n\nProducts\n\nf\n4. Sales on the Market Square shall be confined to produce, including fruits\nand vegetables, livestock, and handicrafts that are grown, raised, processed,\nManufactured or devised in Ontario.\n\nThe dispensing and sale of cooked and/or processed food products from\na handeart or other form of conveyance shall not be permitted on the Market\nSquare, unless approved by City Council.\n\nThe sale of handicrafts shall only be permitted by the person(s) who\nmade such handicratts, or the agent thereof.\n\nSale of citrus fruits, bananas and/or fruits and vegetables grown outside\nOntario shall not be permitted on the Market Square.\n\nProduce and livestock must be approved by the Market Clerk.\n\nProduce may include home baked goods, meats, fish, dressed poultry,\nbutter, eggs, honey, mapie syrup, apple cider, sweets, fruit, vegetables,\npreserves, home-baked cooking products, salads, flowers, plants, trees, shrubs,\nChristmas trees, firewood and ail other products from the farm, garden or dairy.\n\nLivestock shall include only common domestic pet animals such as dogs\nand cats, subject to Provincia! and Municipal health regulations.\n\nHandicrafts may include jewellery, hand-thrown ceramics, loom and\nneedle products, wood and iron products, paintings, sculpture, and all other\nsimilar products that are hand-made rather than mass produced.\n\nSecond hand goods shall not be permitted to be sold on the Market.\n\nSubject to Section 4, only goods will be permitted for sale which are\napproved by the Market Clerk.\n\nIn addition to the restrictions in Section 4, the Market Clerk will only\npermit the sate of handicrafts which are approved in consultation with the Quinte\nArts Council, the Farmer's Market Association and the Board of Management\nBelleville Business improvement Area, and which are made in Ontario.\n\nHours of Operation\n\n6. Market days shall be Tuesday, Thursday and Saturday of each week from\n6:00 a.m. until 7:00 p.m., local time.\n\nTenancy\n\n7.\n\nA Market vendor space shall be a maximum of 2.75 metres in width and\n6.0 metres in length.\n"
    },
    {
      "page_number": 3,
      "text": "BY-LAW NUMBER 14187 -3-\n\n10.\n\n11.\n\n12.\n\n13.\n\n14.\n\n15.\n\n16,\n\n17.\n\n18.\n\nThe rate structure for leasing a Market vendor space shall be as follows:\n\nvendor space annual rental $126.00 .\ndaily rental! $ 25.00 to a maximum\nof $150.00\n\nSubject to the terms of this By-Law, a person shall be permitted to lease\nor rent a maximum of three (3) Market vendor spaces.\n\nA vendor, or a person who applies to become a vendor, must be a\nmember, in good standing, of the Farmers' Market Association.\n\nA vendor must reside within, or operate and maintain a farm within a\n60 mile radius of the City of Belleville.\n\nNotwithstanding Section 11, any vendor located outside the radius\n\ndescribed in Section 11 who held a lease as of December 31, 1995, may\ncontinue to renew that lease.\n\nAny vendor described in Section 12 may only sell at the Farmers’ Market\nthe type of produce the vendor sold prior to January 1, 1996.\n\nThe Market Clerk shall not enter into a lease agreement with more than\none person from any farm.\n\nThe regulations concerning leasing of Market spaces shail be as set forth\nin SCHEDULE “B\" to this By-Law.\n\nA person wishing to become a vendor on an annual basis shall, on or\nbefore the last day in November in each year, submit an application ta the\nMarket Clerk, including the rental fee prescribed therefor. Upon such application\nthe Market Clerk, in consultation with the Farmers’ Market Association, may\nallocate space to the applicant person, if the applicant person satisfies the terms\nof this By-Law. Upon the execution of the prescribed lease agreement, the\napplicant person shall be a vendor and shall be entitled to the space so\nallocated on Market days fram the first Saturday in January to the last Saturday\nin December. Application forms may be obtained from the Market Clerk.\n\nOn and after the first Sunday in December in each year any space on the\nMarket Square, which has not been allocated on an annual basis, shall be made\navailable for daily rental on Market days. Upon submission of an application\nand the payment of the prescribed daily rental fee, the Market Clerk, in\nconsultation with the Farmers’ Market Association, shall allocate the same\namount of space as in the case of annual allocations.\n\nA Market vendor space nat occupied by the vendor to whom it is leased\n\nby 9:00 a.m. shall become available for daily rental by the Market Clerk after\n9:00 a.m.\n"
    },
    {
      "page_number": 4,
      "text": "BY-LAW NUMBER 14187 -4-\n\n19.\n\nA Market space not occupied by 9:00 a.m. may revert to its use as public\nparking space.\n\nOperation\n\n20.\n\n21.\n\n22.\n\n23.\n\n24.\n\nVendors shall place their vehicles in accordance with the directions of the\nMarket Clerk and shall keep their leased space in a clean and orderly state\nduring occupation of same and upon leaving shall remove all refuse and litter\ntherefrom. Waste containers on the Market Square are for the use of the\ngeneral public and should not be used by vendors. Vendors occupying the\ninterior of the Square shall take all reasonable precautions to prevent motor\nvehicle lubricants and fluids from teaking onto the Square.\n\nNo vendor shall operate their business in a noisy or disruptive manner or\ninterrupt the general business of the Market Square, or obstruct the same or the\npersons attending it.\n\nNo vendor shail prevent or monopolize the sale of grain, wood, meat, fish,\nvegetables, poultry, dairy products, eggs or any other articles for home\nconsumption that are sold on the Market Square.\n\nThe sale of domestic pet animals such as dogs and cats on the Market\n\nSquare is authorized only, if such animals are in a cage or container approved\nby the Market Clerk.\n\nThe storing and display of perishables and livestock shall be in\naccordance with all applicable Provincial and Municipal regulations.\n\nBy-Law Status\n\n25.\n\n26.\n\n27.\n\n28.\n\n29.\n\nNo person shall sell or offer for sale anything at the Farmers’ Market\n\nexcept in accordance with the provisions of this By-Law and after the execution\nof a lease pursuant to Section 15.\n\nMarket vendors may use the electricity supply on the Market Square for\npurposes incidental to vending with the approval of the Market Clerk only, and\n\nshall not use the electricity supply for the purpose of heating the vendor space\nor the vendor's motor vehicle and/or trailer.\n\nNo person shall occupy Market vendor spaces which he or she is not\nentitled to occupy under his or her lease.\n\nNo person shall sell produce other than produce permitted under the\nprovisions of this By-Law.\n\nNo person shail sell produce if he or she ceases to be a Member, in good\nstanding, of the Farmers’ Market Association.\n"
    },
    {
      "page_number": 5,
      "text": "BY-LAW NUMBER 14187 -§-\n\n30.\n\nBy-Law Number 14152 and ail other By-Laws or part of By-Laws\ninconsistent herewith, are hereby rescinded.\n\nContravention\n\n31.\n\nEvery person who contravenes any of the provisions of this By-Law shall\nbe guilty of an offence and liable upon conviction to the penaities provided in the\nProvincial Offences Act or any successor legislation and, in addition, if after\nreceiving notice, in writing, from the Market Clerk, or designate, as established\nin this By-Law, requiring that person to remedy the violation, such person does\nnot do so, such person shall be subject to summary removal from the Market, as\ndirected by the said Market Clerk, or designate, together with such vehicles,\ngoods, provisions and other articles which occupy space in the Market Square\nand which are, or have been, in the possession of that person.\n\nTHIS BY-LAW SHALL COME INTO FORCE AND TAKE EFFECT IMMEDIATELY ON\nAND AFTER THE PASSING THEREOF.\n\n-Read a first time this 23rd day of June, 1997.\n\nRead a second time this 23rd day of June, 1997.\n\nRead a third time and finally passed this 23rd day of June, 1997.\n\nIe A WA\n\nROSS L. MCDOUGALL, MAYOR\n\nCAO LAL\n\nWILLIAM C. MORETON, CITY CLERK\n"
    },
    {
      "page_number": 6,
      "text": "FRONT .STREET\n\nSCHEDULE \"A\" TO BY-LAW Ne\n\n— MARKET SQUARE\n\nIs 100! CITY OF BELLEVILLE\n\nPINNACLE STREET\n\nve\n"
    },
    {
      "page_number": 7,
      "text": "SCHEDULE “B\" TO BY-LAW NUMBER\n\n14187\n\nTHE CORPORATION OF THE CITY OF BELLEVILLE, HEREINAFTER REFERRED\nTO AS THE CITY, HEREBY LEASES TO:\n\ndanasenausaunseeeseneanonnousausounnegusseaesseseaaeaseneeseeaeees 0) Se\nNAME ADDRESS\n\nSPACE NUMBER(S) ....sscsseseseesserssesenees BEING PART OF THE BELLEVILLE MARKET,\n\nFOR THE YEAR ..ssecessseseeees COMMENCING JANUARY 1, 20 ......, AND TERMINATING\n\nDECEMBER 31, 20......, FOR THE SUM OF §$ .sessesesteennees\nTHE LESSEE AGREES THAT:\n\n1. The City reserves the right to suspend the operation of the Belleville Market or any\nportion thereof for specific Market days should the Market place or any portion\nthereof be required for Civic purposes. In the event of such suspension, two weeks'\nnotice shall be given to the Lessee so affected and the Lessee shall not be entitled\nto any refund of the rental for the lease.\n\n2. The City reserves the right to cancel this lease if the Lessee fails to comply with the\nterms of this By-Law as amended from time to time. In the event of such\ncancellation, the Lessee shall not be entitled to any refund of the rental for the\nlease.\n\n3. Any Lessee who wishes to cancel their lease may do so at any time during the term\nof the lease but shall not be entitled to any refund of the rental for the lease.\n\n4. The leased space(s) may only be occupied during Market hours on Market days\n\nand for Market purposes, in accordance with the terms set out in this By-Law, as\namended from time to time.\n\nTHIS LEASE IS SUBJECT TO THE PROVISIONS OF THIS BY-LAW AND\nAMENDMENTS THERETO.\n\nSIGNATURE - MARKET CLERK\n"
    },
    {
      "page_number": 8,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\n\nBY-LAW NUMBER 98-55\n\nA BY-LAW TO AMEND BY-LAW NUMBER 14187 BEING A BY-LAW TO PROVIDE\nFOR ESTABLISHING, MAINTAINING AND REGULATING A PUBLIC MARKET\nPLACE ON THE MARKET SQUARE IN THE CITY OF BELLEVILLE\n\nWHEREAS By-Law Number 14187 was duly passed by the Council of The Corporation\nof the City of Belleville on the 23rd day of June, 1997;\n\nAND WHEREAS it is now deemed necessary and expedient that By-Law Number\n14187 be amended;\n\nNOW, THEREFORE, THE COUNCIL OF THE CORPORATION OF THE CITY OF\nBELLEVILLE ENACTS AS FOLLOWS:\n\n1. THAT, Definitions, Section 2, be amended to include the following.\n\n\"2. (d) ‘Niagara tender fruit' means peaches, plums,\nnectarines, apricots, pears, grapes and sweet and\n\nsour cherries, grown in the Niagara area of\nOntario.\"\n\n2. THAT, Section 8 of By-Law Number 14187 be amended by adding the following.\n\"non-vehicle spaces annual rental $90.00\ndaily rental $15.00 to a\n\nmaximum of\n$105.00\"\n\n"
    },
    {
      "page_number": 9,
      "text": "BY-LAW NUMBER 98-55 Page 2\n\n3. THAT, Section 11 of By-Law Number 14187 be amended to read as follows:\n\"41. A vendor must reside within, or operate and maintain a\nfarm within a 60 mile radius of the City of Belleville,\n\nwith the exception of a farmer selling only Niagara\ntender fruit.”\n\nTHIS BY-LAW SHALL COME INTO FORCE AND TAKE EFFECT IMMEDIATELY ON\nAND AFTER THE PASSING THEREOF.\n\nRead a first time this 1st day of June, 1998.\nRead a second time this 1st day of June, 1998.\n\nRead a third time and finally passed this 1st day of June, 1998.\n\n(Sgd.) Ross L. McDougall\nROSS L. MCDOUGALL MAYOR\n\n(Sgd.) dary Plamondon\nJARY PLAMONDON CITY CLERK\n"
    },
    {
      "page_number": 10,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\nBY-LAW NUMBER 2000-88\n\nA BY-LAW TO AMEND BY-LAW NUMBER 14187 BEING A BY-LAW TO PROVIDE\nFOR ESTABLISHING, MAINTAINING AND REGULATING A PUBLIC MARKET\nPLACE ON THE MARKET SQUARE IN THE CITY OF BELLEVILLE\n\nWHEREAS By-Law Number 14187 was duly passed by the Council of The Corporation\nof the City of Belleville on the 23rd day of June, 1997;\n\nAND WHEREAS it is now deemed necessary and expedient that By-Law Number\n14187 be amended;\n\nNOW, THEREFORE, THE COUNCIL OF THE CORPORATION OF THE CITY OF\nBELLEVILLE ENACTS AS FOLLOWS:\n\n1. THAT, Products, Section 4, be amended to include the following:\n\n\"4. The dispensing and sales, at the Market from a handcart or other form\nof conveyance, of cooked and/or processed food products that can be\nreheated, if necessary, shall be permitted on the Market Square. All\nproducts shall be government inspected and must meet the Belleville\nFarmers’ Market By-Laws for Ontario produced products.\"\n\nTHIS BY-LAW SHALL COME INTO FORCE AND TAKE EFFECT IMMEDIATELY ON:\nAND AFTER THE PASSING THEREOR.\n\nRéad a first time this 12th day of June, 2000.\nRead a second time this 12th day of June, 2000.\nRead a third time and finally passed this 12th day of June, 2000.\n\nKan\n\nROSS L. MCDOUGALL MAYOR\n\nCITY CLERK\n"
    }
  ]
}