{
  "file_name": "BL 2004-19 A Bylaw to Establish a Site Plan Control Area in the City of Belleville.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\nBY-LAW 2004-93\n\nA BY-LAW TO ESTABLISH A SITE PLAN CONTROL AREA WITHIN THE CITY OF\n\nBELLEVILLE\n\nWHEREAS the Corporation of the City of Belleville has adopted an official plan\n\nthat provides for the establishment of a site plan control area pursuant to Section 41 of\nthe Planning Act, R.S.O. 1990, c.P.13, as amended,\n\nAND WHEREAS the Council of the Corporation of the City of Belleville wishes to\n\nconsolidate its site plan control area by-laws established by each of the former\nmunicipalities that now comprise the City of Belleville;\n\nNOW THEREFORE, THE COUNCIL OF THE CORPORATION OF THE CITY\n\nOF BELLEVILLE ENACTS AS FOLLOWS:\n\n1.\n\nIn this By-law:\n\n“City” means the City of Belleville.\n\n“Clerk” means the City’s Clerk, or designate.\n\n“Council” means the Council of the Corporation of the City of Belleville.\n\n“Development” means the construction, erection or placing of one or more\nbuildings or structures on land or the making of an addition or alteration to a\nbuilding or structure that has the effect of substantially increasing the size or\nusability thereof, or the laying out and establishment of a commercial parking\nlot or of sites for the location of three or more trailers as defined in subsection\n168(5) of the Municipal Act, 2001, or of sites for the location of three or more\nmobile homes as defined in subsection 46(1) of the Planning Act, R.S.O.\n1990, c.P.13, as amended or of sites for the construction, erection or location\nof three or more land lease community homes as defined in subsection 46(1)\nof the Planning Act, R.S.O. 1990, c.P.13, as amended.\n\n“Manager of Approvals” means the City’s Manager of Approvals, or designate.\n\n“Planning Advisory Committee” means the Planning Advisory Committee for the\nCity of Belleville appointed by Council.\n\n“Technical Review Committee” means a committee consisting of the City’s Chief\nAdministrative Officer, the City’s Director of Development Services, and the\nCity’s Director of Engineering and Public Works, or designates.\n\nAll land located within the corporate limits of the City of Belleville is hereby\ndesignated as a site plan control area pursuant to Section 41(2) of the Planning\nAct, R.S.O. 1990, c. P.13, as amended.\n\nNo person shall undertake any development within a site plan control area,\nexcept as may otherwise be permitted pursuant to Section 5 of this By-law,\nwithout first obtaining the approval from the City of:\n"
    },
    {
      "page_number": 2,
      "text": "By-Law Number 2004-93 -2-\n\na)\n\nb)\n\nplans showing the location of all buildings and structures to be erected\nand showing the location of all facilities and works to be provided in\nconjunction therewith including those facilities and works referred to in\nSection 4 a) of this By-law; and\n\ndrawings showing plans, elevations and cross section views for each\n\nbuilding to be erected, which drawings are sufficient to display:\n\n(i) the massing and conceptual design of the proposed building;\n\n(ii) the relationship of the proposed building to adjacent buildings,\nstreets, and exterior areas to which members of the public have\naccess; and\n\n(iii) the provision of interior walkways, stairs, elevators and escalators\nto which members of the public have access from streets, open\nspaces and interior walkways in adjacent buildings.\n\nAs a condition of approval of the plans and drawings referred to in Section 3 of\n\nthis By-law, the City may require the owner of the land being developed to:\n\na)\n\nb)\n\nprovide to the satisfaction of and at no expense to the City any or all of\n\nthe following:\n\n()) widenings of highways that abut on the land;\n\n(ii) subject to the Public Transportation and Highway Improvement\nAct, as amended, facilities to provide access to and from the land\nsuch as access ramps, and curbing and traffic direction signs;\n\n(iif) off-street vehicular loading and parking facilities, either covered or\nuncovered, facilities, access driveways, including driveways for\nemergency vehicles, and the surfacing of such areas and\ndriveways;\n\n(iv) | walkways and walkway ramps, including the surfacing thereof,\nand all other means of pedestrian access;\n\n(v) facilities for the lighting, including floodlighting, of the land or of\nany buildings or structures thereon;\n\n(vi) walls, fences, hedges, trees, shrubs or other ground cover or\nfacilities for the landscaping of the lands or the protection of\nadjoining lands;\n\n(vii) vaults, central storage and collection areas and other facilities and\nenclosures for the storage of garbage and other waste material;\n\n(viii) easements conveyed to the City for the construction,\nmaintenance, or improvement of watercourses, ditches, land\ndrainage works, sanitary sewage facilities and other public utilities\non the land; and\n\n(ix) grading or alteration in elevation or contour of the land and\nprovision for the disposal of storm, surface and waste water from\nthe land and from any buildings or structures thereon;\n\nmaintain to the satisfaction of the City and at the sole risk and expense of\nthe owner any or ail of the facilities or works mentioned in paragraphs (i)\nto (ix) inclusive of Section 4 a) of this By-law, including the removal of\nsnow from access ramps and driveways, parking and loading areas, and\nwalkways; and\n"
    },
    {
      "page_number": 3,
      "text": "By-Law Number 2004-93 -3-\n\nc)\n\nenter into one or more agreements with the City dealing with and\nensuring the provision of any or all of the facilities, works or matters\nmentioned in Section 4 a) of this By-law and the maintenance thereof as\nmentioned in Section 4 b) of this By-law or with the provision and\napproval of the plans and drawings referred to in Section 3 of this By-law,\nand in default by the owner of the land of any of the requirements set out\nherein, the work, matter or thing may be done by the City at the owner's\nexpense in accordance with Section 427 of the Municipal Act, 2007.\n\nAll classes of development shall require approval of plans and drawings as set\n\nout in Section 3 of this By-law with the exception of:\n\na)\nb)\nc)\nd)\n\n@)\n\nf)\n\n6. a)\n\nc)\n\none family detached dwellings;\n\nsemi-detached dwellings;\n\nduplex dwellings;\n\nbuildings and structures accessory to a one family detached dwelling,\nsemi-detached dwelling, or duplex dwelling;\n\nbuildings and structures erected in support of a farming operation, which\nshall mean an agricultural land use located within a rural or an agricultural\nzone as set out in the City’s zoning by-law;\n\nall aspects of a licensed aggregate operation that fall under the\njurisdiction of the Ministry of Natural Resources.\n\nPursuant to Section 41(13) (b) of the Planning Act, R.S.O. 1990, c.P.13,\nas amended, Council hereby delegates its powers to approve plans and\ndrawings pursuant to Section 3 of this By-law and its powers to impose\nconditions pursuant to Section 4 of this By-law, to the Manager of\nApprovals.\n\nSubject to the right of referral to the Ontario Municipal Board as provided\nfor by Section 41(12) of the Planning Act, R.S.O. 1990, c.P.13 as\namended, any decision of the Manager of Approvals with respect to the\nprocessing of an application for site plan approval, or the approval of\nplans and drawings, or the imposition of conditions thereto pursuant to\nthe provisions of this By-law, may be appealed by the applicant for such\napproval by filing a notice of appeal in writing with the Manager of\nApprovals, to the City's Technical Review Committee, who shall have all\nthe rights and obligations assigned to the Manager of Approvals under\nSection 6 a) of this By-law.\n\nAny decision of the Technical Review Committee with respect to an\nappeal, may be further appealed by the applicant for such approval by\nfiling a notice of appeal in writing with the Manager of Approvals, to the\nCity’s Planning Advisory Committee who shall make a recommendation to\nCouncil, and subject to the right of appeal to the Ontario Municipal Board\nas provided for in Section 41(12) and Section 41(12.1) of the Planning\nAct, R.S.O. 1990, c.P.13, as amended, the decision of Council shall be\nfinal.\n\nPursuant to Section 41(13) (b) of the Planning Act, R.S.O. 1990, c.P.13, as\n\namended, Council hereby delegates its authority to execute agreements which\nmay be required as a condition to the approval of plans and drawings, as\n"
    },
    {
      "page_number": 4,
      "text": "By-Law Number 2004-93 -4-\n\nprovided for in Section 4 c) of this By-law, to the Manager of Approvals and the\nClerk.\n\n8. a) Council may, by by-law, establish fees respecting the processing of\napplications for approval of plans and drawings as set out in Section 3 of\nthis By-law and the implementation or enforcement of conditions\nestablished pursuant to the provisions of Section 4 of this By-law.\n\nb) Pursuant to Section 8.13 of the City of Belleville Official Plan, Council\nmay establish standard application forms and procedures, policies and\nstandards respecting the processing of applications for site plan approval\nwhich are not inconsistent with the provisions of this By-law, and which\nwithout limiting the generally of the foregoing, such procedures, policies\nand standards may include the defining the nature of plans, drawings,\nand other documentation that may be required by City in support of an\napplication for site plan approval.\n\n9. lf any provision of this By-law is deemed by a court of competent jurisdiction to\nbe illegal or not enforceable by law, such clause shall be considered separate\nand severable from this By-law, and this By-law’s remaining provisions shall\nremain in force as though the said provision had never been enacted.\n\n10. The following by-laws are hereby repealed:\n\na) By-law 12695 of the Corporation of the City of Belleville as it was\nconstituted on May 29\", 1989;\n\nb) By-law 3157 of the Corporation of the Township of Thurlow as it was\nconstituted on the 23” day of January 1989;\n\nc) By-law 98-83 of the Corporation of the City of Quinte West insofar as\nsuch by-law applies to the lands that were part of the City of Quinte West\nand annexed to the City of Belleville effective January 1, 2000 and\nJanuary 1, 2003.\n\n11. This By-law may be cited as the “City of Belleville Site Plan Control Area By-law’.\nTHIS BY-LAW SHALL COME INTO FULL FORCE AND EFFECT UPON FINAL PASSING\nTHEREOF.\n\nRead a first time this 14\" day of June, 2004\nRead a second time this 14\" day of June, 2004\nRead a third time and finally passed this 14\" day of June, 2004.\n\nMayor\n"
    }
  ]
}