{
  "file_name": "BL 2025-142 Fireworks By-law _ Repeal 2022-129.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "The Corporation of the City of Belleville\nBy-law Number 2025-142\n\nA By-law to Regulate the Sale and Setting Off of Fireworks and Pyrotechnic\nSpecial Effects within the City of Belleville and to Repeal By-law Number 2022-129\n\n(Fireworks By-law)\n\nWhereas Section 120 of the Municipal Act, S.O. 2001, c.25, as amended, authorizes a\nmunicipality to pass by-laws to prohibit and regulate the storage, keeping and\ntransportation of explosives and other dangerous substances, including requirements\nthat a permit be obtained from the municipality for the storage of explosives and\nimposing conditions on such permits;\n\nAnd Whereas Section 121 of the Municipal Act, S.O. 2001 , c.25 as amended,\nauthorizes a municipality to pass by-laws to prohibit and regulate the sale of fireworks\nand the setting off of fireworks, including requirements that a permit be obtained from\nthe municipality for the sale or setting off of such fireworks and imposing conditions on\nsuch permits;\n\nAnd Whereas Section 446 of the --Municipal Act, S.O. 2001, ¢.25, as amended,\nprovides that where a municipality has the authority by By-law to direct or require that a\nmatter or thing be done, the municipality may in the same or another By-law direct that,\nin default of it being done by the person directed or required to do so, such matter or\nthing shall be done at the person's expense and the municipality may recover the costs\nby action or by adding the costs to the tax roll and collecting them in the same manner\nas taxes;\n\nAnd Whereas Section 7.1 of the Fire Protection and Prevention Act,. S.O. 1997, c4, as\namended, provides that the council of a municipality may pass by-laws regulating fire\nprevention, including the spreading of fires;\n\nAnd Whereas the Council of the City of Belleville deems it expedient and necessary for\nthe safety and well-being of the community to regulate the sale and use of fireworks and\npyrotechnic special effects within the City of Belleville;\n\nNow Therefore the Council of The Corporation of the City of Belleville hereby enacts as\nfollows:\n\nPart1\nDefinitions\n1. In this By-law:\n\n“Act\" means the Explosives Act, Revised Statutes of Canada, 1985, Chapter E-\n17, and the Regulations enacted thereunder as amended from time to time or any\nAct and Regulations enacted in substitution therefore;\n\nPage 1 of 15\n"
    },
    {
      "page_number": 2,
      "text": "“City” or \"City of Belleville\" means the municipal corporation of the City of\nBelleville or the geographic area of the City of Belleville as the context requires;\n\n\"Consumer Firework\" means an outdoor, fow hazard, recreational firework that\nis classed as a Class 7, Division 2, Subdivision 1 Firework under the Act and\nincludes fireworks showers, fountains, golden rain, lawn lights, pin wheels, Roman\ncandles, volcanoes, and sparklers but does not include Christmas crackers and\ncaps for toy guns containing not in excess of twenty-five one-hundredths of a grain\nof explosive used per cap;\n\n\"Consumer Fireworks Sales Permit\" means a permit issued in accordance with\nthis By-law by the Fire Chief for the sale of Consumer Fireworks;\n\n\"Discharge\" means to fire, ignite, explode or set off or cause to be fired, ignited,\nexploded or set off and the words \"discharged\" and \"discharging\" have a similar\nmeaning;\n\n\"Display Firework\" means an outdoor, high hazard, recreational firework that is\nclassed as a Class 7, Division 2, Subdivision 2 Firework under the Act, and\nincludes rockets, serpents, shells, bombshells, tourbillions, maroons, large wheels,\nbouquets, bombardos, waterfalls, fountains, batteries, illumination, set pieces and\npigeons but does not include Firecrackers;\n\n\"Display Fireworks Permit\" means a permit issued in accordance with this By-\nlaw by the Fire Chief for the display of Display Fireworks;\n\n“Display Supervisor\" means a person who is an approved purchaser of Display\nFireworks and who is qualified under the Act to supervise the Discharge of Display\nFireworks;\n\n“Enforcement Officer\" means the Fire Chief, Deputy Fire Chiefs, Senior Fire\nPrevention Officer, every member of the Belleville Fire and Emergency Services\ndesignated as an Assistant to the Fire Marshal, every By-law Enforcement Officer\nfor the City of Belleville, and every police constable with Belleville Police Service;\n\n\"FPPA\" means the Fire Protection and Prevention Act, 1997, S.O. 1997, c.4, as\namended, and the Regulations enacted thereunder as amended from time to time\nor any Act and Regulations enacted in substitution therefor;\n\n\"Fire Chief means the Chief of Fire Services of the City or authorized delegates;\n\n\"Firecracker\" means a pyrotechnic device that explodes when ignited and does\nnot make any subsequent display or visible effect after the explosion, and includes\nthose devices commonly known as Chinese firecrackers, but does not include\npaper caps containing not more than twenty-five one-hundredths of a grain of\nexplosive on average per cap, or devices for use with such caps, safety flares,\nmarine rockets, and other distress signals;\n\n\"Fireworks\" means Display Fireworks, Pyrotechnic Special Effects Fireworks and\nConsumer Fireworks;\n\nPage 2 of 15\n"
    },
    {
      "page_number": 3,
      "text": "“Prohibited Firework\" includes but is not limited to cigarette loads or pings,\nexploding matches, sparkling matches, ammunition for miniature tie clip, cufflink\nor key chain pistols, auto alarms or jokers, cherry bombs, M-80 and silver salutes\nand flash crackers, throw down torpedoes and crackling balls, exploding golf balls,\nstink bombs and smoke bombs, tear gas pens and launchers, party peppers and\ntable bombs, table rockets and battle sky rockets, fake firecrackers and other trick\ndevices or practical jokes as included on the most recent list of Prohibited\nFireworks as published from time to time under the Act;\n\n“Public Fireworks Display\" means an exhibition of Fireworks in an outdoor\nassembly or open air occupancy to which the public is invited, attends, may attend,\nor is admitted with or without a fee being charged;\n\n“Pyrotechnician\" means a person who is certified under the Act as a Theatrical\nUser, an Assistant, a Pyrotechnician or a Special Effects Pyrotechnician and is\nqualified to purchase and supervise the display of Pyrotechnic Special Effect\nFireworks under the Act;\n\n“Pyrotechnic Special Effect Firework\" means a high hazard firework that is\nclassed as a Class 7, Division A, Subdivision 5 Firework under the Act and that is\nused to produce a special pyrotechnic effect for indoor or outdoor performances\n\nand includes black powder bombs, bullet effect, flash powder, air bursts, smoke\ncompositions, gerbs, lances and wheels; and\n\n“Pyrotechnic Special Effect Fireworks Permit\" means a permit issued in\naccordance with this By-law by the Fire Chief for the display of Pyrotechnic Special\nEffect Fireworks;\n\n\"Sell\" includes offer for sale, cause or permit to be sold and to possess for the\npurpose of sale and the words \"selling\" and \"sold\" have a similar meaning.\n\nPart Il\nSale and Discharge of Firecrackers\n\n2. (1) No person shall Sell any Firecrackers.\n\n(2) No person shall Discharge any Firecrackers.\nPart ill\n\nSale and Discharge of Prohibited Fireworks\n3. (1) No person shall Sell any Prohibited Fireworks.\n\n(2) No person shall Discharge any Prohibited Fireworks.\n\nPage 3 of 15\n"
    },
    {
      "page_number": 4,
      "text": "Part IV\n\nSale of Consumer Fireworks\n\n4.\n\n(1) No person shall Sell Consumer Fireworks unless a Consumer Fireworks\nSales Permit has first been obtained from the Fire Chief in accordance with Part\nIV of this By-law.\n\n(2) A member of Belleville Fire Services, Fire Prevention, shall be permitted to\nconduct a site inspection in relation to each permit application received pursuant\nto Part IV of this By-law.\n\n(3) No person shail Sell Consumer Fireworks in a building unless the provisions\nof the Ontario Fire Code and all other applicable Acts and Regulations are\ncomplied with.\n\n(4) A person applying for a Consumer Fireworks Sales Permit shall be required\nto submit the following:\n\na. Acompleted application, in the form provided by the Fire Chief;\n\nb. Written consent of the owner of the property on which the sale of\nConsumer Fireworks is proposed, unless the applicant is the owner of the\nproperty;\n\nc. The fee as prescribed by the City’s Fees and Charges By-law as approved\nby Council for the City of Belleville from time to time;\n\nd. A site plan for the sale location;\n\ne. Adescription of fire emergency procedures; and\n\nf. Such other information as required by the Fire Chief.\n\n(5) A Consumer Fireworks Sales Permit shall not be issued where:\n\na. The permit application is incomplete;\n\nb. The property on which the sale of Consumer Fireworks is proposed is not\nzoned to permit a retail store;\n\nc. There are reasonable grounds for belief that the sale of Consumer\nFireworks by the applicant will result in a breach of this By-law, the FPPA\nor the Act; or\n\nd. The information provided in support of the Consumer Fireworks Sales\nPermit pursuant to Section 4(4) of this By-law is unacceptable to the Fire\nChief in their sole discretion, acting reasonably.\n\n(6) The Fire Chief may revoke a Consumer Fireworks Sales Permit where:\n\na. The person to whom the permit is issued fails to comply with all provisions\nand conditions to which the permit is subject in accordance with this By-\nlaw;\n\nb. The application for the Consumer Fireworks Sales Permit contains false or\nmisleading information;\n\nPage 4 of 15\n"
    },
    {
      "page_number": 5,
      "text": "c. The building from which Consumer Fireworks are offered for sale is in non-\ncompliance with the provisions of the Ontario Fire Code or any other\napplicable Act or Regulation.\n\n(7) No person shall Sell Consumer Fireworks unless they are eighteen (18) years\nof age or older.\n\n(8) No person shall Sell Consumer Fireworks from an outdoor stand, tent,\nunenclosed trailer, shipping container, motor vehicle, or residential dwelling.\n\n(9) No person shall Sell Consumer Fireworks unless they are included on the\nmost recent List of Authorized Explosives as published from time to time by the\nExplosives Branch of the Department of Natural Resources (Canada) or its\nsuccessor.\n\n(10) No person shall store Consumer Fireworks except as permitted under the\nAct.\n\n(11) No person shall exhibit Consumer Fireworks unless the Consumer\nFireworks are separated into individual lots that do not exceed 25 kilograms in\ngross weight, and such separation between lots shall be sufficient to prevent fire\nfrom spreading rapidly from one lot to the next by:\n\na. Maintaining a minimum aisle width of 1.1 metres between lots;\n\nb. Maintaining a partition, constructed of 6-millimetre plywood or other\nsuitable material, that extends a minimum of 15 centimetres above the\nheight of the lot or to the display shelf above; or\n\nc. Maintaining sufficient separation between lots by such other suitable\nmethod or means; and\n\nd. Ensuring that no more than ten percent (10%) of the area of any display\nshelf on which Consumer Fireworks are exhibited contain holes or other\nopenings.\n\n(12) No person shall exhibit Consumer Fireworks that are not in consumer packs,\nunless the Consumer Fireworks are inaccessible to the public and are displayed\nin a glass or Plexiglas case or other suitable receptacle.\n\n(13) No person shall exhibit Consumer Fireworks that are exposed, or may be\nexposed, to the rays of the sun or to excess heat, or that are within close\nproximity to flammable goods.\n\n(14) No person shall exhibit Consumer Fireworks on a display board or in a shop\nwindow unless the display consists of mock samples only and does not contain\nany explosive composition.\n\n(15) No person who Sells Consumer Fireworks shall, at any time, keep or permit\nthe keeping of Consumer Fireworks unless the location or shop is designated as\nano smoking area, has been posted with \"No Smoking\" signs, and is equipped\nwith the appropriate number and class of fire extinguishers as may be required\nby the Fire Chief.\n\nPage 5 of 15\n"
    },
    {
      "page_number": 6,
      "text": "(16) No person who Sells Consumer Fireworks shall exhibit Consumer Fireworks\nto the public at any time unless the focation or shop is attended by the vendor or\nan employee thereof.\n\n(17) No person shall exhibit Consumer Fireworks in an indoors shop or location,\nor in a trailer unless there are a minimum of two (2) unobstructed, clearly\nidentified exits to ensure that employees and the public can quickly evacuate in\nthe event of a fire.\n\n(18) No person shall Sell Consumer Fireworks except on the following days:\n\na. Victoria Day and Canada Day; and\nb. Each of the seven (7) days immediately preceding Victoria Day and\nCanada Day\n\n(19) No person shall advertise the sale of Consumer Fireworks except on Victoria\nDay and Canada Day, and the preceding twenty one (21) days in each case.\n\n(20) No person who has obtained a Consumer Fireworks Sales Permit from the\nFire Chief as required by Part IV of this By-law shall be required to obtain a\nHawker and Peddler business license, with respect to the sale of Consumer\nFireworks, as required by the City's Business License By-law 2005-318, as\namended, or any replacement by-law.\n\nPart V\n\nConditions Applying to Consumer Fireworks Sales Permit\n\n5. (1) The Fire Chief may issue permits for the sale of Consumer Fireworks on the\nconditions set forth in Part V of this By-law.\n(2) The following conditions shall apply to all Consumer Fireworks Sales Permits:\n\na. The permit is valid only for calendar year in which it is issued;\n\nb. The permit is valid only for the sale location specified in the permit;\n\nc. Every permit holder shall provide and maintain fully operational fire\nextinguishing equipment ready for immediate use;\n\nd. The permit holder shall sell Consumer Fireworks in conformance with the\ninformation provided to the Fire Chief pursuant to Section 4(4) of this By-\nlaw;\n\ne. The permit holder shall comply at all times with the provisions of the Act,\n\nFPPA and the provisions of this By-law;\n. Any other condition deemed reasonable in the circumstances by the Fire\nChief.\n\nal\n\n(3) No permit holder shall Sell Consumer Fireworks except in accordance with the\nconditions of the permit.\n\nPage 6 of 15\n"
    },
    {
      "page_number": 7,
      "text": "Part VI\n\nDischarge of Consumer Fireworks\n6. (1) No person shali Discharge Consumer Fireworks except on the following days:\n\n. Victoria Day;\n\nThe day immediately preceding Victoria Day;\n\nThe day immediately following Victoria Day;\n\n. Canada Day;\n\n. The day immediately preceding Canada Day;\n\nThe day immediately following Canada Day;\n\ng. Such other times and such other dates as permitted by the Fire Chief.\n\n*~MPa00®n\n\n(2) No person under the age of eighteen (18) years shall Discharge any\nConsumer Fireworks.\n\n(3) No person being the parent or guardian of any person under the age of\neighteen (18) years shall allow the person under the age of eighteen (18) to\nDischarge any Consumer Fireworks.\n\n(4) A person eighteen (18) years of age or older may Discharge Consumer\nFireworks on any land belonging to them, or on any other privately owned land\nwhere the owner thereof has given permission for such display or Discharge of\nConsumer Fireworks.\n\n(5) No person shall Discharge any Consumer Fireworks in such a manner as\nmight create danger or constitute a nuisance to any person or property, or to do\nor cause or allow any unsafe act or omission at the time and place for the\nDischarging of any Consumer Fireworks.\n\n(6) No person shal! Discharge any Consumer Fireworks in or into any building,\ndoorway, or automobile.\n\n(7) No person shall Discharge any consumer Fireworks in zone B of Schedule 1.\n(8) No person shall Discharge any Consumer Fireworks in or on or into any\nhighway, street, lane, square or other public place, unless prior written\n\npermission has been obtained from the Fire Chief.\n\n(9) All persons Discharging Consumer Fireworks shall have means to extinguish\nConsumer Fireworks readily available.\n\n(10) No Consumer Fireworks shall be discharged during an open air burning ban\nor partial burning ban.\n\n(11) No Consumer Fireworks shall be discharged during a high wind warning\nissued by environment Canada.\n\nPage 7 of 15\n"
    },
    {
      "page_number": 8,
      "text": "(12) No Consumer Fireworks shall be discharged on City of Belleville property.\n\nPart VII\n\nDisplay Fireworks\n\n7.\n\n(1) No person or group of persons shall hold a display of Display Fireworks in the\nCity of Belleville without first having obtained a permit to do so from the Fire\nChief in accordance with Part VII of this By-law.\n\n(2) A member of Belleville Fire Services, Fire Prevention, shall be permitted to\nconduct a site inspection in relation to each permit application received pursuant\nto Part VII of this By-law.\n\n(3) No person or group of persons shall hold a Public Fireworks Display using\nConsumer Fireworks.\n\n(4) Every application for a permit required under Part VI | of this By-law shall be\nmade to the Fire Chief a minimum of thirty (30) days prior to the event when the\nproposed display of Display Fireworks is to occur.\n\n(5) A person applying for a Display Fireworks Permit shall be required to submit\nthe following:\n\na. A completed permit application, in the form provided by the Fire Chief;\n\nb. A site plan providing a description of the site to be used for the Discharging\nof the Display Fireworks;\n\nc. Adescription of the fire emergency procedures;\n\nd. Proof that the applicant is certified as a Display Supervisor;\n\ne. Written consent of the owner of the property on which the Discharge of\nDisplay Fireworks is proposed, unless the Applicant is the owner of the\nproperty;\n\nf. The fee as prescribed by the City’s Fees and Charges By-law as approved\n\nby Council for the City of Belleville from time to time;\n\ng. Proof of insurance as required by Part XI of this By-law;\n\nh. Signed Indemnity as required by Part XI] of this By-law; and\n\ni. Such other information as required by the Fire Chief.\n\n(6) A Display Fireworks Permit shall not be issued where:\n\na. The permit application is incomplete;\n\nb. The applicant is not a Display Supervisor;\n\nc. The display is not being held under the auspices of an established club,\nassociation or group of persons;\n\nd. The purpose of the display is not of civic, national or international\nsignificance, or not of special significance for particular interest groups; or\n\ne. There are reasonable grounds for belief that the holding of the Display\n\nFireworks will result in a breach of this By-law, the FPPA or the Act; or\n\nPage 8 of 15\n"
    },
    {
      "page_number": 9,
      "text": "f. The information provided in support of the Display Fireworks Permit\n\npursuant to Section 7(5) is unacceptable to the Fire Chief in their sole\ndiscretion, acting reasonably.\n\n(7) The Fire Chief may revoke a Display Fireworks Permit where:\n\na.\n\nb.\n\nc.\n\nd.\n\nPart VIII\n\nThe person to whom the permit is issued fails to comply with all provisions\nand conditions to which the permit is subject in accordance with this By-\nlaw;\n\nThe application for the Display Fireworks Sales Permit contains false or\nmisleading information;\n\nEnvironmental concerns such a weather conditions, wind speed and/or\nwind direction are a factor;\n\nAn Open Air Fire Ban has been instituted.\n\nConditions Applying to Display Fireworks Permit\n\n8. (1) The Fire Chief may issue permits for displays of Display Fireworks on the\nconditions set forth in Part VII of this By-law.\n(2) The following conditions shall apply to all Display Fireworks Permits:\n\na.\n\nb.\n\nThe permit is valid only for the display at the place and on the date or\ndates set forth in the permit;\n\nThe permit holder, who shall be a Display Supervisor, shall supervise the\ndisplay of Display Fireworks at all times;\n\nThe permit holder, who shall be a Display Supervisor, shall Discharge the\nDisplay Fireworks;\n\n. Every permit holder shall provide and maintain fully operational fire\n\nextinguishing equipment ready for immediate use;\n\n. The permit holder shall hold the display of Display Fireworks in\n\nconformance with the information provided to the Fire Chief pursuant to\nSection 7(5) of this By-law;\n\n. The permit holder shall comply at all times with the provisions of the Act,\n\nFPPA, the Display Fireworks Manual published by Natural Resources\nCanada or any successor publication, and the provisions of this By-law;\n\n. The permit holder shall comply with any wind speed or direction limitations\n\nimposed on the permit (Canadian Forces base Trenton shall be the\nreferenced authority); and\n\n. Any other condition deemed reasonable in the circumstances by the Fire\n\nChief.\n\n(3) No permit holder shall Discharge Display Fireworks except in accordance with\nthe conditions of the permit.\n\n(4) The permit holder holding the display of Display Fireworks shall ensure that\nall unused Display Fireworks and all debris are removed forthwith from the site\nand safety disposed of.\n\nPage 9 of 15\n"
    },
    {
      "page_number": 10,
      "text": "Part IX\n\nPyrotechnic Special Effects Fireworks\n\n9.\n\n(1) No person or group of persons shall Discharge any Pyrotechnic Special Effect\nFireworks in the City of Belleville without first having obtained a permit\nauthorizing the display of Pyrotechnic Special Effect Fireworks from the Fire\nChief in accordance with Part IX of this By-law.\n\n(2) A member of Belleville Fire Services, Fire Prevention, shall be permitted to\nconduct a site inspection in relation to each permit application received pursuant\nto Part IX of this By-law.\n\n(3) Every application for a permit required under Part IX of this By-law shall be\nmade to the Fire Chief a minimum of thirty (30) days prior to the event when the\nproposed Discharge of Pyrotechnic Special Effect Fireworks is to occur.\n\n(4) A person applying for a Pyrotechnic Special Effect Fireworks Permit shall be\nrequired to submit the following:\n\na. A completed permit application, in the form provided by the Fire Chief;\n\nb. A site plan of the facility and room capacity, the stage and the Pyrotechnics\nSpecial Effect Fireworks storage area;\n\nc. Adescription of the fire emergency procedures;\n\nd. Proof that the applicant is certified as a Pyrotechnician;\n\ne. Written consent of the owner of the property on which the Discharge of\nPyrotechnic Special Effects Fireworks is proposed, unless the Applicant is\nthe owner of the property;\n\nf. The f fee as prescribed by the City’s Fees and Charges By-law as approved\n\nby Council for the City of Belleville from time to time;\n\ng. Proof of insurance as required by Part XI of this By-law;\n\nh. Signed Indemnity as required by Part XIl of this By-law; and\n\ni. Such other information as required by the Fire Chief.\n\n(5) A permit for the display of Pyrotechnics Special Effects Fireworks shall not be\nissued where:\n\na. The application is incomplete;\n\nb. The applicant is not a Pyrotechnician under the Act; or\n\nc. There are reasonable grounds for belief that holding a display of\nPyrotechnic Special Effect Fireworks will result in a breach of this bylaw,\nthe FPPA or the Act; or\n\nd. The information provided in support of the Display Fireworks Permit\npursuant to Section 9(4) of this By-law is unacceptable to the Fire Chief in\ntheir sole discretion, acting reasonably.\n\nPage 10 of 15\n"
    },
    {
      "page_number": 11,
      "text": "(6) The Fire Chief may revoke a Pyrotechnics Special Effects Fireworks Permit\nwhere:\n\na.\n\nPart X\n\nThe person to whom the permit is issued fails to comply with all provisions\nand conditions to which the permit is subject in accordance with this By-\nlaw;\n\n. The application for the Pyrotechnics Special Effects Permit contains false\n\nor misleading information;\n\nEnvironmental concerns such a weather conditions, wind speed and/or\nwind direction are a factor;\n\nAn Open Air Fire Ban has been instituted.\n\nConditions Applying to Pyrotechnic Special Effects Fireworks\n\nPermit\n\n10. (1) The Fire Chief may issue permits for displays of Pyrotechnic Special\nEffect Fireworks on the conditions set forth in Part X of this By-law.\n\n(2) The following conditions shall apply to Pyrotechnic Special Effect Fireworks\nPermits:\n\na.\n\nb.\n\nThe permit is valid only for the display at the place and on the date or\ndates set forth in the permit;\n\nThe permit holder, who shall be a Pyrotechnician, shall supervise the\ndisplay of Pyrotechnic Special Effect Fireworks;\n\n. The permit holder, who shall be a Pyrotechnician, shall Discharge the\n\nPyrotechnic Special Effects Fireworks;\n\n. The permit holder shall provide and maintain fully operational fire\n\nextinguishing equipment ready for immediate use;\n\n. The permit holder shall comply at all times with the provisions of the Act,\n\nFPPA, the Pyrotechnics Special Effects Manual published by Natural\nResources Canada or any successor publication, and the provisions of this\nBy-law;\nThe permit holder shall hold the display of Pyrotechnic Special Effects\nFireworks in conformance with the information provided to the Fire Chief\npursuant to Section 9(4) of this By-law;\n\n. The permit holder shall comply with any wind speed or direction limitations\n\nimposed on the permit (Canadian Forces base Trenton shall be the\nreferenced authority); and\n\nAny other condition deemed reasonable in the circumstances by the Fire\nChief.\n\n(3) No permit holder shall Discharge Pyrotechnic Special Effect Fireworks except\nin accordance with the conditions of the permit.\n\nPage 11 of 15\n"
    },
    {
      "page_number": 12,
      "text": "(4) The permit holder holding the display of Pyrotechnic Special Effect Fireworks\nshall ensure that all unused Pyrotechnic Special Effect Fireworks and all debris\nare removed forthwith from the site and safety disposed of.\n\nPart Xl\n\nInsurance\n\n11. (1) The applicant for a permit under Parts VI | and IX of this By-law shall provide\nand maintain Commercial General Liability insurance subject to limits of not less\nthan Five Million Dollars ($5,000,000.00) inclusive per occurrence for bodily\ninjury, death and damage to property including loss of use thereof. Such\ninsurance shall be in the name of the applicant and shall name The Corporation\nof the City of Belleville as an additional insured thereunder. Such insurance shall\ninclude permission to conduct displays of Display Fireworks or Pyrotechnic\nSpecial Effects Fireworks. Such insurance policy shall contain an endorsement to\nprovide the City of Belleville with (30) days prior written notice of cancellation or\nof a material change that would diminish coverage, and a Certificate of Insurance\nevidencing such insurance coverage shall be provided to the City of Belleville\nprior to the issuance of a permit.\n\nPart XIl\n\nIndemnification\n\n12. (1) The applicant for a permit under Parts VII and IX of this By-law shall provide a\nsigned indemnity which indemnifies and saves harmless The Corporation of the\nCity of Belleville from any and all claims, demands, causes of action, loss costs\nor damages that the City may suffer, incur or be liable for resulting from the\nperformance of the applicant as set out in the by-law whether with or without\nnegligence on the part of the applicant, the applicant's employees, directors,\ncontractors and agents.\n\nPart XIll\n\nProduction of Permit\n13. (1) Every holder of a Consumer Fireworks Sales Permit, Display Fireworks\n\nPermit or Pyrotechnic Special Effect Fireworks Permit shall produce their permit\nupon being so directed by the Fire Chief.\n\nPart XIV\n\nOffences and Penalties\n\n14. (1) Every person who contravenes any of the provisions of this By-law is guilty of\nan offence and upon conviction is liable to a fine as provided for in the Provincial\nOffenses Act, R.S.O. 1990, Chapter P.33, as amended from time to time.\n\nPage 12 of 15\n"
    },
    {
      "page_number": 13,
      "text": "Part XV\n\nEnforcement and Administration\n\n15.\n\n(1) This By-law may be enforced by every Enforcement Officer.\n\n(2) No person shall obstruct, hinder or interfere with an Enforcement Officer in\ntheir enforcement of this By-law.\n\n(3) An Enforcement Officer may, at any reasonable time and without prior notice,\ninspect any land, property, places, premises, buildings or structures where\nFireworks are stored or offered for sale.\n\n(4) An Enforcement Officer may, at any reasonable time and without prior notice,\ninspect any land, property, places, premises, buildings or structures for which an\napplication for a permit under this By-law has been received for the purposes of\n\nconducting the site inspections required pursuant to Sections 4(2), 7(2), and 9(2)\nof this By-law.\n\n(5) An Enforcement Officer may, at any reasonable time and without prior notice,\ninspect any land, property, places, premises, buildings or structures for which a\npermit under this By-law has been issued for the purpose of ensuring compliance\nwith the permit.\n\n(6) An Enforcement Officer may, at any reasonable time and without prior notice,\ninspect any land, property, places, premises, buildings or structures for the\npurpose of carrying out an inspection to determine if any section of this By-law is\ncomplied with.\n\n(7) Notwithstanding the provisions of Section 15(3) to 15(6) of this By-law, an\nEnforcement Officer shall not enter or remain in any room or place actually used\nas a dwelling unless the provisions of Section 437 of the Municipal Act, 2001 are\ncomplied with.\n\n(8) From time to time the Fire Chief may approve any and all forms as may be\ncontemplated under this By-law, including forms of permit and applications for\npermit.\n\nPart XVI\n\nReinstatement\n\n16.\n\n(1) Where any person is in contravention of any provision of this By-law, the City,\nin addition to any other action, may give or send notice to the person requiring\nthe property be made to conform with this By-law. In the event that a notice is\ngiven or sent and the property is not reinstated to conform with the provisions of\nthis By-law within the time period stated in the notice, the City, its employees,\nagent or contractor may enter upon the land and remove such things or carry out\nthe work required to make the property comply with this By-law, and may charge\nany costs incurred for such work to the person.\n\nPage 13 of 15\n"
    },
    {
      "page_number": 14,
      "text": "(2) Where the person refuses to pay the costs incurred by the City in Subsection\n16(1), the City may recover the costs in accordance with Section 446 of the\nMunicipal Act, S.O. 2001, c. 25.\n\n(3) Any notice given under this Section may be given in person or by registered\nmail and in the case of notice by registered mail, is deemed to be delivered on\nthe 3rd day after which it was sent.\n\nPart XVII\n\nMiscellaneous\n\n17.\n\n18.\nBy-law read and passed this 25‘ day of August 2025.\n\n(1) By-law Number 2022-129, A By-law to Regulate the Sale and Setting Off of\nFireworks and Pyrotechnic Special Effects within the City of Belleville is hereby\nrepealed.\n\n(2) If there is a conflict between a provision of this By-law and a provision of any\nother By-law of the City of Belleville, the provision that establishes the higher\nstandard to protect the health and safety of the public shall apply.\n\n(3) If any provision or part of a provision of this By-law is declared by any court or\ntribunal of competent jurisdiction to be illegal or inoperative, in whole or in part, the\n\nbalance of the By-law shall not be affected and shall continue in full force and\neffect.\n\n(4) This by-law may be referred to as the \"Fireworks By-law\".\n\nThis by-law shall come into force and take effect on the final passing thereof.\n\nIrwin, Clerk\n\nPage 14 of 15\n"
    },
    {
      "page_number": 15,
      "text": "Schedule 1\nlaw Number 2025\nThe Corporation of the City of Belleville\n\n142 for\n\nto By\n\nBay of Quinte\n\nA\nKI\n‘\n\nibe y Yee\n\nBE\non\n\nPage 15 of 15\n"
    }
  ]
}