{
  "file_name": "BL 2017-196 A Bylaw to Regulate Signs and Other Advertising Devices.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\n\nBY-LAW NUMBER 2017-196\n\nA BY-LAW TO AMEND BY-LAW NUMBER 2006-55 BEING A BY-LAW TO\nREGULATE SIGNS AND OTHER ADVERTISING DEVICES IN THE CITY OF\nBELLEVILLE\n\nWHEREAS Section 11 of the Municipal Act, 2001, S.O. 2001, Chapter 25 as amended,\nauthorizes a Municipality to pass by-laws respecting signs;\n\nAND WHEREAS the Council of the City of Belleville deems it advisable to amend By-\nlaw Number 2006-55, the Sign By-law;\n\nNOW THEREFORE THE COUNCIL OF THE CORPORATION OF THE CITY OF\nBELLEVILLE ENACTS AS FOLLOWS:\n\n1.\n\nTHAT Section 4.2(1)(c) of By-law Number 2006-55 is hereby amended by the\nremoval of the word “and” at the end of clause (iv);\n\nTHAT Section 4.2(1)(c) of By-law Number 2006-55 is hereby amended by the\ndeletion of clauses (v) and (vi);\n\nThat Section 4.2(1)(c) of By-law Number 2006-55 is hereby amended by the\naddition of the following clauses immediately following clause (iv):\n\n(v)\n(vi)\n(vii)\n(viii)\n\n(ix)\n(x)\n\n(xi)\n\nSigns must be a minimum of 195 feet (60m) from the middle of any\nintersection;\n\nSigns shall not be permitted in any centre median;\n\nSigns shall not be permitted between the sidewalk and the curb;\n\nSigns shall be setback a minimum of 15 feet (4.57m) from the edge of a\ndriveway and any curb line or edge of the travelled portion of a street;\nSigns shall be setback a minimum of 1 foot (0.3m) from a sidewalk;\n\nSigns advertising the same candidate shall be a minimum of 33 feet (10m)\napart; and\n\nwhere located on a street that is not under the jurisdiction of the\nCorporation of the City of Belleville, that authorization has been obtained\nfrom the necessary authorities.\n\n12\n"
    },
    {
      "page_number": 2,
      "text": "By-law Number 2017-196 Page 2\n\nTHIS BY-LAW SHALL COME INTO FORCE AND TAKE EFFECT IMMEDIATELY ON\nAND AFTER THE PASSING THEREOF.\n\nRead a first time this 14\" day of November 2017.\nRead a second time this 14\" day of November 2017.\n\nRead a third time and finally passed this 14° day of November 2017.\n\nCITY CLERK\n\n"
    }
  ]
}