{
  "file_name": "BL 2006-65 A Bylaw to Prescribe Fences and Gates for Privately Owned Swimming Pools.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\nBY-LAW NUMBER 2006-65\n\nA BY-LAW TO PRESCRIBE THE HEIGHT AND DESCRIPTION OF, AND THE MANNER\nOF ERECTING AND MAINTAINING FENCES AND GATES SURROUNDING PRIVATELY\nOWNED OUTDOOR SWIMMING POOLS, WITHIN THE CITY OF BELLEVILLE\n\nWHEREAS Section 11 of the Municipal Act, 2001, S.O. 2001, c. 25 (hereinafter the\n\"Municipal Act\") authorizes a municipality to pass by-laws respecting fences;\n\nAND WHEREAS Subsection 9(3) of the Municipal Act authorizes a municipality to regulate\nor prohibit matters pertaining to fences and as part of that power, to provide for a system of\napprovals and to impose conditions as requirements of obtaining, continuing to hold or\nrenewing the approval;\n\nAND WHEREAS Section 130 of the Municipal Act authorizes a municipality to regulate\nmatters related to the health, safety and well being of the inhabitants of the municipality;\n\nAND WHEREAS Section 427 of the Municipal Act authorizes a municipality to direct a\nmatter or thing to be done under a by-law to be done at the person's expense should the\nperson fails to do so, and to recover the costs of doing the thing or matter by action or by\nadding the costs to the tax roll and collecting them in the same manner as taxes;\n\nNOW THEREFORE the Council of The Corporation of the City of Belleville enacts as\nfollows:\n\n1. DEFINITIONS\n1.1 In this By-law:\n\n\"By-law Enforcement Officer\" means the Chief Building Official or an officer of the\nBuilding Division of the City;\n\n\"City\" means the City of Belleville;\n\n“Chief Building Official” means the Chief Building Official for the City as appointed by\nCity Council under the authority of the Building Code Act, S.O. 1992, c.23 as amended, or\nhis or her designate;\n\n\"closed construction\" means being constructed with vertical boards, bars, pipes, rails or\nany other materials, which have a separation distance of 38mm (11/2 in.) or less in\nbetween each piece of the materials, or in the case of a chain-link fence, chain link meshes\nof 38mm (1 1/2 in.) or less;\n"
    },
    {
      "page_number": 2,
      "text": "BY-LAW NUMBER 2006-65 Pg. 2\n\n“effective ground level\" means the highest level of the ground within 1.22 m (4 ft. 0 in.)\nhorizontal distance in any direction from the swimming pool enclosure;\n\n\"expenses\" means any and all sums of money actually spent or required to be spent by\nthe City, and shall include but not be limited to all charges, costs, administrative fees, GST,\noutlays, legal fees and losses;\n\n“hot tub\" means a body of water located outdoors contained by artificial means, with\nmechanisms allowing for the direction and/or adjustment of jets of warm water flowing in a\nrapidly rotating and circular current, and which produces a depression or cavity in the\ncentre, and \"hot tub\" shall include tubs which are commonly called \"spas\" or \"whirlpools\";\n\n“maintain” means to preserve the condition of the swimming pool enclosure from failure or\ndecline in order to ensure safety and strength;\n\n\"Manager\" means the Chief Building Official, and includes his or her designate;\n\n“open construction\" means being constructed with vertical boards, bars, pipes, rails or\nother materials which have a separation distance of greater than 38 mm (1 1/2 in.) but not\nexceeding 100 mm (4 in.) between any piece of the materials;\n\n\"owner\" means the individual, firm or corporation that is the registered owner of a property,\nand includes a lessee, tenant, mortgagee in possession, and the person or persons in\ncharge of the land;\n\n“permit” means a permit issued by the Chief Building Official of the City of Belleville under\nthis by-law certifying approval to construct a swimming pool enclosure;\n\n“person” has the same meaning as in the Interpretation Act and includes a corporation;\n\n“replace” or “replaced” shall mean the construction of a new swimming pool enclosure\nwhich takes the place of a previously constructed swimming pool enclosure;\n\n“self-closing device” shall mean a mechanical device or spring which returns a swimming\npool enclosure gate to its closed position within 30 seconds after it has been opened;\n\n“self-latching device” shall mean a mechanical device or latch which is engaged each\ntime the swimming pool fence gate is secured to its closed position; which will not allow the\nswimming pool fence gate to be re-opened by pushing or pulling, and which will ensure the\nswimming pool fence gate remains closed until unlatched by either lifting or turning the\ndevice itself or by a key;\n\n“solid construction\" means being constructed with horizontal boards, bars, pipes, rails or\nother materials in which no horizontal or vertical separation spaces are created;\n"
    },
    {
      "page_number": 3,
      "text": "BY-LAW NUMBER 2006-65 Pg. 3\n\n“swimming pool\" means any body of water located outdoors contained wholly or partly by\nartificial means and which can hold water exceeding 61cm (24 in.) in depth at any point, but\ndoes not include hot tubs which are provided with a rigid lockable lid and any swimming\npool owned by a public or governmental body, agency or authority;\n\n“swimming pool area\" means the swimming pool and any surrounding platforms,\nwalkways, play areas and landscaped areas which lie within the swimming pool enclosure;\nand\n\n“swimming pool enclosure\" means a fence or wall or combination thereof, including any\ndoors or gates surrounding a privately-owned outdoor swimming pool and restricting\naccess thereto.\n\n2. ADMINISTRATION\n\n2.1. The Building Division of the City shall be responsible for the administration\nand enforcement of this By-law\n\n3. APPLICATION OF BY-LAW\n3.1. This By-law does not apply to:\n\n1) swimming pools located completely inside a building; or\n\n2) existing swimming pool enclosures previously approved by the City prior\nto the date of final passing of this by-law, except as provided for in clause\n4.2(5).\n\n4. GENERAL PROVISIONS\n4.1. The requirements of this by-law with respect to swimming pool enclosures\napply equally to all swimming pools regardless of their designation as in\nground, above ground or on ground.\n4.2 No person shall:\n\n1) locate, construct, erect, replace, or install or cause to be located,\nconstructed, erected, replaced, or installed a swimming pool or swimming\npool enclosure unless a permit has been issued by the City pursuant to\nthis by-law; and\n\n2) erect or maintain or cause to be erected or maintained a swimming pool\n\nenclosure around the entire swimming pool except in accordance with the\nprovisions of this By-law; and\n"
    },
    {
      "page_number": 4,
      "text": "BY-LAW NUMBER 2006-65 Pg. 4\n\n4.3\n\n44\n\n3)\n\n5)\n\nplace, cause or permit water to be placed or to remain in a swimming pool\nunless a swimming pool enclosure has been erected in accordance with\nthe requirements of this by-law and a Final inspection of the swimming\npool enclosure has been performed and been passed by the City and\nunless the person maintains the swimming pool enclosure in a good state\nof repair in accordance with the standards of this by-law; and\n\nuse the swimming pool unless a swimming pool enclosure has been\nerected in accordance with the requirements of this by-law and a Final\ninspection of the swimming pool enclosure has been performed and been\npassed by the City and unless the person maintains the swimming pool\nenclosure in a good state of repair in accordance with the standards of\nthis by-law; and\n\nallow, cause or permit a swimming pool enclosure to deteriorate such that\nit no longer complies with the requirements of this by-law.\n\nApplication to Chief Building Official in writing\n\n1)\n\nAn application for a permit with the required fees (as detailed in clause\n4.5) to erect a new swimming pool enclosure or for the replacement or\nalteration of an existing swimming pool enclosure shall be made by the\nowner or his or her agent, in writing to the Chief Building Official on such\nforms as may be prescribed by the City.\n\nDocumentation to accompany application\n\n1)\n\nAll such applications shall be accompanied by the following:\n\na) A site plan showing the location of the swimming pool, deck (if\napplicable), pump, filter and proposed swimming pool enclosure in\nrelation to all existing property lines, and man made structures located\non the property, (i.e. Decks, sheds, buildings etc.). This plan shall\nalso show any natural or man-made features, which are located closer\nthan 1.22m (4’-0”) from the exterior of the swimming pool enclosure\nwhich could facilitate the climbing of the swimming pool enclosure.\n\nlox\na=\n\nThe site plan above shall also include the location and size of all\ngates, which provide access through the swimming pool enclosure\ninto the swimming pool area.\n\nc) Swimming pool enclosure details including exterior elevations of the\nswimming pool enclosure which details:\n\ni) the type of fencing to be installed (ie. Chain Link, Pressure\n"
    },
    {
      "page_number": 5,
      "text": "BY-LAW NUMBER 2006-65 Pg. 5\n\nTreated Wood etc.),\n\nii) the type and size of all members, which comprise the\nswimming pool enclosure,\n\niii) dimensions showing the height of the swimming pool\nenclosure, as well as spacing of all horizontal and vertical\nmembers, and\n\niv) details and dimensions showing how the swimming pool\nenclosure is to be anchored to the ground.\n\nd) Gate details are to be provided for every gate, which forms part of\nthe swimming pool enclosure showing:\n\ni) all of the information noted in (c) above, and\nii) the type and location of self closing device, and location and\ntype of self latching device.\n\n4.5 Fees and Deposit\n\n1) The fee required to accompany an application for a swimming pool\nenclosure permit shall be $10.00 / $1,000.00 of construction value of the\nenclosure with a minimum fee of $50.00 plus a $250.00 refundable\ndeposit;\n\n2) Once the required inspections have been conducted and it has been\ndetermined that the swimming pool enclosure complies with the\nrequirements of the swimming pool enclosure by-law, the deposit noted in\nclause 4.5 (1) above shall be refunded to the person who initially paid it.”\n\n2015-47\n\n4.6 Permit Revocation\n\n1) The Chief Building Official may revoke a permit where it was issued on\nmistaken or false information and shall provide written notice to the permit\nholder of the revocation.\n\n4.7 For the purpose of this By-law:\n\n1) The distance between horizontal boards, bars, pipes, rails or other\nmaterials used for a swimming pool enclosure shall be measured from the\ntop of the upper horizontal piece of material, to the top of the next lower\nhorizontal piece of material used to construct the swimming pool\nenclosure.\n\n2) The distance between vertical boards, bars, pipes, rails, or other\nmaterials are measured from the inside of the boards, bars, pipes, rails,\nor other materials.\n"
    },
    {
      "page_number": 6,
      "text": "BY-LAW NUMBER 2006-65 Pg. 6\n\n5\n\n2011-96\n\n2007-104\n\n2007-104\n\n3) The short form measurements used in this by-law shall have the following\n\nmeaning:\n\na) \"cm\" means centimeter;\nb) Pa \"means feet;\n\nc) 123, means gauge;\n\nd) \"in.\" means inch;\n\ne) \"es means pound;\n\nf) \"m\" means meter; and\ng)\" mm\" means millimeter.\n\nGeneral Specifications\n\n5.1\n\n5.2\n\nNo swimming pool enclosure shall:\n\n1)\n\n2 2\n\neo)\n\nHave any horizontal or diagonal support or brace unless the support or\nbrace is on the inside of the enclosure and the enclosure is of closed\nconstruction, or the horizontal rails are separated by a minimum clear\nvertical distance of 1.22m (48”); or\n\nbe constructed of horizontal boards, bars, pipes, rails or other materials\nunless the enclosure is of solid construction, such that it does not\nfacilitate climbing from the outside; or\n\nhave a separation distance between vertical boards, bars, pipes, tubes,\nrails or other materials exceeding 100mm (4 in.), or in the case of a chain\nlink fence, have a chain link mesh exceeding 38mm (1 1/2 in.); or\n\nhave a ground clearance space or gap greater than 100mm (4 in.) at any\npoint under the enclosure between the bottom rail, board, pipe, or other\nsupport and the effective ground level; or\n\nbe located closer than 1.0 m (3.28ft.) to the waters edge; or\n\nbe less than 1.52 m (5 ft.) in height; or\n\nbe located closer than 1.2 m (4 ft.) to any condition that facilitates the\n\nclimbing of the enclosure, unless alternative measures are implemented\nto provide an equivalent level of safety as set out in this by-law.\n\nHot tubs exempt\n\n1)\n\nExcept as provided in 5.2(2), a hot tub is exempt from the requirements of\nthis by-law;\n"
    },
    {
      "page_number": 7,
      "text": "BY-LAW NUMBER 2006-65 Pg. 7\n\n2) The owner of every hot tub shall keep a secure cover of rigid material\nlocked in place over the opening at all times when the hot tub is not\noccupied, and no person shall leave a hot tub without first locking the\ncover in place to prevent access when the hot tub is not occupied.\n\n5.3. Swimming Pool Enclosures of Wooden Construction\n\n1) In addition to the requirements of this Part, every swimming pool\nenclosure of wooden construction shall:\n\na) be supported by vertical wooden posts with a minimum size of 100\nmm x 100 mm (4 in. x 4 in.) nominal, spaced not more than 2.44m (8\nft.) apart, securely anchored into the ground.\n\nb) be constructed with vertical boards with a minimum nominal\ndimension of 25mm x 100mm (1x4”)\n\nc) be constructed with a horizontal top rail and a horizontal bottom rail\nwith a minimum nominal dimension of 50mm x 100mm (2” x 4”)\n\n5.4 Swimming Pool Enclosures of Chain Link Construction\n\n1) In addition to the requirements of this Part, every swimming pool\nenclosure of chain link construction shall:\n\na) have amesh consisting of 12 ga. galvanized steel wires, or of 14 ga.\nsteel wires covered with vinyl or other types of plastic approved by the\nManager, yielding a total thickness equivalent to a 12 ga. galvanized\nsteel wire; and\n\nlox\na\n\nbe supported by galvanized or vinyl coated steel vertical posts with a\nminimum diameter measurement of 38 mm (1 1/2 in.) spaced not\nmore than 3.043m (10 ft.) apart, installed as per manufacturers\ninstructions; and\n\nc) have top and bottom horizontal rails or pipes firmly fastened to the\nvertical posts made of galvanized steel pipe with a minimum diameter\nof 32 mm (1.25 in.). A galvanized steel 9-gauge bottom wire may be\nsubstituted for the bottom rail or pipe.\n\n5.5 | Swimming Pool Enclosures of Other Materials:\n1) Where a swimming pool enclosure is made of materials or construction\n\nother than prescribed by this by-law, it may be approved by the Chief\nBuilding Official by the issuance of a permit for the enclosure if s/he\n"
    },
    {
      "page_number": 8,
      "text": "BY-LAW NUMBER 2006-65 Pg. 8\n\n5.6\n\n5.7\n\ndetermines that the enclosure would yield an equivalent or greater degree\nof safety as provided in the requirements under this By-law.\n\nProhibited Materials\n\n1) No part of a swimming pool enclosure shall contain barbed wire, electrical\nwiring, sharp projections, or any other objects or materials that would\ncreate a danger to the safety of any persons or animals.\n\nAdditional Requirements for Gates, Doors, and Entrances\n\n1) Where a gate forms part of a swimming pool enclosure, it shall be:\na) Supported on substantial metal hardware hinges; and\nb) self-closing by means of a self-closing device; and\nc) self-latching by means of a self-latching device at the top of and on\n\nthe inside of the gate; and\n\nd) aminimum of 1.52m (5 ft) in height; and\n\ne) kept locked at all times, when there is not a responsible person\npresent supervising the pool.\n\n2) Double swimming pool enclosure gate\n\na) No person shall construct or maintain a double swimming pool fence\ngate access without one of the two gates having a self-closing device\nand a self latching device. The gate of this double gate access\nwithout a self closing device and self latching device must have a\ndevice permanently affixed to the ground or other non movable object,\nthat prevents access through this gate without lifting or removing this\ndevice and then releasing the latch.\n\n3) Where a door forms part of the swimming pool enclosure but does not\nlead directly from a private dwelling unit, it shall be:\n\na\n\nYS\n\nof such height and of such construction as will provide a degree of\nsafety and rigidity equivalent to or greater than that of a required\nfence;\n\nlox\na=\n\nsupported on substantial metal hardware hinges\n\nc) equipped with a bolt, chain, latch, or a similar device, located at a\nminimum height of 1.52m (5 ft.) from the bottom of the door; and\n"
    },
    {
      "page_number": 9,
      "text": "BY-LAW NUMBER 2006-65 Pg. 9\n\nd) be kept locked at any time when the swimming pool contains 61 cm\n(24 in.) or more water in depth.\n4) The wall of a building may form part of a swimming pool enclosure, unless\nthe following would be located within the enclosure:\na) amain building entrance; or\n\nb) aservice entrance to a multiple occupancy building containing more\nthan four (4) dwelling units.\n\n5.8 Construction Fence\n1) Aconstruction fence shall:\na) be 1.22 metres (4 feet) in height.\nb) consist of vertical wood lath with openings not greater than 38\nmillimetres (1.5 inches), or of plastic mesh with a mesh not greater\nthan 38 millimetres (1.5 inches).\n\nc) have steel T-bar posts at intervals of not more than 3 metres (10 feet).\n\nd) have a 9 gauge galvanized steel or vinyl coated wire at both the top\nand the bottom.\n\n2\n\nbe permitted only during the construction of a swimming pool and shall\nbe replaced with a permanent swimming pool enclosure that complies\nwith the requirements of this by-law prior to filling the swimming pool\nwith water.\n\n6 ENFORCEMENT\n\n6.1. A By-law Enforcement Officer may cause a written Order to Comply to be\ndelivered to any person in contravention of this by-law, specifying the nature\nof the by-law contravention, and directing the person to correct the by-law\ncontravention within a specified time; and\n\n6.2 A By-law Enforcement Officer may order any person in contravention of this\nby-law to drain the swimming pool until such time as an inspection by a By-\nLaw Enforcement Officer has verified that the by-law contravention outlined\nin the Order to Comply, has been corrected.\n\n6.3 _ If any person fails to comply with an Order under clauses 6.1 or 6.2, within\nthe time prescribed therein, in addition to any other remedies available to it,\n"
    },
    {
      "page_number": 10,
      "text": "BY-LAW NUMBER 2006-65 Pg.\n\n10\n\n6.4\n\n6.5\n\n6.6\n\nthe City may do any or all of the following, on behalf of the person:\n\n1) remove, replace, and/or repair parts of or the entire swimming pool\nenclosure; or\n\n2) drain the swimming pool of water.\n\nAny materials or structures removed by the City under clause 6.3 may be\ndeposited on the owner's property or stored at the City for thirty (30) days at\nthe owner's expense. Any item stored by the City and not retrieved by the\nowner within thirty (30) days may be disposed of by the City in any manner\nas it deems appropriate.\n\nThe City may recover the costs from the owner for the work done by the City\non behalf of the owner under clauses 6.3 and 6.4 by action, or by adding the\ncosts to the tax roll and collecting them in the same manner as taxes.\n\nA By-Law Enforcement Officer may enter upon land at any reasonable time\nfor the purpose of administering or enforcing this by-law.\n\nSERVICE OF DOCUMENTS\n\n7.1. Service of a Notice or Order under this by-law is sufficiently given if delivered\npersonally or sent by registered mail to the owner or owner's agent at the\naddress provided on the permit application submitted under this by-law.\n\n7.2 Service by registered mail shall be deemed to be made on the fifth day after\nmailing.\n\nPENALTY\n\n8.1 Every person who contravenes any provision of this By-law is guilty of an\n\noffence and on conviction is liable to a fine as provided for under the\nProvincial Offences Act, R.S.O. 1990, c. P.33, as amended.\n\nVALIDITY & INTERPRETATION\n\n9.1\n\n9.2\n\nIf a court of competent jurisdiction declares any provisions or part of a\nprovision of this Bylaw to be invalid or to be of no force and effect, it is the\nintention of Council in enacting this By-law that the remainder of this By-law\nshall continue in force and be applied and enforced in accordance with its\nterms to the fullest extent possible according to law.\n\nAll words importing the singular number shall include the plural, and words\n"
    },
    {
      "page_number": 11,
      "text": "BY-LAW NUMBER 2006-65 Pg.\n11\n\nimparting the masculine gender shall include the feminine, and the converse\nof the foregoing also applies, unless the context of the By-law otherwise\nrequires.\n\n10. REPEAL\n\n10.1. THAT By-law Numbers 10692 and 9793 (former City of Belleville swimming\npool fence by-laws) and By-law Number 3400 (former Township of Thurlow\nswimming pool fence by-law) and all amendments thereto are hereby\n\nrescinded and all by-laws or parts of by-laws inconsistent with the provisions\nof this by-law are hereby rescinded.\n\nTHIS BY-LAW SHALL COME INTO FORCE AND TAKE EFFECT IMMEDIATELY ON\nAND AFTER THE PASSING THEREOF.\nRead a first time this 10th day of April 2006.\n\nRead a second time this 10th day of April 2006.\n\nRead a third time and finally passed this 10th day of April 2006.\n\nMARY-ANN SILLS MAYOR\n\nJULIE ORAM CITY CLERK\n"
    }
  ]
}