{
  "file_name": "BL 2012-200 A Bylaw for Prohibiting and Regulating the Being at Large or Trespassing of Cats and Other Animals (Other than Dogs).pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\n\nBY-LAW NUMBER 2012-200\n\nA BY-LAW FOR THE PROHIBITING AND REGULATING THE BEING AT LARGE OR\nTRESPASSING OF CATS AND OTHER ANIMALS (OTHER THAN DOGS)\n\nWHEREAS Section 10 of the Municipal Act, 2001, S.O. 2001, c. 25, as amended,\nprovides that a municipality may pass by-laws respecting animals;\n\nAND WHEREAS Section 103 of the Municipal Act, 2001, S.O. 2001, c. 25, as\namended, provides for the seizure and impounding of animals being at large or\ntrespassing and the sale of impounded animals;\n\nAND WHEREAS Section 391 of the Municipal Act, 2001, S.O. 2001, c. 25, as\namended, authorizes a municipality to impose fees or charges for services or activities\nprovided by or done on behalf of it;\n\nAND WHEREAS it has been deemed expedient to enact such a By-Law for The\nCorporation of the City of Belleville;\n\nNOW, THEREFORE, THE COUNCIL OF THE CORPORATION OF THE CITY OF\nBELLEVILLE ENACTS AS FOLLOWS:\n\n1. In this By-Law:\n\n(a) \"By-Law Enforcement Officer\" means a person employed by The\nCorporation of the City of Belleville to enforce By-Laws and shall\ninclude a Police Officer.\n\n(b) \"cat\" means cat or cats whether or not male or female, spayed or\nneutered\n\n(c) “control” means being kept on a leash or otherwise physically\nrestrained by its owner or another person acting on the owner's\nbehalf.\n\n(d) “dwelling unit\" means any property that is used or designed for use\nas a domestic establishment in which one or more persons may sleep\nand prepare and serve meals. Dwelling unit shall, for the purpose of\nthis By-Law, include all accessory buildings associated therewith.\n"
    },
    {
      "page_number": 2,
      "text": "By-law Number 2012-200 Page 2\n\n(e) “other animal\" means any animal (other than dogs) owned by any\nperson whether wild or domesticated\n\n(f) \"owner\" of a cat or other animal includes any person who possesses\nor harbours a cat or other animal and \"owner\" and \"owned\" have a\ncorresponding meaning.\n\n(g) “pound” means premises that are used for the detention,\nmaintenance or disposal of dogs, cats or other animals that have\nbeen impounded pursuant to a by-law of a municipality or the Dog\nOwners’ Liability Act.\n\n(h) “redemption period” means three days, excluding the day on which\nthe cat or other animal was impounded, and holidays shall not be\nincluded in calculating the redemption period.\n\n2. Every owner of a cat or other animal shall prevent such cat or other animal\nfrom being at large within the municipal limits of the City of Belleville.\n\n3. For the purpose of this By-Law, a cat or other animal shall be deemed to\nbe at large if it is found in any place other than the premises of the owner of the\ncat or other animal and not under control.\n\n4. Any cat or other animal, when on the land of The Corporation of the City of\nBelleville or any local board thereof, shall be under control.\n\n5. Every cat or other animal found to be at large within the municipal limits of\nthe City of Belleville may be seized and impounded by any By-Law Enforcement\nOfficer.\n\n6. The owner of a cat or other animal may reclaim the cat or other animal\n\nwithin the redemption period by paying to the pound the cost of its maintenance\nwhile impounded and the fee of twenty-five ($25.00) dollars.\n\n7. Every cat or other animal not reclaimed within the redemption period may\nbe sold or disposed of.\n\n8. A cat or other animal shall be deemed to have been impounded when it\nhas been delivered into the custody of the operator of a pound.\n\n9. (a) The number of cats in any dwelling unit in the City of Belleville shall\nbe restricted to ten (10).\n\n(b) All cats must be immunized and proof of immunization must be\navailable upon request by a Bylaw Enforcement Officer.\n"
    },
    {
      "page_number": 3,
      "text": "By-law Number 2012-200 Page 3\n\n10.\n\n11.\n\n12.\n\n(c) Subsections 9(a) and (b) shall only apply to cats aged six (6)\nmonths or older.\n\n(a) Every owner of a cat or other animal who contravenes any of the\nprovisions of this By-Law shall be guilty of an offence and upon conviction\nis liable to a penalty as provided for under the Provincial Offences Act.\n\n(b) | Upon a conviction being entered, the Court in which the conviction\nwas entered and any Court of competent jurisdiction thereafter may, in\naddition to any other remedy and to any penalty imposed in this By-Law,\nmake an Order prohibiting the continuation or repetition of the offence by\nthe person convicted.\n\nIf any section, clause or provision of this By-law is for any reason declared\n\nby a court of competent jurisdiction to be invalid, the same shall not affect the\nvalidity of this By-law as a whole or any part thereof other than the section,\nclause or provision so declared to be invalid and it is hereby declared to be the\nintention of Council for the City that all remaining sections, clauses or provisions\nof this By-law shall remain in full force and effect until repealed, notwithstanding\nthat one or more provisions thereof may have been declared invalid.\n\nTHAT By-Law Number 14212 be and the same is hereby repealed.\n\nTHIS BY-LAW SHALL COME INTO FORCE AND TAKE EFFECT IMMEDIATELY ON\nAND AFTER THE PASSING THEREOF.\n\nRead a first time this 26\" day of November 2012.\nRead a second time this 26™ day of November 2012.\n\nRead a third time and finally passed this 26\" day of November 2012.\n\nihe\n\nNEI IS MAYOR\n\nITY CLERK\n"
    }
  ]
}