{
  "file_name": "BL 2019-81 A Bylaw to Establish Rates and Procedures for Water and Wastewater.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "The Corporation of the City of Belleville\nBY-LAW Number 2019-81\n\nA bylaw to establish rates and procedures for water and wastewater\n\nWHEREAS the Municipal Act 2001, S.O. 2001, Chapter 25, s. 391(1) requires Council to\npass a by-law to fix rates for services or activities provided;\n\nAND WHEREAS the Municipal Act 2001, S.O. 2001, Chapter 25, s. 81 (1) ands, 81 (2)\nauthorize a public utility to shut off the supply of water if fees and charges payable for\nwater or wastewater services are overdue;\n\nAND WHEREAS the Municipal Act 2001, S.O. 2001, Chapter 25, s. 398 (2), authorizes\nthe collection of water and wastewater rates in the same manner as municipal taxes;\n\nAND WHEREAS the Municipal Act 200, S.O. 2001, Chapter 25, s. 83 authorizes a\nmunicipality to collect reasonable security for the payment of fees and charges for the\nsupply of the public utility;\n\nNow, therefore, the council of the corporation of the city of belleville enacts as\nfollows:\n\nPART | - Definitions:\n\nIn this By-law\n1. BUILDING shall mean a structure supplied with water or wastewater services.\n2. CITY means The Corporation of the City of Belleville.\n\n3. CONSUMER shall mean the owner or occupant of property which is serviced by,\nconnected to, and who takes water from a Municipal water system and discharges\nwaste to a wastewater system.\n\n4. CORPORATION shall mean the Corporation of the City of Belleville.\n\n5. COUNCIL shall mean the Municipal Council of the Corporation of the City of\nBelleville.\n\n6. CUSTOMER means the owner, tenant or occupant of premises who has signed a\ncontract to receive water or wastewater services from the City of Belleville.\n\n7. GENERAL SERVICE shall mean the applicant for water and wastewater services,\nthe owner or occupant of and the person to whom invoices are sent for water and\nwastewater services supplied to any premises in which the water supplied is used\ndirectly or indirectly for or in the carrying on of any business, trade, institution or\ncommercial undertaking.\n\nBy-Law Number 2019-81 Page 1 of 14\n"
    },
    {
      "page_number": 2,
      "text": "10.\n11.\n\n12.\n\n13.\n\n14.\n\n15.\n\n16.\n\n17.\n\n18.\n19.\n\nMETER means the water meter supplied and owned by the Municipality to\nmeasure the quantity of water used and released to the wastewater system by the\nconsumer.\n\nMULTIPLE UNIT PROPERTY shall mean a single building, served by single water\nand wastewater service pipes and containing two or more units.\n\nMUNICIPALITY shall mean the Corporation of the City of Belleville.\n\nOCCUPANT shall include any lessee, tenant, owner, the agent of a lessee, tenant\nor owner, or any person in possession of premises.\n\nOWNER shall include any person or any firm or corporation that is the registered\nowner of the property under consideration of any agent thereof, a person entitled to\na limited estate in land, a trustee in whom land is vested, a committee of the estate\nof a mentally incompetent person, an executor, an administrator and a guardian.\n\nPREMISES shall mean the property being supplied or to be supplied with water or\nwastewater services and includes the portion of a multiple occupancy premises\nseparately supplied.\n\nPRODUCT METER measures the amount of water utilized in a commercial\noperation or production process, which is not discharged into the wastewater\nsystem.\n\nSANITARY SEWER means a sewer for the collection and transmission of sewage\nand to which storm, surface and ground waters are not intentionally admitted.\nSERVICE AREA means the area within and outside of the City of Belleville\nmunicipal boundaries to which water and wastewater services are provided by\nBelleville Water.\n\nSINGLE RESIDENTIAL DWELLING shall mean a single dwelling, which is\n\nfreestanding, separate and detached from other main buildings or main structures,\nincluding a split-level dwelling.\n\nWATER means potable water that is fit for human consumption.\n\nWASTEWATER means the composite of water and water-carried wastes from\nresidential, commercial, industrial or institutional premises or any other source.\n\nPart Il - Administration:\n\n1.\n\n2.\n\nThe City water utility shall be operated under “the Corporation of the City of\nBelleville”.\n\nThe office of the City of Belleville Water Customer Service department is located at\n183 Pinnacle St. Belleville, Ontario. The customer service, billing and collections,\n\nBy-Law Number 2019-81 Page 2 of 14\n"
    },
    {
      "page_number": 3,
      "text": "functions reside at this location. The water treatment department is located at the\nCity of Belleville Water Treatment Plant at 2 Sidney Street, Belleville, Ontario.\n\nThe administration of the water treatment, distribution, servicing and metering\nfunctions, shall be under the jurisdiction of the Environmental & Operational\nServices Department of the Corporation of the City of Belleville located at 31\nWallbridge Crescent, Belleville, Ontario.\n\nThe administration of the water accounting, invoicing and collecting functions of the\nWater Customer Service department shall be under the jurisdiction of the Finance\nDepartment of the Corporation of the City of Belleville.\n\nThe Water Customer Service department is responsible for billing and collecting\nwastewater revenue for the City of Belleville.\n\nPart Ill - Account Administration\n\n1.\n\nEach consumer or his duly authorized agent who desires to receive water and\nwastewater services shall sign an Application for Service.\n\nThe water meter is the property of the City of Belleville. In accordance with Section\n80 (1) of the Municipal Act, 2001, S.O. 2001, Chapter 25, the City of Belleville\nmaintains the right to enter on the customer’s premises to inspect, read, repair or\nreplace the water meter.\n\nThe City of Belleville Environmental Services staff may at reasonable times, enter\nonto the land to inspect, repair, alter or disconnect the service pipe or equipment in\naccordance with Section 80 (1) of the Municipal Act, 2001, S.O. 2001, Chapter 25.\n\nWater meters shall generally be read and accounts rendered monthly for General\nService accounts and bi-monthly for Residential accounts. The City of Belleville\nmay serve bills upon the customer, by delivery or mail, to an address supplied by\nthe customer.\n\nIf a City of Belleville Water Customer Service representative is unable to obtain a\nmeter reading, a Water Meter Reading Card will be left at the customer’s premises\nfor the customer to complete. Customers may also contact the Water Customer\nService department at 613 966-3657 to leave a message with their meter reading.\nIf the Water Customer Service department does not receive a meter reading before\nthe customer’s water bill is due to be processed, an estimated bill will be issued.\nAn estimated bill will be based, where possible, on previous consumption records\nat the customer’s location. The rules contained in this bylaw governing regular bills\nshall apply to estimated bills.\n\nBy-Law Number 2019-81 Page 3 of 14\n"
    },
    {
      "page_number": 4,
      "text": "6.\n\n10.\n\n11.\n\nWhere water is supplied to a multiple unit property and measured with a single\nmeter, the account for the water and wastewater services shall be charged to the\nowner of the property.\n\nWhere water is supplied to a multi unit property with a single service lateral, the\naccount for the water and wastewater shall be charged to the owner of the\nproperty. If a landlord can provide proof by way of inspection by a City of Belleville\nrepresentative that the water meters to the individual units are located in a separate\nsecured meter room not accessible by persons other than the property owner or\nCity of Belleville staff the account for water and waste water can be charged to the\ntenant. A key to the secured room must be provided to permit access to metering\nequipment for general maintenance or for disconnection of the service.\n\nFor unmetered services existing on the date this bylaw comes into effect, the\naccount for the water and wastewater services shall be charged to the owner of the\nproperty who shall pay the monthly flat rate charges as set out in Schedule “B” of\nthis bylaw.\n\nWhere water supply to a multiple-unit property is not metered, as per paragraph 8\nabove, all charges for water and wastewater services will be billed to the owner at\nthe applicable flat rate charge per month shown on Schedule “B’ of this bylaw\nmultiplied by the number of units in the property.\n\nFurther to section 8 above, where a unit in an unmetered multiple-unit property is\nvacant, the applicable water and wastewater monthly flat rate charges shown on\nSchedule “B” will still apply, as the water service is deemed available.\n\nPayments on account shall be made to the City of Belleville in accordance with\nSchedule “B” attached hereto and forming part of this bylaw:\n\na) Bills are payable by the due date specified on the bill which is normally 30 days\nfrom the date of mailing except for final bills which are due 15 days from the\ndate of mailing.\n\nb) The following payment options are available at the date this bylaw is passed:\ne Mail\ne In person at the office at 183 Pinnacle Street, Belleville\n\ne Night Deposit box located at City Hall, 169 Front Street, cheques only\nplease\n\ne Internet or telephone banking, all major financial institutions\n\ne Pre-Authorized Payment Plans\n\nBy-Law Number 2019-81 Page 4 of 14\n"
    },
    {
      "page_number": 5,
      "text": "12.\n\n13.\n\n14.\n\n15.\n\n16.\n\n17.\n\no Equal (Budget) Plan — Provides for eleven equal payments based on the\nestimated annual bill plus a reconciliation payment or credit based on\nactual water and wastewater charges and payments to date. This plan is\noffered to Residential customers only.\n\no Actual Payment Plan - The actual amount of the customer bill is paid on\nthe due date directly from the customer’s bank account. This plan is\navailable to both Residential and General Service customers.\n\nBoth plans require a signed customer authorization as well as a void cheque.\n\nA Late Payment Charge, as shown in Schedule “B” of this bylaw, shall be assessed\nto all accounts not paid in full within 30 calendar days of the date of mailing or\ndelivery of the customer's bill.\n\na) Additional charges may be assessed for costs associated with the continued non-\npayment of amounts due, including costs of additional notice and of disconnecting\nand reconnecting water services.\n\nb) All charges and amounts imposed by this by-law and owing by the property owner\nhave priority lien status and are a lien and charge upon the property, collectible\nin the same manner as taxes in accordance with Section 398 (2) of the Municipal\nAct 2001, S.O. 2001, Chapter 25.\n\nWhere it is necessary for City of Belleville staff to make a trip to the customer\npremises to personally collect account arrears, a Collection Charge, as shown in\nSchedule “B”, will be assessed to the account.\n\nWhen the occupancy of a premises changes, a Change of Occupancy charge as\nshown in Schedule “B” of this by-law will be levied to cover the cost of\nadministrative work. The charge will be included on the first bill issued to the new\ncustomer.\n\nWhen the owner requests a temporary removal of the water meter for construction\npurposes, their account will be charged based on the relevant labour and equipment\ncosts.\n\nThe monthly Fixed Charges for providing and maintaining water and wastewater\nservices to a property are payable in accordance with Schedule “B”. In instances\nwhere the property is vacant, the water meter temporarily removed or the service\notherwise disconnected, the monthly Fixed Charges shall continue to be rendered.\n\nFurther to section 16 above, where a rental unit is vacant, the owner will be\nresponsible for the payment of all Fixed Charges as well as any charges for water\nused and wastewater discharged at the premises in accordance with Schedule B.\n\nBy-Law Number 2019-81 Page 5 of 14\n"
    },
    {
      "page_number": 6,
      "text": "18. Where a water meter is damaged and must be replaced the charges shown in\n\nSchedule “B’ of this bylaw will apply.\n\n19. Where acustomer’s cheque is returned from a financial institution due to insufficient\n\nfunds, a returned cheque charge shown on Schedule “B” of this bylaw will apply.\n\nPart IV - Water Rates and Charges\n\n1.\n\nWater consumed at all metered premises in the City of Belleville service area shall\nbe charged for as indicated by the meter for each respective premises at rates,\nincluding the Monthly Fixed Charges, shown in Schedule “B” to this By-law.\n\nIf for any reason, a water meter is found not to be functioning properly;\nconsumption will be estimated based on the average reading for previous months.\nWhere the water meter is equipped with a remote register and a reading\ndiscrepancy occurs between the remote and the meter, the reading on the meter\nwill be utilized. Water accounts may be adjusted accordingly for a period not\nexceeding 2 years.\n\nWherever possible, except for water used for fire fighting purposes, or water\nauthorized by the City of Belleville for construction or other purposes, all water\nused on premises within the service area of the City of Belleville, shall pass through\na meter approved for use upon such premises. In addition to whatever other\nremedies the City may have by law in respect to infringement of this By-law, the\nCity may, upon ascertaining that water has been used which has not passed\nthrough the meter of such premises, forthwith, without notice, shut off and stop the\nsupply of water.\n\nPursuant to Section 83 of the Municipal Act, 2001, S.O. 2001, Chapter 25, where\nthe customer applying for water services from the City of Belleville is not the owner\nof the property, a Security Deposit as shown in Schedule A of this By-law will be\ncharged.\n\nWhere a bulk water carrier desires to purchase water from the City of Belleville bulk\nfilling station, an access key will be provided and a key deposit fee as shown in\nSchedule B of this By-law will be charged. If the carrier has account arrears in\nexcess of 90 days, the deposit will be applied to the balance and the access key\nwill be deactivated.\n\nIf a customer omits, neglects or refuses to pay any bill rendered, whether for water,\nservice pipes, meter, service charges or any other monies to which the City of\nBelleville may be entitled in respect of the water services to such premises, the City\nof Belleville may, after providing reasonable notice in accordance with Sections 81\n(3) of the Municipal Act, 2001, S.O. 2001, Chapter 25, shut off or reduce the flow of\nwater to the premises.\n\nBy-Law Number 2019-81 Page 6 of 14\n"
    },
    {
      "page_number": 7,
      "text": "7. Water used during the construction phase of a building, prior to occupancy, is not\nrequired to be metered. The City of Belleville will charge the owner of the property\na Water Building Charge as set out in Schedule “B” of this bylaw.\n\n8. Where water service to a property has been discontinued as a result of non-\npayment, a Reconnection Charge as shown in Schedule “B” of this By-law will be\nlevied against the delinquent account, in addition to the applicable Collection\nCharge.\n\n9. Where the owner of a property has requested a seasonal disconnection of the\nwater service, the account Disconnection/Reconnection charge as set out in\nSchedule “B” will apply.\n\nPart V - Wastewater Rates and Charges\n\n1. Wastewater usage for all metered premises in the City of Belleville service area\nshall be charged for as indicated by the water meter for each respective premises\nat rates, including the Monthly Fixed Charges, shown in Schedule “B” to this By-\nlaw. The usage charge shall apply for all premises supplied with a connection to\nthe wastewater system.\n\n2. General Service Customers, who utilize water in their operations that is not\ndischarged to the wastewater system, may apply to the Environmental &\nOperational Services department to have a product meter installed at their\npremises. The water measured by the product meter will be deducted from the\ntotal water consumption to determine periodic wastewater charges.\n\n3. Sanitary Waste Haulers will be charged in accordance with Schedule “B” for waste\ndelivered to the Sewage Treatment Plant.\n\nBy-Law Number 2019-81 Page 7 of 14\n"
    },
    {
      "page_number": 8,
      "text": "That by-law number 2009-209, a by-law to establish water rates and procedures for\nbelleville water, is hereby repealed.\n\nThis by-law shall come into force and take effect immediately on and after the passing\nthereof.\n\nRead a first time this 30\" day of April, 2019.\n\nRead a second time this 30\" day of April, 2019.\n\nRead a third time and finally passed this 30\" day of April, 2019.\n\nMITCH PANCIUK MAYOR\n\nMATT MACDONALD CITY CLERK\n\nBy-Law Number 2019-81 Page 8 of 14\n"
    },
    {
      "page_number": 9,
      "text": "Schedule “A” to By-Law No. 2019-81\n\nSecurity Deposits - Water\n\n1.\n\nSecurity Deposits shall be required from the following Customers:\n\na) All Residential tenant customers who have not established a good payment\nrecord over two consecutive years with the City of Belleville Water Customer\nService department\n\nb) All General Service tenant customers who have not established a good\npayment record over three consecutive years with the City of Belleville Water\nCustomer Service department.\n\nWith respect to this section, the following entities will be exempt:\ne Federal, Provincial and Municipal governments\ne Chartered Banks and Trust Companies\n\nc) All Residential, General Service and Bulk Water customers who have a poor\npayment record with the City of Belleville Water Customer Service department\nor from whom collection of future charges cannot be reasonably assured.\n\nd) Security Deposits shall be in the form of cash, negotiable face-value securities\nissued by Governments, Chartered Banks or Trust Companies, or Irrevocable\nLetters of Credit from a Chartered Bank in a form acceptable to the City of\nBelleville.\n\nFor Residential Customers, the Security Deposit shall be as shown in Schedule\nFor General Service and Bulk Water Customers, the amount of the Security\nDeposit shall be equal to the estimated bill for three billing periods. Where the\n\ncustomer has experienced a delay in making payments, the foregoing amount may\nbe increased to ensure adequate security to City of Belleville.\n\na) The following system will be used to evaluate a customer’s payment record:\n\nAction Demerit Points\nReminder Notice 1\nNSF Cheque 2\nFinal Notice 3\nDisconnection of Water Service | 4\n\nBy-Law Number 2019-81 Page 9 of 14\n"
    },
    {
      "page_number": 10,
      "text": "b) A good payment record is defined as follows:\n\ne Residential — No more than 6 Dermit Points accumulated over 2 consecutive\nyears\n\ne General Service, monthly billing - No more than 18 Dermit Points\naccumulated over 3 consecutive years\n\ne General Service, bimonthly billing - No more than 9 Dermit Points\naccumulated over 3 consecutive years\n\n5. Simple interest will be earned on all security deposits of $100.00 or more, except\nthose held for a period of six months or less. Interest on cash deposits will be paid\nat the time the deposit is refunded or applied to the account. The annual rate of\ninterest will be reviewed and revised by the City of Belleville Water Customer\nService department from time to time.\n\n6. Security deposits will be reviewed each billing cycle and those customers with a\ngood payment record with the Water Customer Service department, for the period\ndefined below, will be returned:\n\ne Residential — the last consecutive 2 year period\ne General Service — the last consecutive 3 year period\n\n7. Where the customer has not maintained a good payment record, the deposit will be\nheld, and, in the event the customer discontinues services with the City of Belleville\nbe applied to the final account.\n\nBy-Law Number 2019-81 Page 10 of 14\n"
    },
    {
      "page_number": 11,
      "text": "Schedule “B” to By-Law No. 2019-81\n\nThe Corporation of the City of Belleville\n\nEffective January 1, 2021\n\nWater Rates, General Service and Residential\n\nTable 1: Water Rates by Consumption\n\nMonthly Water Consumption Rates per cubic meter\nMetered, First 455 cubic meters $1.92\nMetered, Next 22,275 cubic meters $1.46\nMetered, Over 22,730 cubic meters $0.88\nBulk $2.49\nTable 2: Monthly Fixed Charges\nMeter Size Service Fire Protection\n\n5/8 $25.52 $6.07\n\n3/4 $25.52 $6.07\n\n1 $28.07 $8.04\n\n1% $40.83 $16.08\n\n2 $53.59 $24.15\n\n3 $79.11 $40.25\n\n4 $145.21 $80.49\n\n6 $242.44 $140.85\n\n8 $344.52 $201.27\n\n10 $459.62 $279.55\n\nBy-Law Number 2019-81 Page 11 of 14\n\n"
    },
    {
      "page_number": 12,
      "text": "Table 3: Monthly Flat Rate Water Charges (service, not metered)\n\nWater System\n\nRates\n\nCity of Belleville\n\n$46.22\n\nPoint Anne\n\n$117.83\n\nTable 4: Quarterly Water Building Charges\n\nNumber of Units Rates\nSingle to 5 units $127.28\n6 units to 12 units $251.25\n13 units to 26 units $502.50\nOver 26 units $1005.04\n\nTable 5: Other Water Charges\n\nType of Charge Rates\nCollection Charge $25.00\nReconnection Charge — regular business $40.00\nSeasonal Disconnection and Reconnection | $80.00\nChange of Occupancy $25.00\nReturned Cheque (plus bank charges) $30.00\nLate Payment Penalty / Interest (monthly) 1.25%\nLocate Services, Leak Detection, and\nHydrant Maintenacne — Belleville General $90.00\n\nService, per hour\n\nBy-Law Number 2019-81 Page 12 of 14\n\n"
    },
    {
      "page_number": 13,
      "text": "Type of Charge\n\nRates\n\nLocate Services, Leak Detection, and\n\nHydrant Maintenacne — Outside Belleville, $180.00\nper hour\n\n3/4\" and 1” Service Tap (per service) $175.00\n1 1/2” and 2” Service Tap (per service) $350.00\n4’, 6”, and 8” Service Tap (per service) $700.00\nService Tap (per service) Outside\n\nBelleville, applicable rates plus per hour $90.00\ntravel rate\n\nReplace Damaged Meter 5/8” to 1” $200.00\n\nReplace Damaged Meter over 1”\n\nTime and Materials\n\nTable 6: Customer Deposits\n\nService Type\n\nRates\n\nResidential\n\n$250.00\n\nGeneral Service\n\nBased on estimated bill for 3 billing periods\n\nBulk Water Key Deposit\n\n$125.00\n\nBy-Law Number 2019-81 Page 13 of 14\n\n"
    },
    {
      "page_number": 14,
      "text": "Wastewater Rates, General Service and Residential\n\nTable 7: Surcharge as a Percentage of Water Charge\nApplied to water consumption, service, and flat rate charges\n\nWater Consumption Rates (expressed as percentage)\n\nResidential 79.5%\n\nGeneral Service — First 22,730 cubic meters 79.5%\n\nGeneral Service — Over 22,730 cubic meters | 60.0%\n\nTable 8: Other Wastewater Charges\n\nType of Charge Rates\n\nSeptage haulers per 4.546 cubic meters,\n\nplus sampling costs $95.00\n\nSewer rodding, per service — during\n\n. $190.00\nregular business hours\n\nSewer rodding, per service — after hours,\n\nincluding weekends $380.00\n\nBy-Law Number 2019-81 Page 14 of 14\n"
    }
  ]
}