{
  "file_name": "BL 2016-16 A Bylaw to Establish Uniform Development Charges.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "noe\n\nTHE CORPORATION OF THE CITY OF BELLEVILLE\n\nBY-LAW NUMBER 2016-16\n\nA by-law to establish uniform development charges for the Corporation of the City of\nBelleville\n\nWHEREAS subsection 2(1) of the Development Charges Act, 1997 c. 27, as amended\n(hereinafter called “the Act”) provides that the council of a municipality may pass By-laws for the\nimposition of development charges against land for increased capital costs required because of\nthe need for services arising from development in the area to which the by-law applies;\n\nAND WHEREAS the Council of The Corporation of the City of Belleville (“City of Belleville”) has\ngiven Notice in accordance with Section 12 of the Development Charges Act, 1997, of its intention\nto pass a by-law under Section 2 of the said Act;\n\nAND WHEREAS in accordance with the Act, a report entitled “City of Belleville 2015 Development\nCharges Background Study” dated November 20, 2015 prepared by Watson & Associates\nEconomists Ltd. (the “Background Study”), has been campleted;\n\nAND WHEREAS the Council of the City of Belleville has considered the Background Study, has\nconsidered all written submissions, and has heard all persons who applied to be heard no matter\nwhether in objection to, or in support of, the development charge proposal at a public meeting\nheld on December 7, 2015;\n\nAND WHEREAS the Council of the City of Belleville has determined that a further public meeting\nis not necessary pursuant to subsection 12(3) of the Act.\n\nNOW THEREFORE THE COUNCIL OF THE CITY OF BELLEVILLE ENACTS AS FOLLOWS:\n\nDEFINITIONS\n1. In this by-law,\n\n(1) “Accessory building or structure” shall mean a detached buitding or structure that\nis not used for human habitation and the use of which is customarily incidental and\nsubordinate to a principal use, building or structure and is located on the same lot\ntherewith;\n"
    },
    {
      "page_number": 2,
      "text": "BY-LAW NUMBER 2016-16 Page 2 of 25\n\n(2)\n\n(3)\n\n(4)\n\n(5)\n\n(6)\n\n(7)\n\n(8)\n\n(9)\n\n(10)\n\n“Accessory use\" shall mean a use customarily incidental and subordinate to, and\nexclusively devoted to the principal or main use of the lot, building or structure and\nlocated on the same lot as such principal or main use.\n\n“Act” means the Development Charges Act, S.0, 1997, c. 27.\n\n“Administration Service” means any and all studies carried out by the Municipality\nwhich are with respect to eligible services for which a development charge by-law\nmay be imposed under the Development Charges Act, 1997.\n\n“Apartment dwelling’ means any dwelling unit within a building containing three or\nmore dwelling units where the units are connected by an interior corridor.\n\n\"Agricultural use” means the use of land and/or buildings for the cultivation or\nforaging of crops, livestock or poultry production, raising or training of horses, and\norchards, market gardening, maple sugar bushes, tobacco crops or other forms of\nspecialized crop production.\n\n“Bedroom” means a habitable room larger than seven square metres, including a\nden, study, or other similar area, but does not include a living room, dining room\nor kitchen.\n\n“Belleville Downtown Improvement Area” (BDIA) means the geographic location\ndesignated on Schedule “E” of this by-law.\n\n“Board of Education” means a board defined in s.s. 1(1) of the Education Act.\n\n“Bona fide farm operation\" means the proposed development is for agricultural use\nwhere the yearly income from the agricultural use is substantial and the owner\nholds a valid Farm Business Registration Number issued by the Ontario Ministry\nof Agriculture, Food and Rural. Affairs. For purposes of determining bona fide farm\nuses reference may be made to the owner's membership in a legitimate farm\norganization.\n"
    },
    {
      "page_number": 3,
      "text": "BY-LAW NUMBER 2016-16 Page 3 of 25\n\n(11)\n\n(12)\n\n(13)\n\n(14)\n\n(15)\n\n“Building Code Act” means the Building Code Act, 1992, S.O. 1992, ¢.23.\n\n“Capital cost” means costs incurred or proposed to be incurred by the Municipality\nor a local board thereof directly or by others on behalf of, and as authorized by, the\nMunicipality or local board,\n\n(a) to acquire land or an interest in land, including a leasehold interest;\n(b) to improve land;\n(c) to acquire, lease, construct or improve buildings and structures;\n(d) to acquire, lease, construct or improve facilities including,\n(i) rolling stock with an estimated useful life of seven years or more,\n(ii) furniture and equipment, other than computer equipment, and\n(iil) materials acquired for circulation, reference or information\npurposes by a library board as defined in the Public Libraries Act,\nR.S.O. 1990, ¢.P.-44; and\n(e) to undertake studies in connection with any of the matters referred to in\nclauses (a) to (d);\n(f) to complete the development charge background study under Section 10\nof the Act;\n(g) interest on money borrowed to pay for costs in (a) to (d);\n\nrequired for provision of services designated in this by-law within or outside the\nMunicipality.\n\n“Central Business District” (CBD) means the geographical location designated on\nSchedule “D” of this by-law.\n\n“Council” means the Council of The Corporation of the City of Belleville.\n\n“Development” means any activity or proposed activity in respect of land that\nrequires one or more of the actions referred to in section 7 of this by-law and\nincluding the redevelopment of land or the redevelopment, expansion, extension\nor alteration of a use, building or structure except interior alterations to an existing\nbuilding or structure which do not change or intensify the use of land.\n"
    },
    {
      "page_number": 4,
      "text": "BY-LAW NUMBER 2016-16 Page 4 of 25\n\n(16)\n\n(17)\n\n(18)\n\n(19)\n\n(20)\n\n(21)\n\n(22)\n\n“Development charge” means a charge imposed pursuant to this By-law.\n\n“Duplex dwelling” means a residential building that is divided horizontally into two\ndwelling units.\n\n“Dwelling unit\" means a suite operated as a housekeeping unit, used or intended\n\nto be used as a domicile by 1 or more persons and usually containing cooking,\n\neating, living, sleeping and sanitary facilities, and includes:\n\n(a) a park model home;\n\n(b) a bedroom in a students' or seniors’ residence;\n\n(c) a building, or portion of a building, used for residential purposes as set out\nin Subsection 34.\n\n“Farm building” means that part of a bona fide farm operation encompassing barns,\nsilos and other ancillary development to an agricultural use, but excluding a\nresidential use,\n\n“Grade” means the average level of finished ground adjoining a building or\nstructure at all exterior walls.\n\n“Gross floor area” means the total area of all building floors above or below grade\nmeasured between the outside surfaces of the exterior walls, or in the case of a\nmixed use building or structure, between the outside surfaces of exterior walls\nand the centre line of party walls dividing a non-residential use and a residential\nuse, except for:\n\n(a) a room or enclosed area within the building or structure above or below\nthat is used exclusively for the accommodation of heating, cooling,\nventilating, electrical, mechanical or telecommunications equipment that\nservice the building;\n\n(b) loading facilities above or below grade; and\n\n(c) a part of the building or structure below grade that is used for the parking\nof motor vehicles or for storage or other accessory use;\n\n“Industrial use\" means lands, buildings or structures used or designed or intended\nfor use for manufacturing, processing, fabricating or assembly of raw goods,\nwarehousing or bulk storage of goods, and includes office uses and the sale of\n"
    },
    {
      "page_number": 5,
      "text": "BY-LAW NUMBER 2016-16 Page 5 of 25\n\n(23)\n\n(24)\n\n(25)\n\n(26)\n\n(27)\n\n(28)\n\n(29)\n\ncommodities to the general public where such uses are accessory to an industrial\nuse, but does not include the sale of commodities to the general public through a\nwarehouse club or an agricultural use.\n\n“Local Board\" means a school board, public utility, commission, transportation\ncommission, public library board, board of park management, local board of health,\nboard of commissioners of police, planning board, or any other board,\ncommission, committee, body or local authority established or exercising any\npower or authority under any general or special Act with respect te any of the affairs\nor purposes, including schoo! purposes, of the Municipality or any part or parts\nthereof.\n\n“Local services” means those services or facilities which are under the jurisdiction\nof the Municipality and are related to a plan of subdivision or within the area to\nwhich the plan relates, required as a condition of approval under s.51 of the\nPlanning Act, or as a condition of approval under s.53 of the Planning Act.\n\n“Mixed use” means a building, structure or development with portions which are to\nbe used for residential development and other portions which are to be used for\nnon-residential development;\n\n“Multiple dwelling” means all dwellings other than single detached dwellings, semi-\ndetached dwellings, duplex dwellings, apartment dwellings and special care\ndwelling units;\n\n“Municipality” means The Corporation of the City of Belleville;\n\n“Non-residential use” means a building or structure used for other than a residential\n\nuse;\n\n“Official Plan” means the Official Plan of the City of Belleville and any amendments\nthereto.\n"
    },
    {
      "page_number": 6,
      "text": "BY-LAW NUMBER 2016-16 Page 6 of 25\n\n(30)\n\n(31)\n\n(32)\n\n(33)\n\n(34)\n\n(35)\n\n(36)\n\n(37)\n\n(38)\n\n“Owner” means the owner of land or a person who has made application for an\napproval for the development of land upon which a development charge is\nimposed.\n\n“Place of worship\" means that part of a building or structure that is exempt from\ntaxation as a place of worship under the Assessment Act, R. S.O. 1990, Chap.\nA.31, as amended, or any successor thereof.\n\n“Planning Act” means the Planning Act, R.S.O. 1990, c.P.-13, as amended.\n“Regulation” means any regulation made pursuant to the Act.\n\n“Residential use” means lands, buildings or structures or portions thereof used, or\ndesigned or intended to be used as a home or residence of one or more individuals\nwho reside or dwell there permanently or for a considerable period of time, and\nincludes a single detached dwelling, a semi-detached dwelling, a multiple dwelling,\na duplex dwelling, an apartment dwelling, special care dwelling units, and the\nresidential portion of a mixed-use building or structure, but does not include a place\nof worship, student residence, military barracks, hotel, motel, or bed and breakfast\nwhere individuals typically stay for less than one week;\n\n“Semi-detached dwelling” means a building divided vertically into two dwelling\nunits each of which has a separate entrance and access to grade;\n\n“Services” means services set out in Schedule “A” to this By-law;\n\n“Single detached dwelling” means a completely detached building containing only\none dwelling unit;\n\n“Special Care Dwelling Unit” means a unit within a building containing more than\nsix dwelling units or dwelling rooms that are designed to accommodate individuals\nwith specific support needs, including independent permanent living\narrangements, where support services such as meal preparation, grocery\nshopping, housekeeping, nursing, respite care and attendant services are\n\nprovided at various levels, and:\n"
    },
    {
      "page_number": 7,
      "text": "BY-LAW NUMBER 2016-16 Page 7 of 25\n\n(38)\n\n(a)\n(b)\n\n(c)\n\nthe units have a common entrance from street level;\n\nthe occupants have the right to use common halls, stairs, yards, rooms,\nand accessory buildings; and\n\nthe units or rooms may or may not have exclusive sanitary or culinary\nfacilities or both.\n\n“Urban Service Area” means that area within the Municipality shown as urban area\n\non Schedule “C’ of this by-law.\n\nCALCULATION OF DEVELOPMENT CHARGES\n\n2 (1)\n\n(2)\n\nSubject to the provisions of this by-law, development charges against land shall\n\nbe imposed, calculated and collected in accordance with the base rates set out in\nSchedules “B-1”, “B-2”, and “B-3”, which relate to the services set out in Schedule\n\n“yn\n\nThe development charge with respect to the use of any land, buildings or structures\n\nshall be calculated as follows:\n\n(a)\n\n(b)\n\n(c)\n\nin the case of residential development or redevelopment, or the residential\nportion of a mixed-use development or redevelopment, the sum of the\nproduct of the number of dwelling units of each type multiplied by the\ncorresponding total amount for such dwelling unit type, as set out in\nSchedules “B-1”, “B-2”, and “B-3”:\n\nnotwithstanding subsection (a), the development charge for residential\ndevelopment located within the boundary of the Central Business District\nas set out in Schedule \"D” will be equal to 50% of the of the total amount\notherwise calculated in subsection (a);\n\nin the case of non-residential development or redevelopment, or the non-\nresidential portion of a mixed-use development or redevelopment, the\nproduct of the gross floor area of such development multiplied by the\ncorresponding total amount for such gross floor area, as set out in\nSchedules “B-1’, “B-2”, and “B-3”;\n"
    },
    {
      "page_number": 8,
      "text": "BY-LAW NUMBER 2016-16 Page 8 of 25\n\n(3)\n\n(4)\n\n(d) in the case of an “industrial use” the applicable charge shall be nil;\n\n(e) in the case of a:student residence the applicable charge, per room, is as\nestablished for “Apartments Bach. & 1 Bedroom and Special Care”. as set\nout in Schedules “B-1”, “B-2” and “B-3”.\n\nThe development charges for water and wastewater services are applicable only\nwithin the Urban Service Area designated in Schedule “C” to this by-law.\n\nCouncil hereby determines that the development or redevelopment of land,\nbuildings or structures for residential and non-residential uses will require the\nprovision, enlargement or expansion of the services referenced in Schedule “A”.\n\nPHASE-IN OF DEVELOPMENT CHARGES\n\n3. The development charges imposed pursuant to this by-law shall be phased-in in\n\naccordance with the following schedule:\n\n(1) From January 26, 2016 to December 31, 2016, the amount of the development\ncharges shall be as shown on Schedule “B-1”;\n(2) From January 1, 2017 to December 31, 2017, the amount of the development\ncharges shall be as shown on Schedule “B-2”;\n(3) From January 1, 2018 to January 25, 2021, the amount of the development\ncharges shall be as shown on Schedule “B-3\";\nAPPLICABLE LANDS\n4. (1) Subject to subsection (2) and Sections 5 and 6, charges payable under Schedules\n“B-1\", “B-2”, and “B-3” of this by-law apply to all lands in the Municipality, whether\nor not the land or use is exempt from taxation under Section 3 of the Assessment\nAct, R.S.O. 1990, c.A.-31.\n(2) This by-law shall not apply to land that is owned by and used for the purposes of:\n\n(a) a board of education;\n"
    },
    {
      "page_number": 9,
      "text": "BY-LAW NUMBER 2016-16 Page 9 of 25\n\n(3)\n\n(b) any municipality or local board thereof,\n\n(c) private schools as defined in the Education Act,\n\n(d) a place of worship classified as exempt from taxation under Section 3 of\nthe Assessment Act;\n\n(e) hospitals under the Public Hospitals Act;\n\n(f) a non-residential farm building;\n\n(g) Non-residential (other than industrial) land uses located within the Belleville\n\nDowntown Improvement Area as defined in Schedule “E”:\n(h) development creating or adding an accessory use or structure not\nexceeding ten square metres of non-residential floor area.\n\nThe Municipality may exempt lands from this by-law where the lands are\ndesignated in the City of Belleville Official Plan as part of a Community\nImprovement Area and the Municipality implements a Community Improvement\nPlan which includes the said lands.\n\nRULES WITH RESPECT TO EXEMPTIONS FOR INTENSIFICATION OF EXISTING HOUSING\n\n5, (1)\n\n(2)\n\nNotwithstanding Section 4 above, no development charge shall be imposed with\nrespect to developments or portions of developments as follows:\n\n(a) the enlargement of an existing dwelling unit;\n\n(b) the creation of one or two additional dwelling units in an existing single\ndetached dwelling where the total gross floor area of the additional unit(s)\ndoes not exceed the gross floor area of the existing dwelling unit;\n\n(c) the creation of one additional dwelling unit in any other existing residential\nbuilding provided the gross floor area of the additional unit does not exceed\nthe smallest existing dwelling unit already in the building.\n\nNotwithstanding subsection 5(1)(b), development charges shall be calculated and\ncollected in accordance with Schedules “B-1”, “B-2’, and “B-3” where the total\nresidential gross floor. area of the additional one or two dwelling units is greater\nthan the total gross floor area of the existing single detached dwelling unit.\n"
    },
    {
      "page_number": 10,
      "text": "|\n\nBY-LAW NUMBER 2016-16 Page 10 of 25\n\n(3)\n\nNotwithstanding subsection 5(1)(c), development charges shall be calculated and\ncollected in accordance with Schedules “B-1”, \"B-2”, and “B-3\" where the additional\ndwelling unit has a residential gross floor area greater than,\n\n(a) in the case of semi-detached house or multiple dwelling, the gross floor\narea of the existing dwelling unit, and\n\n(b) in the case of any other residential building, the residential gross floor area\nof the smallest existing dwelling unit.\n\nRULES WITH RESPECT TO AN “INDUSTRIAL” EXPANSION EXEMPTION\n\n6 (1)\n\n(2)\n\n(3)\n\nNotwithstanding Section 4, if a development includes the enlargement of the gross\nfloor area of an existing industrial building, the amount of the development charge\nthat is payable is the following:\n\n(a) if the gross floor area is enlarged by 50 percent or less, the amount of the\ndevelopment charge in respect of the enlargement is zero; or\n\n(b) if the gross floor area is enlarged by more than 50 percent, development\ncharges are payable on the amount by which the enlargement exceeds 50\npercent of the gross floor area before the enlargement.\n\nFor the purpose of this section, the terms “gross floor area’ and “existing industrial\nbuilding” shall have the same meaning as those terms have in O.Reg. 82/98 made\nunder the Act.\n\nIn this section, for greater certainty in applying the exemption herein:\n(a) the gross floor area of an existing industrial building is enlarged where there\n\nis a bona fide physical and functional increase in the size of the existing\nindustrial building,\n"
    },
    {
      "page_number": 11,
      "text": "ee ee ne\n\nBY-LAW NUMBER 2016-16 Page 11 of 25\n\nDEVELOPMENT CHARGES IMPOSED\n\n7. (1) Subject to subsection (2), development charges shall be calculated and collected\n\nin accordance with the provisions of this by-law and be imposed on land to be\ndeveloped for residential and non-residential use, where, the development\n\nrequires,\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(e)\n\n0)\n\n(9)\n\nthe passing of a zoning by-law or an amendment thereto under Section 34\nof the Planning Act;\n\nthe approval of a minor variance under Section 45 of the Planning Act;\n\na conveyance of land to which a by-law passed under subsection 50(7) of\nthe Planning Act applies;\n\nthe approval of a plan of subdivision under Section 51 of the Planning Act,\n\na consent under Section 53 of the Planning Act,\n\nthe approval of a description under Section 50 of the Condominium Act,\nR.S.O, 1990, c.C.-26; or\n\nthe issuing of a permit under the Building Code Act, in relation to a building\nor structure.\n\n(2) Subsection (1) shall not apply in respect to:\n\n(a)\n\n(b)\n\nlocal services installed or paid for by the owner within a plan of subdivision\nor within the area to which the plan relates, as a condition of approval under\nSection 51 of the Planning Act;\n\nlocal services installed or paid for by the owner as a condition of approval\nunder Section 53 of the Planning Act.\n"
    },
    {
      "page_number": 12,
      "text": "oe Sean\n\nBY-LAW NUMBER 2016-16 Page 12 of 25\n\nLOCAL SERVICE INSTALLATION\n\n8. Nothing in this by-law prevents Council from requiring, as a condition of an agreement\nunder Section 51 or 53 of the Planning Act, that the owner, at his or her own expense,\nshall install or pay for such local services, within the Plan of Subdivision or within the area\nto which the plan relates, as Council may require.\n\nMULTIPLE CHARGES\n\n9. (1) Where two or more of the actions described in subsection 7(1) are required before\n\nland to which a development charge applies can be developed, only one\ndevelopment charge shall be calculated and collected in accordance with the\nprovisions of this by-law.\n\n(2) Notwithstanding subsection (1), if two or more of the actions described in\nsubsection 7(1) occur at different times, and if the subsequent action has the effect\nof increasing the need for municipal services as set out in Schedule “A”, an\nadditional development charge on the additional residential units and non-\nresidential gross floor area shall be calculated and collected in accordance with\nthe provisions of this by-law.\n\nSERVICES IN LIEU\n\n10. (1) Council may authorize an owner, through an agreement under Section 38 of the\n\nAct, to substitute such part of the development charge applicable to the owner's\ndevelopment as may be specified in the agreement, by the provision at the sole\nexpense of the owner, of services in lieu. Such agreement shall further specify\nthat where the owner provides services in lieu in accordance with the agreement,\nCouncil shall give to the owner a credit against the development charge in\naccordance with the agreement provisions and the provisions of Section 39 of the\nAct, equal to the reasonable cost to the owner of providing the services in lieu. In\nno case shall the agreement provide for a credit that exceeds the total\ndevelopment charge payable by an owner to the Municipality in respect of the\ndevelopment to which the agreement relates.\n"
    },
    {
      "page_number": 13,
      "text": "BY-LAW NUMBER 2016-16 Page 13 of 25\n\n11.\n\n12.\n\n(2)\n\n(3)\n\nIn any agreement under subsection (1), Council may also give a further credit to\nthe owner equal to the reasonable cost of providing services in addition to, or of a\ngreater size or capacity, than would be required under this by-law.\n\nThe credit provided for in subsection (2) shall not be charged to any development\ncharge reserve fund.\n\nRULES WITH RESPECT TO REDEVELOPMENT\n\nDespite any other provisions of this By-law, where, as a result of the redevelopment of\n\nland, a building or structure existing on the same land within five years prior to the date of\n\npayment of development charges in regard to such redevelopment was, or is to be\n\ndemolished, in whole or in part, or converted from one principal use to another principal\nuse on the same land, in order to facilitate the redevelopment, the development charges\notherwise payable with respect to such redevelopment shall be reduced by the following\n\namounts:\n\n(1)\n\n(2)\n\n(3)\n\nIn the case of a residential building or structure, or in the case of a mixed use\nbuilding or structure, the residential uses in the mixed use building or structure, an\namount calculated by multiplying the applicable development charge as set out in\nSchedules “B-1”, “B-2”, and “B-3”, by the number, according to type, of dwelling\nunits that have been or will be demolished or converted to another principal use;\nand\n\nIn the case of a non-residential building or structure or, in the case of mixed use\nbuilding or structure, the nonresidential uses in the mixed use building or structure,\nan amount calculated by multiplying the applicable development charges as set\nout in Schedules “B-1”, “B-2”, and “B-3”, by the gross floor area that has been or\nwill be demolished or converted to another principal use.\n\nNotwithstanding (2) above, for an industrial use the reduction shall be calculated\nby multiplying the “Non-residential” development charges as set out in Schedules\n“B-1\", “B-2”, and “B-3”, by the gross floor area that has been or will be demolished\nor converted to another principal use.\n\nA credit shall not exceed the amount of the development charge that would otherwise be\npayable, and no existing land use that is exempt under this By-law shail be eligible for a\n"
    },
    {
      "page_number": 14,
      "text": "BY-LAW NUMBER 2016-16 Page 14 of 25\n\ncredit within 5 years of the date that an Occupancy Permit was issued for the gross floor\narea that has been or will be demolished or converted to another principal use.\n\nTIMING OF CALCULATION AND PAYMENT\n\n13.\n\n14.\n\n(1)\n\n(2)\n\n(4)\n\n(1)\n\n(2)\n\n(3)\n\nDevelopment charges shall be calculated, payable and collected in full in money\nor by provision of services as may be agreed upon, or by credit granted under the\nAct, on the date that the first building permit is issued in relation to a building or\nstructure on land to which a development charge applies.\n\nWhere development charges apply to land in relation to which a building permit is\nrequired, the building permit shall not be issued until the development charge has\n\nbeen paid in full.\n\nIf development charges are paid and the applicable building permit is cancelled or\nrevoked before construction begins, the development charges will be refunded to\nthe registered owner of the land.\n\nCouncil from time to time, and at any time, may enter into agreements providing\nfor all or any part of a development charge to be paid before or after it would\notherwise be payable, in accordance with Section 27 of the Act.\n\nRESERVE FUNDS\n\nMonies received from payment of development charges under this by-law shall be\nmaintained in four separate reserve funds as follows: roads and related and\nprotection; water; wastewater and parks and recreation, libraries and\nadministration.\n\nMonies received for the payment of development charges shall be used only in\naccordance with the provisions of Section 35 of the Act.\n\nCouncil directs the Municipal Treasurer to divide the reserve funds created\nhereunder into separate subaccounts in accordance with the service sub-\ncategories set out in Schedule “A” to which the development charge payments\n"
    },
    {
      "page_number": 15,
      "text": "BY-LAW NUMBER 2016-16 Page 15 of 25\n\n(4)\n\n(5)\n\n(6)\n\nBY-LAW\n\n(2)\n\n(3)\n\nshall be credited in accordance with the amounts shown, plus interest earned\n\nthereon.\n\nWhere any development charge, or part thereof, remains unpaid after the due date,\nthe amount unpaid shall be added to the tax roll and shall be collected as taxes.\n\nWhere any unpaid development charges are collected as taxes under subsection\n(4), the monies so collected shall be credited to the development charge reserve\nfunds referred to in subsection (1).\n\nThe Treasurer of the Municipality shall, in each year commencing in 2017 for the\n2016 year, furnish to Council a statement in respect of the reserve funds\nestablished hereunder for the prior year, containing the information set out in\nSection 12 of O.Reg. 82/98.\n\nD OR APPEA\n\nWhere this by-law or any development charge prescribed there under is amended\nor repealed by order of the Ontario Municipal Board or by resolution of the\nMunicipal Council, the Municipal Treasurer shall calculate forthwith the amount of\nany overpayment to be refunded as a result of said amendment or repeal,\n\nRefunds that are required to be paid under subsection (1) shali be paid to the\nregistered owner of the land on the date on which the refund is paid.\n\nRefunds that are required to be paid under subsection (1) shall be paid with interest\nto be calculated as follows:\n\n(a) interest shall be calculated from the date on which the overpayment was\ncollected to the day on which the refund is paid;\n\n(b) the refund shail include the interest owed under this section;\n\n(c) interest shall be paid at the Bank of Canada rate in effect on the date of\nenactment of this by-law.\n"
    },
    {
      "page_number": 16,
      "text": "BY-LAW NUMBER 2016-16 Page 16 of 25\n\nBY-LAW INDEXING\n\n16. The development charges imposed pursuant to this by-law shall be adjusted without\namendment to this by-law commencing on the 1° day of January, 2017 and annually\nthereafter on the 1° day of January, in accordance with the most recent twelve month\nchange in the Statistics Canada Quarterly, Non-Residential Building Construction Price\nIndex (CANSIM Table 327-0043).\n\nSEVERABILITY\n\n17. In the event any provision, or part thereof, of this by-law is found by a court of competent\njurisdiction to be ultra vires, such provision, or part thereof, shall be deemed to be severed,\nand the remaining portion of such provision and all other provisions of this by-law shall\nremain in full force and effect.\n\nHEADINGS FOR REFERENCE ONLY\n\n18. The headings inserted in this by-law are for convenience of reference only and shall not\naffect the construction of or interpretation of this by-law.\n\nBY-LAW REGISTRATION\n\n19. A certified copy of this by-law may be registered on title to any land to which this by-law\napplies.\n\nBY-LAW ADMINISTRATION\n\n20, This by-law shall be administered by the Municipal Treasurer.\n\nSCHEDULES TO THE BY-LAW\n\n21. The following Schedules to this by-law form an integral part of this by-law:\n\nSchedule “A” - Designated Municipal Services\n"
    },
    {
      "page_number": 17,
      "text": "BY-LAW NUMBER 2016-16 Page 17 of 25\n\nSchedule “B-1”  - Schedule of City-Wide Development Charges effective January 26,\n2016 — December 31, 2016\n\nSchedule “B-2” - Schedule of City-Wide Development Charges effective January 1,\n2017 — December 31, 2017\n\nSchedule “B-3” - Schedule of City-Wide Development Charges effective January 1,\n2018 — January 25, 2021\n\nSchedule “C” - Schedule Designating the Urban Service Area and the Thurlow\nRural Service Area\n\nSchedule “D” - Schedule Designating the Centra! Business District (CBD)\n\nSchedule “E” - Schedule Designating the Belleville Downtown Improvement Area\n(BDIA)\n\nDATE BY-LAW EFFECTIVE\n\n22. This By-law shall come into force and effect at 12:01 AM on January 26, 2016,\n\nTE BY-LAW EXPIRES\n\n23. This By-law will expire five years from the date of passage, unless it is repealed at an\nearlier date.\n\nEXISTING BY-LAW REPEALED\n\n24, By-law No. 2014-140, as amended, (City-Wide) and By-law No. 2011-196 (South Loyalist\nSecondary Plan Area) are hereby repealed as of the date and time of this By-law coming\ninto effect.\n"
    },
    {
      "page_number": 18,
      "text": "BY-LAW NUMBER 2016-16 Page 18 of 25\nSHORT TITLE\n25. This by-law may be cited as the “City of Belleville Development Charge By-law, 2016.”\n\nRead a first time this 25\" day of January, 2016.\nRead a second time this 25\" day of January, 2016.\n\nRead a third time and finally passed this 25\"\" day of January, 2016.\n\nTASO CHRISTOPHER MAYOR\n\nMATT MACDONALD CITY CLERK\n"
    },
    {
      "page_number": 19,
      "text": "BY-LAW NUMBER 2016-16 Page 19 of 25\n\nSCHEDULE “A” TO BY-LAW NUMBER 2016-16\n\nDESIGNATED MUNICIPAL SERVICES UNDER THIS BY-LAW\n\n1. Roads and Related Service\n2. Parks and Recreation Service\n\n3. Library Service\n\n4. Administration Service\n5. Protection Service\n6. Water Service\n\n7. Wastewater Service\n"
    },
    {
      "page_number": 20,
      "text": "BY-LAW NUMBER 2016-16 Page 20 of 25\n\nSCHEDULE “B-1” TO BY-LAW NUMBER 2016-16\nSCHEDULE OF CITY-WIDE DEVELOPMENT CHARGES\n\nEffective January 26, 2016 — December 31, 2016\n\nRESIDENTIAL,\n(per Dwelling Unit)\nApartments\nService >\nSingle & Semi |, DUPIEXE | | Bach, &1 vmurpes | atts\nDetached Pal Bedroom and Pp ross Floor\nBedrooms +\n\nSpecial Care Area)\n\nRoads and Related $ 2.14\n\nProtection Services $ 0.40\n\nParks and Recreation $ 0.13\n\nLibrary Services $ :\n\nAdministration - Studies 101 71 40 $ 0.06\nTotal City-Wide Services 6,735 4,743 $\n\nUrban Services\nWastewater\n\n10,201\n\n"
    },
    {
      "page_number": 21,
      "text": "BY-LAW NUMBER 2016-16\n\nSCHEDULE “B-2” TO BY-LAW NUMBER 2016-16\n\nSCHEDULE OF CITY-WIDE DEVELOPMENT CHARGES\n\nEffective January 1, 2017 - December 31, 2017\n\nPage 21 of 25\n\n~ T RESIDENTIAL NON-\n{per Dwelling Unit) RESIDENTIAL\nService , . Duplex & Apartments (per ft? of\nSingle & Semi Apartments 2 Bach. &1 Muttiptes Gross Floor\nDetached Bedrooms + Bedroom and Area)\n\nCity-Wide Services:\nRoads and Related\nProtection Senices\nParks and Recreation\nLibrary Services\n\nUrban Services\nWastewater\n\n$\n$\n§\n$\n$\n$\n\nSpecial Care\n\n3,625 | $ 2,546 | $\n680 | $ 484) $ 0.41\n2,898 | $ 2,034 | $ 0.13\n-1{$ -|$ -\n$ $ 0.07\n$ E 238\n1,383 0.63\n\n2,083\n\nAdministration - Studies 110 77\nTotal City-Wide Services 7,323 5,14\na Se oe\n\n"
    },
    {
      "page_number": 22,
      "text": "BY-LAW NUMBER 2016-16 Page 22 of 25\n\nSCHEDULE “B-3” TO BY-LAW NUMBER 2016-16\nSCHEDULE OF CITY-WIDE DEVELOPMENT CHARGES\n\ni Effective January 1, 2018 — January 25, 2021\n\nRESIDENTIAL\n\n{ NON-\ni b (per Dwelling Unit) RESIDENTIAL\nService ; ; Duplex & Apartments (per ft? of\nSingle & Semi | a cortments 2 | bach. &1 Multiples | Gross Floa\nDetached Bedroomes | Bedroom and e cane\n; _ __ ms Special Care va)\nj City-Wide Services: |\n1 Roads and Related $ 3,916 | $ 2,743 | $ 1,513 1 $ 2,997 | $ 2.32\nProtection Services $ 745 | $ 522) $ 288 | $ 570] $ 0.43\nParks and Recreation $ 3,130 | $ 2,192 | $ 1,209 | $ 2,396 | $ 0.14\nLibrary Services $ -|$ -|$ -|$ -1§ -\nAdministration - Studies $ 119 | $ 83] $ 461 $ $ 0.07\nTotal City-Wide Services $ $ $ $ $\n!\n;\n7,910\n11,376\n\n"
    },
    {
      "page_number": 23,
      "text": "Page 23 of 25\n\nBY-LAW NUMBER 2016-16\n\nRURAL SERVICE AREA\n\nTO BY-LAW NUMBER 2016-16\n\nSCHEDULE “Cc”\nDESIGNATION OF THE URBAN SERVICE AREA AND\n\n<=\nAANANUDY ES\n\n\\\\\n\nAN\n\nHIGHWAY 401.....\n\n\\\\\n\n\\\n\n\\\n\n, CITY OF BELLEVILLE\nENGINEERING & DEVELOPMENT\n\nSCHEDULE \"Cc\"\nTO BY-LAW NO. 2016-16, AS AMENDED\nAREA AND THE RURAL SERVICE AREA\n\nDESIGNATION OF THE URBAN SERVICE\n\nLE SERVICES DEPARTMENT\n\nof Quinte\n\nox faeBan of\n\nBELLE\n\nV///4 URBAN SERVICE AREA\n\n"
    },
    {
      "page_number": 24,
      "text": "BY-LAW NUMBER 2016-16\n\nPage 24 of 25\n\nSCHEDULE “D” TO BY-LAW NUMBER 2016-16\n\nDESIGNATION OF THE CENTRAL BUSINESS DISTRICT (CBD)\n\n(7\n7 RY y =\n7\nneh as\n7\n> iy\nt ew\niy\nao\nfil ii\nLD RTO)\nBUN, f\nai\nH\nSCHEDULE \"D\"\n\nTO BY-LAW NO. 2016-16, AS AMENDED\n\nDESIGNATION OF THE\nCENTRAL BUSINESS DISTRICT\n\nVZZ4 Central Business District (C.B.D.)\n\nTiles\n\na\n\nHH\n\nMeters\n\n100 200 300\n\nCITY OF BELLEVILLE\n\n7 ENGINEERING & DEVELOPMENT\n\nSERVICES DEPARTMENT\n\n"
    },
    {
      "page_number": 25,
      "text": "»\n\nCAG | ie ia\nFre \" aol\nLOR\n\npaar fp ¢ i — [ —] +\n\n>.\n\nBY-LAW NUMBER 2016-16\n\nPage 25 of 25\n\nSCHEDULE “E” TO BY-LAW NUMBER 2016-16\n\nDESIGNATION OF THE BELLEVILLE DOWNTOWN IMPROVEMENT AREA (BDIA)\n\né\nL?\n\nSS\nI\n\nS} Pi\n\nnN\n\nRY\n\nN |\n\naN\nASS\n\nBN\nve\n\nSX\n\nTATEN\nNY\n‘\n\nARUNCINNU\n\nonset\n\nNW\n\nON\n\ni\n\nUl\n\nN\n\ns\nRAS\n\na\n\naaa\n\n\\\n:\n\ny BUNDAS\nLA\n\nSOUTH,\n\na\n\nit\nU\n\niE RD.\n\nBAY.\n\n=\n\nSCHEDULE \"E\"\nTO BY-LAW NO. 2016-16, AS AMENDED\nDESIGNATION OF THE BELLEVILLE\nDOWNTOWN IMPROVEMENT AREA (B.D.1.A.)\n\nV///4 DOWNTOWN IMPROVEMENT AREA (B.D.1.A.)\n\niN\n\n0 100 200 300 400°\n=\n\nLEVILLE SERVICES DEPARTMENT\n\nCena yu\n\nENGINEERING & DEVELOPMENT\n"
    }
  ]
}