{
  "file_name": "BL 2005-200 A Bylaw Authorize Permits for Overweight Loads.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\n\nBY-LAW NUMBER 2005-200\n\nA BY-LAW TO AUTHORIZE THE DIRECTOR OF ENGINEERING AND PUBLIC\nWORKS TO ISSUE PERMITS TO MOVE VEHICLES, LOADS, OBJECTS OR\nSTRUCTURES IN EXCESS OF WEIGHT AND SIZE LIMITS PRESCRIBED BY THE\nHIGHWAY TRAFFIC ACT ON CITY ROADS AND TO ESTABLISH CONDITIONS FOR\nWHICH SUCH PERMITS MAY BE ISSUED\n\nWHEREAS the Municipal Corporation or other authority having jurisdiction over a\nhighway may, upon application in writing, grant a permit for the moving of overweight\nvehicles, loads, objects or structures in excess of the dimensional limits as set out in\nSection 109 or the weight limits set out in Part VIII (being Sections 114 to 127) of the\nHighway Traffic Act pursuant to the provisions of Section 110 of the Highway Traffic Act,\nR.S.O., 1990, Chapter H.8, as amended.\n\nAND WHEREAS the Council of The Corporation of the City of Belleville reserves the\nright to suspend or revoke a permit and to establish an appeal procedure pursuant to\nthe provisions of the Statutory Powers Procedure Act, R.S.O., 1990, Chapter S.22, as\namended.\n\nAND WHEREAS the Council of The Corporation of the City of Belleville deems it\ndesirable to grant such permits.\n\nNOW THEREFORE the Council of The Corporation of the City of Belleville enacts as\nfollows:\n1. DEFINITIONS\n\nIn this by-law:\n\n1.1. \"Applicant\" means the person making an application for a permit under\nthis by-law.\n\n1.2 \"Corporation\" means The Corporation of the City of Belleville.\n\n1.3. \"Council” means the Mayor and Members of City Council of the City of\nBelleville.\n"
    },
    {
      "page_number": 2,
      "text": "By-Law Number 2005-200 Page 2\n\n1.4\n\n1.5\n\n1.6\n\n1.7\n\n1.8\n\n1.9\n\n\"Director of Engineering and Public Works\" means the person appointed\nto administer and manage the provisions of this by-law for The\nCorporation of the City of Belleville and includes his authorized\nsubordinates and assistants.\n\n“Equipped Vehicle’ means a self propelled vehicle manufactured,\ndesigned, redesigned, converted or reconstructed either temporarily or\npermanently for snow clearing, snow hauling or for any other snow moving\npurposes.\n\n\"Highway\" includes a common and public highway, street, avenue,\nparkway, driveway, square, place, bridge, viaduct or trestle, any part of\nwhich is intended for or used by the general public for the passage of\nvehicles and pedestrians and includes the area between the lateral\nproperty lines thereof.\n\n\"Motor Vehicle\" includes an automobile, motorcycle, motor assisted\nbicycle unless otherwise indicated, and any other vehicle propelled or\ndriven otherwise than by muscular power, but does not include a street\ncar, or other motor vehicles running only upon rails, or a motorized snow\nvehicle, traction engine, farm tractor, self-propelled implement of\nhusbandry or road building machine.\n\n\"Municipal By-Law Enforcement Officer\" means the officer appointed to\nenforce the provisions of this by-law or any other by-law and includes his\nauthorized subordinates or assistants, and by virtue of Section 15 of the\nPolice Services Act, R.S.O. 1990, Chapter P.15 as amended, such Officer\nis a \"Peace Officer\".\n\n\"Officer\" includes a municipal by-law enforcement officer, a police officer,\na special constable or a peace officer.\n\n\"Operator\" means the driver of any vehicle for which a permit has been\nissued and includes any person employed, engaged or contracted by the\n\"Owner\".\n\n\"Owner\" means the owner of an overweight and oversized vehicle, load,\nobject or structure for which a permit is sought or has been issued.\n\n\"Peace Officer\" includes a police officer, a constable, a conservation\nofficer or other person employed for the preservation and maintenance of\nthe public peace and by virtue of Section 15 of the Police Services Act,\nR.S.O., 1990, Chapter P.15, as amended, includes a municipal by-law\nenforcement officer.\n"
    },
    {
      "page_number": 3,
      "text": "By-Law Number 2005-200 Page 3\n\n1.13 \"Permit\" means a permit issued under this by-law that grants a privilege to\nthe holder thereof.\n\n1.14 \"Permit Holder\" means the person to whom a permit is issued and\nincludes an authorized owner or operator.\n\n1.15 \"Person\" includes an individual, but also a partnership and body corporate\nand any association and the heirs, executors, administrators, successors\nand assigns or other legal representatives thereof to whom the context\nmay apply.\n\n1.16 \"Trailer\" means a vehicle that is at any time drawn upon a highway by a\nmotor vehicle, except an implement of husbandry, a mobile home, another\nmotor vehicle or any device or apparatus not designed to transport\npersons or property, temporarily drawn, propelled or moved upon such\nhighway, and except a side car attached to a motorcycle, and shall be\nconsidered a separate vehicle and not part of the motor vehicle by which it\nis drawn.\n\n1.17 1.17.1 ‘Vehicle\" includes a motor vehicle, trailer, traction engine, farm\ntractor, road building machine and any vehicle drawn, propelled\nor driven by any kind of power, including muscular power, but\ndoes not include a motorized snow vehicle or a street car;\n\n1.17.2 “Emergency Vehicle\" means a vehicle or combination of\nvehicles which provide any emergency service and includes an\nambulance, a fire truck, a police vehicle, or a cardiac arrest\nemergency vehicle;\n\n1.17.3. \"Municipal Service Vehicle\" means any vehicle owned by the\nCorporation or operated by employees of the Corporation and\nshall include any vehicle contracted by the Corporation for the\npurposes of providing municipal services.\n\n2. EXEMPTION\n\n2.1 The provisions of this by-law shall not apply to the following categories of\nvehicles:\n\n2.1.1 emergency vehicles; and,\n\n2.1.2 Municipal Service Vehicles.\n"
    },
    {
      "page_number": 4,
      "text": "By-Law Number 2005-200 Page 4\n\n3. ADMINISTRATION AND ENFORCEMENT\n\n3.1\n\n3.2\n\n3.3\n\n3.4\n\nThe Council of the Corporation hereby appoints and authorizes the\nDirector of Engineering and Public Works to:\n\n3.1.1 administer the provisions of this by-law;\n\n3.1.2 issue permits on behalf of the Corporation;\n\n3.1.3 sign all permits on behalf of the Corporation;\n\n3.1.4 sign the Schedule “C” agreement on behalf of the Corporation;\n3.1.5 limit the time for which a permit is issued;\n\n3.1.6 designate particular highways or parts thereof which may be\n\nused by a permit holder;\n\n3.1.7 impose such other conditions on the permit holder that, in the\ndiscretion of the Director of Engineering and Public Works, are\ndeemed necessary for the protection of persons and property\nfrom injury or damage;\n\n3.1.8 undertake any technical investigation or inspection for the\npurposes of administering this by-law;\n\nThe permits referred to in this section are to grant to an applicant who has\nfiled a written application for the privilege of moving vehicles, loads,\nobjects or structures in excess of weight and size limits as set out in the\nappropriate sections in Part VIII of the Highway Traffic Act, R.S.O., 1990,\nChapter H.8, as amended.\n\nThe Director of Engineering and Public Works is authorized to evaluate an\napplication and may require that the applicant provide a bond or other\nsecurity sufficient to cover the cost of repairing any possible damage to a\nhighway.\n\nThe Director of Engineering and Public Works is authorized to demand\nidentification or any documentary proof from any person making an\napplication for a permit under this by-law.\n\n3.4.1 For the purposes of this by-law, any person refusing to provide\nthe Director of Engineering and Public Works with identification\nor documentary proof at the time of the application shall be\ndeemed to have refused to provide such information.\n"
    },
    {
      "page_number": 5,
      "text": "By-Law Number 2005-200 Page 5\n\n3.5\n\n3.6\n\n3.7\n\nThe Director of Engineering and Public Works may report to Council any\nbreach of the by-law by any permit holder.\n\nThe Council of the Corporation hereby appoints the Officer to enforce the\nprovisions of this by-law including the provisions of Sections 122 and 124\nof the Highway Traffic Act, R.S.O., 1990, Chapter H.8, as amended.\n\nThe Director of Engineering and Public Works and the Officer are\nauthorized to:\n\n3.7.1 demand the permit, identification, vehicle registration or other\ndocument from any owner, permit holder or operator to whom\nthe by-law may apply; and,\n\n3.7.2 inspect any vehicle, load, object or structure and any ledger,\nweight bill or document for which a permit was issued in order to\nverify or confirm the dimensions, weight, destination and type of\nmaterials as provided in the application.\n\n4. OBSTRUCTION\n\n4.1\n\n4.2\n\nNo person shall obstruct, hinder or interfere with the Director of\nEngineering and Public Works or the officer in the lawful performance of\nhis duties.\n\nNo person shall cause the obstruction, hindrance or interference of the\nDirector of Engineering and Public Works or the officer in the performance\nof his duties.\n\n5. PERMIT REQUIRED\n\n5.1\n\n5.2\n\nA permit shall be obtained by every:\n5.1.1 owner, or\n\n5.1.2 operator of any vehicles, loads, objects or structures for the\npurpose prescribed in Section 3.2 of this by-law.\n\nA separate permit shall be obtained by every owner or operator in respect\nof each vehicle, load, object or structure as prescribed in Subsection 3.2\nof this by-law.\n"
    },
    {
      "page_number": 6,
      "text": "By-Law Number 2005-200 Page 6\n\n5.3\n\n5.4\n\n5.5\n\n6.1\n\n6.2\n\n6.3\n\n6.4\n\n6.5\n\nNo person shall operate or cause to be moved an overweight and\noversized vehicle, load, object or structure upon any highway or part\nthereof within the City of Belleville until a permit has been procured by the\nowner or operator to do so.\n\nNo person shall be deemed to have been issued a permit until the Director\nof Engineering and Public Works has issued the permit. An application for\na permit does not constitute a permit.\n\nNo owner, operator or any person shall operate a vehicle or combination\nof vehicles contrary to any conditions of a permit.\n\nAPPLICATIONS\n\nOn the application for a permit, the applicant shall complete the prescribed\nform and shall furnish the Corporation such information, documents and\nother means of identification as the Corporation may direct to be\nfurnished. Such application shall be submitted to the Director of\nEngineering and Public Works.\n\nNo permit shall be issued by the Director of Engineering and Public Works\nunless and until he is in receipt of a non-refundable certified cheque\npayable to the Corporation in the amount of:\n\n6.2.1 the permit fee as set out in Schedule “B’, the “Guidelines for\nCompleting the City of Belleville Oversize/Overweight Permit\nApplication,” attached hereto and forming part of this by-law;\nand,\n\n6.2.2 when applicable, the bond or the security as prescribed in this\nby-law.\n\nThe applicant shall file with the Corporation the duration and routes of the\nequipment and vehicles requiring a permit in order that unnecessary traffic\nhazards or delays are avoided.\n\nA duly executed copy of an agreement as set forth in Schedule ‘C’ of this\nby-law shall accompany each application for a permit.\n\nEach permit shall indicate the date on which it expires.\n"
    },
    {
      "page_number": 7,
      "text": "By-Law Number 2005-200 Page 7\n\n6.6\n\n6.7\n\n6.8\n\n6.9\n\n6.10\n\n6.11\n\nAny permit issued under this by-law shall remain the property of the\nCorporation and such permit is not transferable to any other person except\nbetween an owner of a vehicle and the operator, and is not transferable to\nany other vehicle, load, object or structure.\n\nNo person shall give false or incorrect information for the purposes of\nobtaining a permit. Any omission or misrepresentation by inadvertence or\notherwise that is material to the application, shall render a permit null and\nvoid.\n\nNo person shall refuse to provide information for the purposes of obtaining\na permit.\n\nThe onus of procuring a permit shall be that of the person requiring a\npermit.\n\nEach application for a permit shall be on the prescribed form as set out in\nSchedule ‘A’ to this by-law.\n\nThe applicant shall obtain the written consent of the following persons and\nagencies (as required):\n\n6.11.1 Fire and Emergency Services Department\n\n6.11.2 Belleville Police Service\n\n6.11.3. Veridian Connections\n\n6.11.4 | Hydro One\n\n6.11.5 Bell Canada\n\n6.11.6 | Cogeco Cable\n\n6.11.7 | Canadian Pacific Railway\n\n6.11.8 | Canadian National Railway\n\n6.11.9 — Traffic Technician, Engineering and Public Works Department\n6.11.10 Director of Engineering and Public Works Department\n"
    },
    {
      "page_number": 8,
      "text": "By-Law Number 2005-200 Page 8\n\n7. CONDITIONS FOR ISSUANCE OF A PERMIT\n\n7.1\n\n7.2.\n\nNo permit may be issued by the Director of Engineering and Public Works\n\nunless:\n\n7.1.1\n\nall the appropriate information pertaining to the vehicles, loads,\nobjects or structure has been provided in writing on the\napplication;\n\nsuch further personal history and related information as required\nhas been provided;\n\nthe applicant has supplied proof of property damage and public\nliability insurance for the minimum amount of five million\n($5,000,000) dollars for the term of the permit as well as proof of\ninsurance covering any vehicle requiring such permit;\n\nthe applicant has paid all outstanding fines in respect to this by-\nlaw ordered by a court of competent jurisdiction at any time and\nin any year prior to making the application;\n\nthe owner, operator or permit holder of any such vehicle or\nequipment, who has obtained a permit, is responsible for all\ndamages of whatsoever nature that may be caused by reason\nof the driving, operating or moving of any such vehicle and/or\nequipment;\n\nthe owner, operator or permit holder of any such vehicle, is\nresponsible for all damages whatsoever that may be caused to\nthe highway by reason of the driving, operating or moving of\nsuch vehicles and/or equipment; and,\n\nthe permit may contain any special conditions or provisions that\nin the opinion of the Director of Engineering and Public Works\nmay be deemed necessary for the protection of the public\nand/or the highway.\n\nFailure to comply with the requirements of Subsection 7.1.3 of this by-law\nshall immediately render the permit null and void.\n"
    },
    {
      "page_number": 9,
      "text": "By-Law Number 2005-200 Page 9\n\n8. PERMIT HOLDER'S DUTY\n\n8.1. Every permit holder shall ensure that:\n\n8.1.1\n\n9. OFFENCES\n\nthe original permit is supplied to the operator in order that it may\nbe produced upon demand by the officer;\n\nthe operator of the vehicle used to transport the item for which a\npermit was issued, travels upon the authorized highways only;\n\nthe permit is used for only the item for which it was issued;\n\nthe operator stops when directed to do so by the officer; and,\nthey have read, understood and complied with all the ‘Oversize/\nOverweight Permit Provisions and Conditions’ which form part\n\nof any permit issued and as included as Schedule ‘D’ in this by-\nlaw.\n\n9.1. No permit holder shall:\n\n9.1.1\n\nfail or refuse to produce the permit upon demand;\nuse any unauthorized highway or part thereof;\n\nuse the permit to move any thing other than the item for which\nthe permit was issued;\n\nfail or refuse to stop when directed to do so by an officer;\nfail or refuse to identify himself to the officer;\n\nfail or refuse to produce the motor vehicle registration to the\nofficer; and,\n\nwhen applicable, fail to produce the weigh bill for the current\nload to the officer,\n\nfail to abide by the conditions in the permit.\n"
    },
    {
      "page_number": 10,
      "text": "By-Law Number 2005-200 Page 10\n\n10.\n\n11.\n\n12.\n\nPERMIT HOLDER\n\n10.1\n\nAn owner or operator who operates a vehicle for which a permit is issued\nshall be deemed to be the permit holder.\n\nSUSPENSION / REVOCATION\n\n11.1\n\nThe Director of Engineering and Public Works may revoke any or each of\nthe permits issued for cause and without limiting the generality of the\nforegoing for:\n\n11.1.1 a breach of the law,\n\n11.1.2. any violation of the provisions of this by-law,\n\nThe Director of Engineering and Public Works shall revoke any or each\npermit issued for failure to maintain sufficient liability insurance policies.\n\nThe Director of Engineering and Public Works may suspend a permit for\ncause, during any period that is less than the unexpired portion of the\npermit period in lieu of revocation as provided herein.\n\nThe Director of Engineering and Public Works may suspend for cause any\npermit for a period of four (4) weeks or until the next available meeting of\nCouncil, whichever occurs first, and shall notify the Mayor and Members of\nCouncil of such suspension.\n\nThe provisions of this section may be exercised in addition to any\nprosecution or other legal action.\n\nNo person shall be deemed to acquire a permit if his permit has been\nrevoked in the past.\n\nNOTICE OF SUSPENSION OR REVOCATION\n\n12.1\n\n12.2\n\nWhen a permit has been suspended or revoked, the Director of\nEngineering and Public Works shall send a notice of suspension or\nrevocation by registered mail or personal service to the permit holder at\nhis last known address.\n\nService by registered mail shall be deemed to have been made on the fifth\n(5th) day after the notice was mailed.\n"
    },
    {
      "page_number": 11,
      "text": "By-Law Number 2005-200 Page 11\n\n13.\n\n14.\n\n15.\n\n12.3\n\n12.4\n\nThe notice shall contain details of the reason(s) for the suspension or\nrevocation and shall also contain a paragraph to advise the person that he\nmay appeal the decision by filing an appeal according to the provisions of\nSection 13 of this by-law.\n\nAny person contravening any of the provisions of this by-law while under\nsuspension shall be regarded as though no permit had been issued.\n\nAPPEAL OF SUSPENSION OR REVOCATION\n\n13.1\n\n13.2\n\nAny person whose permit has been suspended or revoked may appeal to\nCity Council within fifteen (15) days immediately following the service of\nthe notice referred to in Section 12 hereof;\n\nCity Council shall, within a reasonable time after receiving an appeal\nnotice, hold a hearing at a place and time convenient to both parties in\norder to afford the person an opportunity to make representation.\n\nSEVERABILITY\n\n14.1\n\nIf a court of competent jurisdiction should declare any section or part of a\nsection of this by-law to be invalid, such section or part thereof shall not be\nconstrued as having persuaded or influenced Council to pass the\nremainder of this by-law and it is hereby declared that the remainder of\nthis by-law shall be valid and shall remain in force.\n\nPENALTIES\n\n15.1\n\n15.2\n\n15.3\n\nAny person who contravenes any provision of this by-law or who operates\na vehicle or combination of vehicles contrary to any conditions of a permit\nis guilty of an offence and upon conviction, is liable to a fine of not less\nthan two hundred ($200) dollars and not more than twenty thousand,\n($20,000) dollars exclusive of costs.\n\nAny person who contravenes any provision of this by-law, for which a\npenalty is provided in this by-law, is guilty of an offence and upon\nconviction, is subject to the penalties provided therefore in this by-law and\npursuant to the provisions of the Highway Traffic Act.\n\nIn addition to imposing a fine, a Court of competent jurisdiction may, upon\nconviction of an offence under this by-law, issue an order prohibiting the\ncontinuation or repetition of the violation by the person convicted.\n"
    },
    {
      "page_number": 12,
      "text": "By-Law Number 2005-200 Page 12\n\n15.4\n\nEvery person who operates or permits the operation of a vehicle or\ncombination of vehicles where the gross vehicle weight exceeds the gross\nvehicle weight allowed under the permit is guilty of an offence and on\nconviction, a fine shall be imposed as if the person had not been issued\nthe permit under this by-law and had been convicted of an offence under\nSection 116, 117 or 118 of the Highway Traffic Act in respect of any gross\nvehicle weight, axle unit weight or axle group weight in excess of the\nmaximum allowable weights under the Highway Traffic Act or the\nregulations.\n\n16. ADMINISTRATION\n\n16.1\n\nTHAT By-Law Number 2004-11 is hereby rescinded and all by-laws or\nparts of by-laws inconsistent with the provisions of this By-Law are hereby\nrescinded.\n\nTHIS BY-LAW SHALL COME INTO FORCE AND TAKE EFFECT IMMEDIATELY ON\nAND AFTER THE PASSING THEREOF.\n\nRead a first time this 14\" day of November, 2005.\n\nRead a second time this 14\" day of November, 2005.\n\nRead a third time and finally passed this 14°\" day of November, 2005.\n\nMARY-ANNE SILLS MAYOR\n\nWAYNE B. TOD CITY CLERK\n\nSCHEDULE “B” - BY-LAW NO. 2005-200\n"
    },
    {
      "page_number": 13,
      "text": "By-Law Number 2005-200 Page 13\n\nSCHEDULE “B” - BY-LAW NO. 2005-200\n\nGUIDELINES FOR COMPLETING THE CITY OF BELLEVILLE\nOVERSIZE/OVERWEIGHT PERMIT APPLICATION\n\nAn oversize/overweight permit allows the movement of oversize/overweight vehicles,\nindivisible loads, objects or structures on City of Belleville roadways which exceed the\nlimits set out in the Highway Traffic Act.\nMAXIMUM WIDTH:\ne Vehicle including load — 2.6 metres\nMAXIMUM LENGTH:\ne Single vehicle including load — 12.5 metres\ne Semi-trailer including load — 14.65 metres\n(Semi-trailer — a vehicle that is towed by another vehicle)\nMAXIMUM LENGTH (COMBINATION):\ne Combination of vehicles and load — 23 metres\nMAXIMUM HEIGHT:\ne Vehicle and load — 4.15 metres\nMAXIMUM WEIGHT:\ne Maximum weight allowances are determined by the axle configurations and\nspacings and gross weights set out in the Highway Traffic Act.\nPERMIT APPLICATION PROCESS:\nApplication forms must be completed in full and may be submitted by fax, e-mail, mail,\n\nor in person at Belleville City Hall, 2\"? Floor, Engineering and Public Works Department,\n169 Front Street, Belleville, Ontario.\n\nIncomplete applications will be returned.\n\n"
    },
    {
      "page_number": 14,
      "text": "By-Law Number 2005-200 Page 14\n\nIf travel is also required on Provincial Highways, please contact the Ontario Ministry of\nTransportation (MTO) to receive the necessary permit.\n\n./2\nThe applicant requires a number of “Authorized Signatures” as follows:\n\nAUTHORIZATION SIGNATURES LOCATIONS\nAll signatures to be in place prior to issuance of moving permit.\n\nDirector of Engineering and Public Works\nCity Hall\n\n169 Front St, 2\" Floor\n\nBelleville, ON K8N 2Y8\n\nPhone: 613-967-3200 Ext. 3261\nFax: 613-967-3262\n\nDepartment of Engineering & Public Works\nPublic Works Yards/Traffic Technician\n\n75 Wallbridge Crescent\n\nPhone: 613-967-3200 Ext. 3266\nFax: 613-968-3913\n\nBelleville Fire and Emergency Services Department\n72 Moira Street West\n\nPhone: 613-962-2010\n\nFax: 613-969-7047\n\nBelleville Police Services\n\n94 Dundas Street East\n\nPhone: 613-966-0882\nFax: 613-966-2701\n\nBell Canada (Belleville)\n\nEngineering Department/Larry Mussio\n75 Bridge Street East\n\nPhone: 613-966-3573\nFax: 613-968-5286\n\nCanadian National Railway\n\nDivision Engineering/Rui Ribeiro\n\n4 Welding Way, off 1 Administration Rd\nConcord, ON L4K 1B9\n\nPhone: 905-669-3373\nFax: 905-760-3406\n"
    },
    {
      "page_number": 15,
      "text": "By-Law Number 2005-200 Page 15\n\nCanadian Pacific Railway\nMichael Stilwell\nToronto, ON\nPhone: 416-297-3026\nFax: 416-\n.. 3\n\nCogeco Cable\nTechnical Operations/John Porter\n\nPhone: Belleville - 613-967-9751 Ext. 24\nPhone: Kingston - 613-544-6311 Ext 8509\nFax: Belleville - 613-966-5329\n\nHydro One (Belleville)\n\n171 Centre Street\n\nPhone: 1-866-646-4619\nFax: 613-967-3582\n\nVeridian Connections (Hydro) (Belleville)\n\nPeter Hoekstra\n\n459 Sidney St (Corner of Sidney & College St West)\nPhone: 613-966-1235 Ext. 2275\n\nFax: 613-966-5256\n\nCONSIDERATION OF PERMIT ISSUER:\nIn reviewing applications consideration is given to a number of factors, including:\n\nComplete application.\n\nEffect of proposed move on the safety and convenience of other road users.\nEffect on existing public infrastructure.\n\nKnown physical characteristics of proposed route.\n\nDoes the application involve the relocation or movement of a building?\nLikely traffic conditions at the time of move.\n\nAny special events during the proposed time of move.\n\nDistance and length of time of move.\n\nCan loads be reduced in size and/or weight (alternate configurations)?\n\nIs a Traffic Management Plan required for exceptional moves?\n\nTYPES OF PERMITS:\n\nThe City of Belleville issues three (3) types of permits: Annual, Seasonal, and Single\ntrip.\n"
    },
    {
      "page_number": 16,
      "text": "By-Law Number 2005-200 Page 16\n\nAnnual Permits -\nAnnual permits are valid for a period of twelve (12) months from the date of issuance.\n\nAnnual permits can be considered for vehicles with the following maximum dimensions:\n\nLength: 12.5 metres\nWidth: 3.7 metres\nHeight: 4.26 metres\n\n4\nSeasonal Permits -\n\nSeasonal permits are issued to allow operators to move similar loads,\nvehicles, over the same route for a period of up to and including six (6)\nmonths.\n\nSingle Trip Permits -\n\nA single trip permit is issued to facilitate an oversize/overweight move for\na one (1) way trip along a specified route for a limited time period:\n\nLength: - Combination vehicles from 23m to 45.75 metres\n- Single vehicle 12.5 metres\nWidth: From 2.61m to 4 metres\nHeight: 4.16 metres or greater\nWeight: If Highway Traffic Act limits are exceeded, may\n\nrequire additional conditions at Director of\nEngineering and Public Works discretion.\n\nPermit Fees -\nAnnual Permit: $200.00\nSeasonal Permit: $150.00\nSingle Trip Permit: $ 75.00\nPermit Replacement: $ 15.00\nNIGHT MOVES:\n\nNight moves are generally not permitted within the City of Belleville. In addition, no\ntravel is allowed when road conditions, weather conditions, or visibility make traveling\nhazardous to the operator or to the driving public. If inclement weather occurs while the\nmove is under way, operators shall at the first opportunity park in a safe place (clear of\nthe traveled portion of the roadway) until the weather and road conditions clear.\n\nFLAGS, SIGNS, AND MARKINGS:\n"
    },
    {
      "page_number": 17,
      "text": "By-Law Number 2005-200 Page 17\n\nVehicles and/or loads in excess of the Highway Traffic Act legal dimensions require\nspecial flags, signs, and markings. Any vehicle/load receiving an oversize/overweight\npermit from the City of Belleville must conform to the requirements for vehicle and/or\nload marking provisions contained with the Highway Traffic Act.\n\nESCORT REQUIREMENTS:\n\nA permit may be issued on the condition that the permit holder provides an escort\nvehicle(s).\n\nHeight: 4.15 metres and greater Escort required\n\nWidth: 2.61m to 3.99m No escort required\n4.00m to 4.99m Private escort required\n5.00m and greater Police escort required\n\nLength: 23.01m to 36.75m No escort required\n36.76m to 45.74m Private escort required\n45.75m and greater Police escort required\n\nWeight: All loads/vehicles must conform to the legal restrictions of the\n\nHighway Traffic Act.\n\nThere may be other occasions where private and/or police escort is warranted,\nparticularly where major intersections will be disrupted for a lengthy period.\n"
    },
    {
      "page_number": 18,
      "text": "By-Law Number 2005-200 Page 18\n\nSCHEDULE “A”\nTO BY-LAW NUMBER 2005-200\n\nCITY OF BELLEVILLE\nOVERSIZE/OVERWEIGHT PERMIT APPLICATION\n\n1. Application for: City of Belleville Use Only\n] Annual TRenewal\nFee $\n] Seasonal ] Replacement\n] Single Trip ] Amendment Permit #\nPrevious Permit No. Y M D\nDate\nMethod of Payment ] Cash | Certified Cheque\n2a). Applicant Information\nC.V.O.R. No.\nPied de std 4\nLast Name, First Name, or Company Name (per Articles of Incorporation)\nAddress City Province Postal\nCode\nTelephone No. Cell Phone No. Fax No. Contact Name\n2b). Moving Firm (If different than applicant)\nLast Name, First Name, or Company Name (per Articles of Incorporation)\nAddress City Province Postal\n\nCode\n\nTelephone No. Cell Phone No. Fax No. Contact Name\n\n"
    },
    {
      "page_number": 19,
      "text": "By-Law Number 2005-200 Page 19\n\n3. Proposed Movement Information\nY M D Y M D\nStart Date I / End Date / /\n\nOrigin — Street Address, City, Province\n\nDestination — Street Address, City, Province\n\nContracted Destinations for Equipped Vehicle (i.e. snowplow)\n\nCity Streets (Route) to be Travelled in Order\n\n4. Is This Request to:\n\n] Carry ] Tow TMove a Self-Propelled Vehicle ] Move a Building\n\n5. What is Being Moved:\nLoad Description\n\nLoad Measurements\n\nLength m Width m Height m Weight kg\n\n6. Overall Dimensions of Vehicle or Vehicle/Equipment Combination\n\nOverall Width at Height at\nCombined Length m_ Widest Point m Highest Point m\n"
    },
    {
      "page_number": 20,
      "text": "By-Law Number 2005-200\n\nGross Weight ] *HTA( Mark X in or\nBox if Legal Weight)\n* Highway Traffic Act\n\n7. Insurance\n\nName of Insurance Company:\n\nPage 20\n\nkg.\n\nProperty Damage $ —\n(Minimum required $5,000,000)\n\nPublic Liability $\n(Minimum required $5,000,000)\n\n"
    },
    {
      "page_number": 21,
      "text": "By-Law Number 2005-200 Page 21\n\n8. Authorized Signatures\n\nFire and Emergency Services Department:\n\nBelleville Police Services:\n\nTraffic Technician, Engineering and Public Works Department:\n\nVeridian Connections:\n\nHydro One:\n\nBell Canada:\n\nCogeco Cable:\n\nCanadian Pacific Railway:\n\nCanadian National Railway:\n\nDirector of Engineering and Public Works Department\n\n9. Declaration\n\nWe understand that under the provision of Section 7 of the City of Belleville By-Law\nNumber 2005-___, the owner, operator or permit holder of a heavy vehicle, load, object or\nstructure who has obtained a permit is nevertheless responsible for all damage that may be\ncaused to the highway, overhead wires/fiber optics, property, persons, encroachments, or\nrailway right of way by reason of the driving, operating or moving of any such heavy vehicle,\nload, object or structure. The applicant certifies that the information contained in this application\nis true and acknowledges and accepts the responsibilities imposed by law on the applicant in\nrelation to the operation of a commercial motor vehicle under the authority of the permit issued\npursuant to this application. Permit is invalid if false information is given.\n\nName (Please Print) Signature of Authorized Applicant\n\nY M D\n\nPosition/Title Date\n\nCITY OF BELLEVILLE USE ONLY\n\nSpecial Comments\n\n"
    },
    {
      "page_number": 22,
      "text": "By-Law Number 2005-200 Page 22\n\nSCHEDULE “C”\n\nTO BY-LAW NO. 2005-200\n\nTHIS AGREEMENT made on this day of , 2005\n\nBETWEEN:\n\n(Hereinafter called the “Applicant”)\n\nAND\n\nTHE CORPORATION OF THE CITY OF BELLEVILLE\n\n(Hereinafter called the City)\n\nWHEREAS the Applicant has applied to the City to drive\n\nover the highways in the City of Belleville\n\nNOW THEREFORE in consideration of the City issuing a permit to the Applicant for the\nuse of a highway or part thereof by a vehicle in excess of the dimensional limits as set\nout in the Highway Traffic Act, or the weight limits prescribed by said Act, the Applicant\nagrees as follows:\n\n1.\n\nThe Applicant and/or any employees of the Applicant undertake to the City to use\nall due care and attention in the operation of the vehicle and/or equipment and\nundertake to take into consideration the condition of the highway or part thereof\nover which any vehicles and equipment will be driven, and to take all necessary\nmeans to avoid any loss or injury to others as the result of the use of the vehicles\nand/or equipment.\n\nThe Applicant and/or any employees of the Applicant undertake that all work\nshall be carried out with all possible diligence and dispatch in a proper and\nworkmanlike manner, and in accordance with any requirements of the Director of\nEngineering and Public Works.\n\nThe Applicant and/or any employees of the Applicant will carry out all work at\ntheir own risk and expense and hereby release the City of and from any claims\nthat may arise, whether by reason of his negligence or by reason of any\nnegligence on the part of the City (its employees, workmen or others for which\nthe City may be responsible), and in any event, will make no claims against the\n"
    },
    {
      "page_number": 23,
      "text": "By-Law Number 2005-200 Page 23\n\nCity for any reason whatsoever.\n\n./2\n\n4. The Applicant shall indemnify and hold harmless the City from and against all\n\nloss, costs and damages suffered by it and from all actions or claims which may\n\nbe brought or made against the City by reason of the carrying out, or attempted\ncarrying out, of the said work over the said streets of the City.\n\n5. The Applicant shall file proof of liability insurance in the amount of $5,000,000.00\nand shall file proof of automobile insurance covering the vehicle prior to\nundertaking the work and operating the vehicle.\n\n6. It is agreed that, on failure of the Applicant to carry out the provisions of this\n\nAgreement, the permission granted may be withdrawn or cancelled without\nnotice.\n\nIN WITNESS WHEREOF the Applicant has hereunto set his hand and seal.\n\nSIGNED, SEALED AND DELIVERED\nIn the presence of\n\n)\n\nWitness )\n) THE CORPORATION OF THE\n) CITY OF BELLEVILLE\n)\n) Per:\n\nWitness ) Rick A. Kester\n)\n\nDirector of Engineering and Public Works\n"
    },
    {
      "page_number": 24,
      "text": "By-Law Number 2005-200 Page 24\n\nSCHEDULE “D”\nTO BY-LAW NUMBER 2005-200\n\nOVERSIZE/OVERWEIGHT PERMIT\nPROVISIONS AND CONDITIONS\n\n. Notwithstanding any of the provisions of this permit, the Belleville Police Services or the\nCity of Belleville may change or cancel this permit and may cause the vehicle(s) and load\nto be removed from the roadway due to congestion or hazardous conditions being\nencountered as a result of the unit being on the road, and may require the operator to wait\nfor an escort to continue the move.\n\n. The applicant will satisfy themselves as to the suitability of the approved route for the\nproposed movement. No representations are made by municipal authorities as to the\nclearances and capacities involved therein. The applicant shall verify for themselves all\nstructure clearance heights and widths, on site, forty-eight (48) hours prior to move.\n\n. In consideration of the issuance of this permit and other good and valuable consideration,\nthe applicant, their heirs, executors, administrators, or assigns, hereby agree to indemnify\nand save harmless, the City of Belleville from any action, claim, damages, costs (including\nlegal costs) or loss whatsoever, arising from operations carried out under this permit.\n\n. The applicant shall show proof of having obtained a building permit where applicable for the\nmovement of buildings. Buildings moved from within the City of Belleville must have sewers\ncapped and be inspected by the City’s Building/Plumbing Inspector. Applicant must give a\nminimum of twenty-four (24) hours written notice to the City’s Development Services\nDepartment prior to commencing the move.\n\n. The applicant may be required to file a bond and/or certified cheque with this application in\nsuch an amount as at the discretion of the City of Belleville, utility, or railroad, as deemed\nnecessary to cover the cost of facilitating the move and of repairing any damages resulting\ntherefrom.\n\n. All authorized signatures of the City of Belleville and the agencies indicated as required on\nthis permit shall be obtained before this permit is considered to be valid.\n\n. Any violations of this permit, or the provisions and conditions therein, may result in the\npermit being cancelled.\n\n./2\n"
    },
    {
      "page_number": 25,
      "text": "By-Law Number 2005-200 Page 25\n\nThis permit shall accompany the vehicle for which it is issued. In the case of\nmulti-vehicle permits, a copy of the permit and supplemental list of vehicles shall\naccompany each vehicle. The permit and all attachments shall be produced upon\nrequest of the officer.\n\nThis permit is not valid at any time from one-half hour after sunset, to one-half\nhour before sunrise, or at any other time when, due to insufficient light, or\nunfavourable atmosphere conditions, persons and vehicles on the highway are\nnot clearly discernable at a distance of 150 metres or less, or from Monday to\nFriday inclusive during the hours of 6:30 a.m. - 9:00 a.m., and 4:00 p.m. — 6:00\np.m.\n\nAny vehicles and/or loads exceeding the legal width, length or weight limits\nidentified in the Highway Traffic Act must be flagged, signed and/or marked as\nper the requirements of the Highway Traffic Act.\n\nThis permit is issued on condition the permit holder accepts responsibility for any\nand all damage(s) that may be caused to overhead wires, fibre optic cables,\nstructures, roads, encroachments, railways or any other public or private property\nas a result of the move.\n\nThe permit holder must comply with all other requirements of the Highway Traffic\nAct.\n\nThis permit is valid only on roadways under the jurisdiction of the City of\nBelleville.\n\nDuring the term of this permit, the permit holder may encounter construction\nzones where clearances may be reduced. The permit holder is responsible for\nobtaining any route amendment that may be necessary due to construction\nactivities.\n"
    }
  ]
}