{
  "file_name": "BL 2011-59 A Bylaw to Establish and Regulate a Fire Department and Emergency Services.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\n\nBY-LAW NUMBER 2011-59\n\nBEING A BY-LAW TO ESTABLISH AND REGULATE A FIRE DEPARTMENT AND\nEMERGENCY SERVICES\n\nWHEREAS Section 2 and Section 5(0.1) of the Fire Protection and Prevention Act,\n1997, S.O. 1997, c.4, as amended requires municipalities to provide fire protection\nservices and permits a municipality to establish, maintain and operate a Fire\nDepartment;\n\nAND WHEREAS Sections 8(1) and 9 of the Municipal Act, 2001, S.O. 2001, c.25, as\namended provides that a municipality has the capacity, rights, powers and privileges of\n\na natural person for the purposes of exercising its authority and governing its affairs as\nit considers appropriate;\n\nNOW, THEREFORE, the Council of the Corporation of the City of Belleville enacts as\nfollows:\n\nDEFINITIONS\n1. In this By-law, unless the context otherwise requires:\n(a) City means the Corporation of the City of Belleville.\n(b) | Council means the Council of the Corporation of the City of Belleville.\n\n(c) Collective Agreement means the contractual agreement in place\ngoverning the employment conditions between the Members and the City\n\nof Belleville.\n\n(d) Deputy Fire Chief means the person appointed by by-law by Council to .\nact in the place of the Fire Chief in his or her absence or in the case of a\nvacancy in the position of Fire Chief.\n\n(e) Fire Chief means the person appointed by by-law by Council pursuant to\nSection 6(1) of the Fire Protection and Prevention Act.\n\n(f) Fire Department or Department means the City of Belleville Fire and\nEmergency Services.\n\n(g) Fire Protection Services includes the programs designed to protect the\nlives and property of the City of Belleville from adverse affects of fire,\n"
    },
    {
      "page_number": 2,
      "text": "medical emergencies, water rescue or exposure to dangerous conditions\nand includes fire suppression, fire prevention, fire safety education,\ncommunication, training of persons involved in the provision of fire\nprotection services, rescue and emergency services and the delivery of all\nof those services.\n\n(h) Member means any person employed in, or appointed to the Fire\nDepartment and assigned to undertake fire protection services and\nincludes officers and full-time/volunteer fire fighters.\n\n(i) Specialized Emergency Responses means water rescue and medical\n\nassist and specialized rescue as determined by Council.\n\n(j) Volunteer Fire Fighter means a person who provides fire protection\nservices either voluntarily or for a nominal consideration, honorarium,\ntraining or activity allowance.\n\nFIRE DEPARTMENT\n\n2.\n\nA Fire Department for the City to be known as the City of Belleville Fire and\nEmergency Services is hereby continued and the head of the Department shall\nbe known as the Fire Chief and Director Fire and Emergency Services.\n\nThe provisions of this By-law are subject to the provisions of the Fire Protection\nand Prevention Act, and all other applicable Acts or By-laws and to all provisions\nof the Collective Agreements between the City and the Fire Fighters as altered or\namended by the parties from time to time.\n\nin addition to the Fire Chief, the Members of the Fire Department shall consist of\nsuch persons as from time to time may be deemed necessary by Council.\n\nThe Fire Department shall be comprised of the following Divisions:\n\n(a) . Emergency Services, including administration, suppression and other\nemergency services;\n\n(b) Support Services, including prevention, public education, training,\ncommunications and risk management.\n\nEach division or component of a division of the Fire Department is under the\nresponsibility of the Fire Chief or a member designated by him or her.\nDesignated members shall report to the Fire Chief on activities under their\nsupervision and shall carry out ail orders of the Fire Chief.\n"
    },
    {
      "page_number": 3,
      "text": "Where the Fire Chief or Deputy Chief designates a member to act in place of an\nofficer in the Fire Department, such member, when so acting, has all the powers\nand shall perform all the duties of the officer replaced.\n\nThe Fire Chief may authorize the appointment of any qualified person as a\nmember of the Fire Department subject to the approved hiring policies .of the\nCity.\n\nDUTIES OF FIRE CHIEF\n\n9.\n\nThe Fire Chief is responsible for the proper administration and operation of the\nFire Department and for the efficiency and discipline of its Members and;\n\n(a) shall perform or supervise the performance of the general administrative\nduties of the Fire Department;\n\n(b) shall make such general orders, rules and regulations and systems as\nmay be necessary for the care and protection of the property of the Fire\nDepartment, for the conduct of the Members and generally for the efficient\noperation of the Fire Department, provided that such general orders and\nrules do not conflict with the provisions of any by-laws of the City;\n\n(c) shall review periodically the policies and procedures, orders, rules and\nguidelines of the Fire Department and may establish an advisory\ncommittee consisting of such Members as the Fire Chief may determine\nfrom time to time to assist in these duties;\n\n(d) shall ensure that all proper measures for life safety education and fire\nprevention are taken;\n\n(e) shall ensure that the following services are provided: Fire Code\nInspections,. Routine Inspections, and Fire Cause Determination &\nInvestigation, and Fire & Rescue Training;\n\n(f) shall ensure that all proper measures for the prevention, contro! and\nsuppression of fires and for the protection of life and property are taken;\n\n(g) shall enforce all municipal by-laws respecting fire prevention and exercise\nthe powers and duties imposed on him/her by the Fire Protection and\nPrevention Act, 1997 and this By-law; :\n\n(h) — shall, as required by Council, submit the annual budget estimates for the\nFire Department;\n"
    },
    {
      "page_number": 4,
      "text": "10.\n\n4\n\nmay liaise with the office of the Fire Marshal of Ontario and any other\noffice or organization considered necessary or advisable;\n\nshall report to Council, through the Chief Administrative Officer or in\nhis/her absence, to his/her delegate for proper administration and\n\noperation of the Fire Department including the delivery of fire protection\n\nservices.\n\nThe Fire Chief and his/her designates are authorized and empowered to:\n\n(a)\n(b)\n(c)\n\n(d)\n\n(e)\n\n(h)\n\n(i)\n\nconduct fire prevention inspections of premises;\nenforce fire prevention by-laws;\n\nexamine building plans of new construction for fire related issues in\ncoordination with the building services;\n\nprovide personnel for fire prevention lectures and public education related\nto fire safety;\n\nact as liaison with the Environmental Operational Services Department for\nthe City in order to ensure an adequate flow of water in new water works\nprojects and the adequate maintenance of existing water works facilities\nfor the use of the Department;\n\nreprimand, suspend or recommend dismissal of any member for\ninsubordination, misconduct, or for non-compliance with any of the\nprovisions of this By-law, general orders, departmental rules, guidelines or\npolicies that in the opinion of the Fire Chief would be detrimental to the\ndiscipline and efficiency of the department providing such activities are in\naccordance with the Collective Agreement and the process established\ntherein.\n\nevaluate all Members for competency and to require such courses and\ntraining or written, oral and practical examinations as may be required for\nthe efficient operation of the Department;\n\npull down or demolish of any building or structure when considered\nnecessary to prevent the spread of fire or necessary for the safety of the\npublic;\n\nrequest other persons present at a fire to assist in extinguishing fires,\npulling down or demolishing buildings or structures to prevent the spread\nof fire and assisting in crowd control and traffic control or suppressing fires\nor other hazardous conditions in other reasonable ways;\n"
    },
    {
      "page_number": 5,
      "text": "411.\n\n(k)\n\n(!)\n\n(m)\n\n(n)\n\ntake all necessary actions including the boarding up or barricading of\nbuildings or property to guard against fire or other danger, risk or accident,\nwhen unable to contact the property owner;\n\nrecover expenses incurred by such necessary actions for the City in the\nmanner provided through the Municipal Act, 2001 and the Fire Protection\nand Prevention Act;\n\nperform rescue and salvage operations and render first aid and other\nemergency pre-hospital care responses such as defibrillation, CPR,\noxygen therapy;\n\nrespond to specialized rescues including performing confined space\nrescue in accordance with skill level and training provided, extrication\nusing hand tools, air bags and heavy hydraulic tools as required, and\nwater/ice rescue services with such response decisions being based upon .\nan ascending scale of risk applicable to the life safety circumstances;\n\nprovide Hazardous Material Response at the awareness level but may in\naddition provide the following specific services including the application\nand use of absorbent pads, booms and other containment devices during\nsituations whereby the use of these items does not endanger fire fighters\nor emergency workers beyond the normal risk associated with a\nhazardous material first responder level response.\n\nFIRE DEPARTMENT RESPONSE OUTSIDE OF CITY LIMITS\n\nThe Fire Department shall not respond to a call with respect to an emergency\noutside the limits of the Municipality except with respect to a fire or emergency:\n\n(a)\n\n(b)\n\n(c)\n\nthat in the opinion of the Fire Chief threatens property in the City or\nproperty situated outside the City that is owned or occupied by the City;\n\nin a Municipality with which an agreement has been entered into to\nprovide fire protection services; or\n\non property with respect to which an agreement has been entered into\nwith any person or corporation to provide fire protection services;\n\non property in respect of which the Fire Chief determines that immediate\naction is necessary to protect life and/or property, in which case the Fire\nDepartment will provide fire and emergency services on the site until the\ndesignated Fire Department arrives and command and control of the\nsituation is transferred.\n"
    },
    {
      "page_number": 6,
      "text": "12.\n\n13.\n\nif any section, clause or provision of this By-law, including anything contained in\nthe Schedules attached hereto, is for any reason declared by a court of\ncompetent jurisdiction to be invalid, the same shall not affect the validity of this\nBy-law as a whole or any part thereof other than the section, clause or provision\nso declared to be invalid and it is hereby declared to be the intention of Council\nfor the City that all remaining sections, clauses or provisions of this By-law shall\nremain in full force and effect until repealed, notwithstanding that one or more\nprovisions thereof may have been declared invalid.\n\nBy-law No. 3552 of the former Township of Thurlow and By-law No. 3563 of the\nformer City of Belleville and all by-laws or sections thereof of either former\nmunicipalities which are inconsistent herewith are hereby repealed in their\nentirety.\n\nTHIS BY-LAW SHALL COME INTO FORCE AND TAKE EFFECT UPON ITS FINAL\nPASSAGE. ;\n\nRead a first time this 11th day of April, 2011.\n\nRead a second time this 11th day of April, 2011.\n\nRead a third time and finally passed this 11th day of April, 2011.\n\nC. ORAM, CITY CLERK\n"
    }
  ]
}