{
  "file_name": "BL 2019-183 A Bylaw to Impose Water and Sanitary Sewer Connection Charges - Urban Service Area.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\nBY-LAW NO. 2019-183\n\nBEING A BY-LAW TO IMPOSE WATER AND SANITARY SEWER\nCONNECTION CHARGES TO RECOVER THE CAPITAL COST OF\nINSTALLING WATER AND/OR SANITARY SEWER WORKS IN THE URBAN\nSERVICE AREA\n\nWHEREAS the City of Belleville has determined it to be in the public interest to\nconstruct certain water and/or sanitary sewer works within portions of the Urban\nService Area;\n\nAND WHEREAS the Council is authorized by s. 391 of the Municipal Act, 2001,\nS.O. 2001, c.25 as amended, to impose fees or charges upon persons owning\nland who derive or will derive a benefit from the provision of municipal services\nsuch as the municipal construction of water and/or sanitary sewer works\nsufficient to pay all or such portion of the capital costs of the works as Council\ndeems appropriate;\n\nAND WHEREAS the lands to be benefited and charged with charges for the\nconstruction of municipal water and/or sanitary sewer works are lands within the\nUrban Service Area;\n\nNOW THEREFORE, the Council of the City of Belleville enacts as follows:\nDefinitions\n1. In this By-Law:\n\na. “benefit” means the benefit to an Owner of a Lot within the Urban\nService Area of connecting to municipal Water Works and/or\nSanitary Sewer Works installed adjacent to the Owner's Lot;\n\nb. “Capital cost” means the cost of constructing Water Works and/or\nSanitary Sewer Works, inclusive of all items of cost usually and\nproperly chargeable to a capital account, and where applicable, the\ninterest amounts payable on the debentures to be issued for such\nworks;\n\nc. “City” shall mean the Corporation of the City of Belleville;\n\nd. “Connection Charge(s)” means the charge(s) imposed in\naccordance with the provisions of this By-Law for connecting to\nWater Works and/or Sanitary Sewer Works provided or done by or\non behalf of the City;\n"
    },
    {
      "page_number": 2,
      "text": "By-law Number 2019-183 2\n\ne. “Council” shall mean the Council of the Corporation of the City of\nBelleville;\n\nf. “Dwelling Unit” means a suite operated as a housekeeping unit,\nused or intended to be used as a domicile by one or more persons\nand usually containing cooking, eating, sleeping and sanitary\nfacilities;\n\ng. “Gross floor area” means the total area of all building floors above\nor below grade measured between the outside surfaces of the\nexterior walls, except for:\n\n(a) | aroom or enclosed area within the building or structure\nabove or below that is used exclusively for the\naccommodation of heating, cooling, ventilating, electrical,\nmechanical or telecommunications equipment that service\nthe building;\n\n(b) loading facilities above or below grade; and\n\n(c) a part of the building or structure below grade that is used for\nthe parking of motor vehicles or for storage or other\naccessory use;\n\nh. “Lot” shall mean a parcel of land under distinct and separate\nownership from adjoining lands and being separately assessed\naccording to the most current assessment roll at the time the\nConnection Charge(s) is due and payable in accordance with the\nprovisions of this By-Law;\n\ni. “Notice” means the notice issued by the City that Connection\nCharge(s) are payable, and that Private Service Connections are\nrequired in accordance with the provisions of this By-Law;\n\nj. “Owner” means the registered owner of a Lot;\n\nk. “Private Service Connection(s)” means and includes the services,\npipes, fixtures, facilities, or things located on private property to be\nused for the purpose of supplying any Lot in the Urban Service\nArea with Water Works and/or Sanitary Sewer Works;\n\n|. “Sanitary Sewer Works” means any public works for the collection,\ntransmission, treatment or disposal of sewage, or any part of any\nsuch works;\n\nm. “Single Detached Dwelling” means the whole of a building\ncontaining one Dwelling Unit only;\n\nn. “Urban Service Area” means that area within the City shown as\n“Urban Service Area” on Schedule “B” of this By-Law.\n"
    },
    {
      "page_number": 3,
      "text": "By-law Number 2019-183 3\n\no. “Water Works\"” means any public works for the collection,\nproduction, treatment, storage, supply, or distribution of water, or\nany part of such works;\n\np. “Works” means the Water Works and/or Sanitary Sewer Works.\n\nConnection Charges Imposed\n\n2. Connection Charges calculated in accordance with the provisions of this\nBy-Law are hereby authorized.\n\n3. Upon completion of the construction of a Water Works and/or Sanitary\nSewer Works project within the Urban Service Area, the Connection\nCharges authorized by and calculated in accordance with the provisions of\nthis By-Law shall be established for each Lot serviced or capable of being\nserviced by the Water Works and/or Sanitary Sewer Works. The\napplicable Connection Charge(s) shall be payable as set out in the\nprovisions of this By-Law.\n\n4. When the City determines it is advisable to impose the applicable\nConnection Charges, the City shall issue a Notice to the Owner(s) of each\nand every Lot serviced or capable of being serviced by the Water Works\nand/or Sanitary Sewer Works advising that each such Owner shall have a\nperiod of up to ten (10) years from the date of the Notice to construct and\ninstall at the Owner's sole expense a Private Service Connection(s) to\nconnect to the Water Works and/or Sanitary Sewer Works, failing which\nsuch connection(s) to the Water Works and/or Sanitary Sewer Works (as\nthe case may be) shall become mandatory and in such event the\nprovisions of Paragraphs 16 and 17 of this By-Law shall apply.\n\n5. The Notice shall also provide that each such Owner shail pay the\napplicable Connection Charge(s) within ninety (90) days of the date of the\nNotice or select the option of paying the applicable Connection Charge(s)\non an installment basis, as set out in Paragraph 12 of this By-Law.\n\n6. Every Owner of a Lot who receives a Notice pursuant to this By- Law shall\nfully comply with such Notice and the requirements of this By- Law.\n\n7. The Connection Charge(s) imposed by this By-Law are not development\ncharges as defined in the Development Charges Act, 1997, c.27 and its\nregulations as implemented under By-Law No. 2016-18, as amended.\n\n8. Every Connection Charge(s) imposed by this By-Law constitutes a debt of\nthe Owner of the Lot to the City. The Treasurer of the City may add the\nConnection Charge(s) imposed by this By-Law to the tax roll for such\nOwner's Lot.\n"
    },
    {
      "page_number": 4,
      "text": "By-law Number 2019-183 4\n\nCalculation of Connection Charge(s)\n\n9. Subject to the provisions of this By-Law, Connection Charge(s) against a\nLot shall be imposed, calculated, and collected in accordance with the\nrates set out in Schedule “A” to this By-Law.\n\n10. The Connection Charge(s) with respect to the use of any land, buildings or\nstructures shall be calculated as follows:\n\na. In the case of a single detached dwelling, the amounts set out in\nSchedule “A”, Table 1.\n\nb. In the case of all other buildings or structures to be connected to\nthe Waterworks and/or Sanitary Sewer Works, the Connection\nCharge(s) shall be calculated as the product of the gross floor area\nof such building or structure multiplied by the corresponding total\namount for such gross floor area, as set out in Schedule “A”, Table\n2.\n\n11.The City shall estimate the gross floor area based on information available\nto it including but not limited to MPAC assessment data and building files.\nIn the event the Owner disputes the gross floor area calculation, the\nOwner may provide to the City a gross floor area calculation supported by\nbuilding plans (certified by a registered building practitioner under the\nBuilding Code Act, an Ontario Land Surveyor or an architect or\nprofessional engineer duly licensed in the Province of Ontario) to the\nsatisfaction of the City as the basis for seeking an adjusted calculation.\n\nPayment Options\n\n12. Every Owner who is liable for a Connection Charge(s) as provided herein\nshall:\n\na. have the option, up to and including ninety (90) days from the date\nof the Notice from the City, to commute the applicable Connection\nCharge(s) by making a single cash payment to the City in the full\namount of the Connection Charge(s). Such Owner must make the\nsingle cash payment on or before the said ninety (90) days, failing\nwhich the person will be deemed to have selected the installment\npayment option described in subparagraph b. below; or\n\nb. Default to the option of paying the full cost on an installment basis\nover a ten (10) year period following the date set out in in the\nNotice provided to such Owner pursuant to the provisions of this\nBy-Law. Under this option, an interest rate equal to the City’s\ninternal borrowing rate shall be payable and shall be applied to the\nprincipal amount. The installment and interest amount shall be\nadded to the tax account of the Owner and shall be due on normal\n"
    },
    {
      "page_number": 5,
      "text": "By-law Number 2019-183\n\ntax due dates. Provided that an Owner may pay the total\noutstanding balance (which shall inciude all applicable interest) in\nfull at any time.\n\nProcess for Obtaining a Connection\n\n13. Every Owner affected by the provisions of this By-Law shall be\nresponsible, at his, her or its own cost, to install a Private Service\nConnection(s) sufficient to properly connect to the Water Works and/or\nSanitary Sewer Works.\n\n14.Connections to the Water Works and/or Sanitary Sewer Works shall be\n\nmade at the same time as the construction and installation of the Private\n\nService Connection(s). Where Water Works and/or Sanitary Sewer Works\nhave been installed to service a Lot, the Owner shall be required to\nconnect to both the Water Works and Sanitary Sewer Works.\n\n15.Lot Owners shall be solely responsible for all costs and liability for making\nthe Private Service Connection(s) from the street line containing the\nWorks to the buildings/structures on the Lot.\n\n16.In accordance with the provisions of Section 436 of the Municipal Act,\n2001 S.O. 2001, Chapter 25 as amended from time to time, the City may\nenter on any Lot or land at any reasonable time for the purpose of carrying\nout an inspection to determine whether or not the requirements of this By-\nLaw have been complied with.\n\n17. Where the Owner of a Lot has:\n\na. failed to install the Private Service Connection(s) as required by this\nBy-Law, or;\n\nb. failed to disconnect a septic system and or well as required by this\nBy-Law; or\n\nc. has failed to comply with any requirement of this By-Law\n\nthe City may, at any reasonable time, in accordance with the provisions of\nSection 446 of the Municipal Act, 2001 S.0. 2001, Chapter 25 as\namended from time to time, enter onto the Lot and into buildings,\nincluding dwelling units, for the purpose of making any such connection\nand/or disconnection required under this By-Law, and the cost of such\nconnection and/or disconnection shall be at the expense of the Owner\nand recoverable on the tax roll of the Lot.\n\n18.Where a Notice has not been issued but Water Works and/or Sanitary\nSewer Works are available, the process for obtaining a connection to the\nWater Works and/or Sanitary Sewer Works shall be as follows:\n"
    },
    {
      "page_number": 6,
      "text": "By-law Number 2019-183 6\n\na. a person may make written application to the City upon the\nappropriate form, showing the purposes for which the service is\nrequired. Such application shall be signed by the Owner of the Lot\nto be supplied with the service, or by his or her agent duly\nauthorized in writing;\n\nb. the Owner shall, prior to the City’s approval of any such request,\nexecute an agreement with the City agreeing that the Owner shall\nbe subject to all provisions of this By-Law and such other matters\nas Council requires; and\n\nc. the Owner of each Lot to be serviced by the connection shall be\nliable for the payment of a Connection Charge(s) calculated in\naccordance with the provisions of this By-Law.\n\n19. (a) Every Owner shail disconnect and cease use of the existing septic\nsystem(s) on the Lot prior to connection to the Sanitary Sewer Works.\nExisting septic systems shall be decommissioned in accordance with the\nBuilding Code Act, its regulations and other applicable law.\n\n(b) Every Owner shall disconnect the existing well water system from\nthe buildings on the Owner’s Lot upon connection to the Water Works and\nshall ensure there is no cross-connection with the municipal water supply.\nUpon connection to the Water Works, no person shall use an existing well\nfor supplying drinking water to any buildings on the Owner's Lot.\n\nBy-Law Indexing\n\n20.The Connection Charge(s) imposed pursuant to this By-Law shall be\nadjusted annually on the 1* day of January, in accordance with the most\nrecent twelve month change in the Statistics Canada Quarterly, Non-\nResidential Building Construction Price Index (CANSIM Table 327-0043).\n\nSeverability\n\n21.If any term or provision of this By-Law or the application thereof to any\nperson shall to any extent be held to be invalid or unenforceable, the\nremainder of this By-Law or the application of such term or provision of\nthis By-Law to all persons other than those to whom it was held to be\ninvalid or unenforceable shall not be affected thereby and each term and\nprovision of this By-Law shall be separately valid and enforceable to the\nfull extent permitted by law.\n\nHeadings for Reference Only\n\n22.The headings inserted in this By-Law are for convenience of reference\nonly and shall not affect the construction of or interpretation of this By-\nLaw.\n"
    },
    {
      "page_number": 7,
      "text": "By-law Number 2019-183 7\n\nBy-Law Registration\n\n23.A certified copy of this By-Law may be registered on title to any land to\nwhich this By-Law applies.\n\nGeneral\n\n24. Any reference in this By-Law to an Owner in the singular shall be deemed\nto include the plural, where applicable.\n\n25.The Schedules attached hereto form an integral part of this By-Law as if\nrecited in full herein.\n\n26. Every person who contravenes any provision of this By-Law is guilty of an\noffense and upon conviction is liable to a fine of not more than $10,000.\n\nEffective Date\n\n27.This By-Law shall retroactively apply to all Water Works and/or Sanitary\nSewer Works constructed and installed from January 1, 2011 onward.\n\nRead a first time this 15°” day of October, 2019.\nRead a second time this 15\" day of October, 2019.\nRead a third time and finally passed this 15\" day of October, 2019.\n\nMITCH PANCIYK MAYOR\n\n!\n\nMATT MACDONALD CITY CLERK\n"
    },
    {
      "page_number": 8,
      "text": "By-law Number 2019-183 8\n\nSCHEDULE “A”\n\nTABLE 1\n\nService Per Single Detached Dwelling\nWater $3,728\nSanitary Sewer $4,594\nTotal $8,322\n\nTABLE 2\n; All other buildings or structures\n\n| Service (per ft? of Gross Floor Area)\nWater $1.02\nSanitary Sewer $0.68\n[ Total $1.70\n\n"
    },
    {
      "page_number": 9,
      "text": "By-law Number 2019-183\n\nSCHEDULE“B”\n\nUrban Service Area\n"
    },
    {
      "page_number": 10,
      "text": "Schedule \"B\" to By-law 2019-183\n\nCITY OF BELLEVILLE - OFFICIAL PLAN\n\na\n\nBELLEVILLE\n\nSCHEDULE 'B’\n\nLAND USE PLAN - URBAN SERVICED AREA\n\non He Bay of Quinte\n\nm0 eon mae Hes\n\nOF QUINTE\n\nBay\n\nOd\n\nREVISED UP TO AND NCLUDNG\nAMENDMENT = NO. 16 (APPROVED NOVEMBER 8 2010)\n\n"
    }
  ]
}