{
  "file_name": "BL 2001-129 A Bylaw Respecting Streets and Driveway Controls.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\n\nBY-LAW NUMBER 2001-129\n\nA BY-LAW RESPECTING STREETS AND DRIVEWAY CONTROLS\n\nWHEREAS Section 308 of the Municipal Act R.S.O. 1990, c. M45, as amended\nprovides that a Municipality may permit any person under such conditions as may be\nagreed upon to place, construct, install, maintain and use objects in, on, under or over\nsidewalks and highways under its jurisdiction, to permit any person to make, maintain\nand use areas under and openings in the highways and sidewalks, for prescribing the\nterms and conditions upon which the same are to be placed, constructed, installed,\nmaintained or used and for making such annual or other charge for the privilege\nconferred by the by-law as it considers reasonable;\n\nNOW THEREFORE, THE COUNCIL OF THE CORPORATION OF THE CITY OF\nBELLEVILLE ENACTS AS FOLLOWS:\n\n1. In this By-Law unless otherwise expressly stated:\n\n1.1\n\n1.2\n\n1.3\n\n1.4\n\n1.5\n\n2.2\n\nThe word “street” wherever used shall mean and include any public\nhighway, road, street, lane, alley, square, place, thoroughfare, or way\nwithin the City of Belleville.\n\nThe words “street line” shall mean and include the line dividing a\nproperty and the street.\n\nThe words “property line” shall mean and include the line dividing two\nadjacent properties.\n\nThe word “driveway” shall mean and include an area to be used by\nvehicles lying in and between the street line and the roadway, except\nthat portion which is situated on the property side of the sidewalk, or\nwalkway.\n\nThe word “roadway” shall mean and include the part of the street\navailable for traffic use, excluding sidewalk or walkway.\n\nWhen access is intended to operate in one direction only, it shall be\ndeemed to be defined as “entrance” or “exit” or alternatively as “ingress”\nor “egress”.\n\nWhen any authority is conferred on the City Engineer, the same may be\nexercised by an employee of the Department of Public Works duly\nauthorized so to do by the City Engineer.\n"
    },
    {
      "page_number": 2,
      "text": "BY-LAW NUMBER 2001-129 Page 2\n\n3. The following considerations apply to any vehicular entrance or exit from or into\na street or road whether an approach, driveway, curb cut or otherwise\ndescribed access or egress.\n\n3.1. Size of Driveways. Two Way.\n\n3.1.1\n\n3.1.2\n\n3.1.3\n\nMaximum width of driveway measured perpendicular to the\ncenter line of the driveway, 9.0 metres.\n\nMaximum dimension along the street line, 9.0 metres.\n\nSubject to Section 2 hereof, maximum width of curb cut\nmeasured at the roadway, including transition section, 11\nmetres.\n\nMaximum width of curb opening at the roadway where curb\nreturns are used shall be, 15 metres. For industrial and\ncommercial uses, where it is not possible to construct curb\nreturns, the maximum width permitted at the roadway shall be\n15 metres.\n\nIn the case of abutting lateral property lines and abutting or\ncommon driveways, the maximum curb cut measured at the\nroadway shall not exceed a total of 12 metres, nor 6 metres on\neach side of the projected common lateral property line\nmeasured at the roadway edge.\n\nOne way - where a driveway is intended for use in one\ndirection only (including each half of the divided driveway), the\nabove dimensions shall be reduced by 3.0 metres.\n\n3.2 Location of Driveways. Distance from the nearest point on the curb\nopening or curb cut.\n\n3.2.1\n\n3.2.2\n\n3.2.3\n\nTo projected street line of intersecting street, minimum 8\nmetres.\n\nTo point of tangency of curb, minimum 1.5 metres.\n\nTo projected lateral property line not at an intersection\nmeasured at the roadway edge:\n\n3.2.3.1 | Subject to Section 1 hereof for single and two family\ndwellings, Nil\n\n3.2.3.2 For all others, minimum 1.5 metres.\n"
    },
    {
      "page_number": 3,
      "text": "BY-LAW NUMBER 2001-129 Page 3\n\n3.3\n\n3.4\n\n3.5\n\n3.6\n\n3.7\n\n3.8\n\nAngle at Roadway. Sides of a driveway may meet the roadway at an\nangle less than a right angle but not less than sixty degrees (60°).\n\nSeparation. Distance between the nearest point on adjacent curb\nopenings or curb cuts.\n\n3.4.1 Measured along the road edge, minimum 8 metres.\n3.4.2 Measured at the street line, minimum 3 metres.\n3.4.3 Divided driveways, minimum 2 metres.\n\nNumber of Driveways. Each property shall be limited to the following\nnumber of driveways:\n\n3.5.1 Up to the first 30 metres of frontage, not more than two.\n3.5.2 For each additional 30 metres of frontage, not more than one.\n\n3.5.3 Where special circumstances warrant, three driveways may be\npermitted on a frontage of 53 metres subject to the approval of\nthe City Engineer.\n\nPump Islands or Gasoline Dispensing Units. Distance from the face of\npump island or gasoline dispensing units to the street line, minimum 4.6\nmetres.\n\nBarriers. All parking areas adjacent to the street line shall be clearly\ndelineated by Portland cement concrete curbing or by asphalt curbing\npainted white, to prevent vehicles from crossing the sidewalk or\nboulevard except where the driveway crosses it.\n\nDepressed Sidewalks. Construction of depressed exits and entrances to\nprivate property through city sidewalks is prohibited except where there\nis a combined sidewalk and curb, and except with the written approval of\nthe City Engineer, and in such case the sidewalk may be depressed on a\nslope from grade at a point 0.5 metres from the road side of the sidewalk\nto 38 millimetres above the gutter.\n\n4. No person shall construct or alter a driveway unless and until a permit for such\npurpose is obtained from the City Engineer. Application for the construction of\nnew driveway entrances or the alterations to existing driveway entrances shall\ncontain a suitable plot plan showing all pertinent information including existing\nentrances.\n\n4.1\n\nWhere, in the opinion of the City Engineer, a culvert is necessary to the\nconstruction of the driveway, the applicant shall install a 7 metre long\n"
    },
    {
      "page_number": 4,
      "text": "BY-LAW NUMBER 2001-129 Page 4\n\n4.2\n\n4.3\n\n4.4\n\nculvert of a diameter, strength and design approved in writing by the City\nEngineer;\n\nWhere, in the opinion of the City Engineer, a culvert is not necessary to\nthe construction of the driveway and the roadway is not curbed, the\napplicant shall shape the driveway so as not to interfere with the street\ndrainage;\n\nWhere alteration to an existing concrete curb or concrete curb and gutter\nis necessary to the construction of the driveway, the applicant shall\nremove the complete concrete section and replace same to the\nspecification of the City Engineer. Existing driveway curb openings\nwhich cannot be used as part of the approved new driveway entrance\nmust be removed and replaced with the full concrete section applicable\nby the applicant;\n\nWhere buildings are structurally altered to an extent greater than 50% of\nthe assessed value of the building, or are reconstructed, the driveways\nto same shall be made to conform to this By-Law.\n\n5. Except as otherwise herein provided, no person shall break, excavate,\ndisplace, remove, take up or shift the soil of any street, or any sidewalk,\ncurbing, pavement or road structure of any sort, in any street or public place in\nthe City until a cut permit has been obtained from the City Engineer, and signs\nand barricades erected and alternate routes established as provided herein,\nand without limiting the foregoing, cut permits shall be required for the\nconstruction of all ditches, culverts, walks, pavements and curbs within the\nstreet allowance. Such permit will be granted when the applicant complies with\n\nthe following:\n\n5.1. Provides a sketch showing location and proposed area of trench to be\nexcavated or area of land to be affected by the work.\n\n5.2. Pays to the City Treasurer the cost of the cut permit fee, and the\nestimated reinstatement costs, if applicable.\n\n5.3 Submits to the City Engineer a satisfactory performance bond in the\n\namount of $2,000.00 from a surety company, which shall guarantee that\nthe applicant will observe all the requirements of this By-Law and shall\nindemnify and save harmless the Corporation against all loss, cost and\ndamage; or a certified cheque in the amount of $2,000.00. In addition to\nthe foregoing the applicant shail also submit an insurance policy with\namounts of $2,000,000.00 for public liability for bodily injury and property\ndamage. This subsection shall not apply to the construction of\napproaches, driveways, ditches, culverts, walks, pavements, and curbs.\n"
    },
    {
      "page_number": 5,
      "text": "BY-LAW NUMBER 2001-129 Page 5\n\nThe Belleville Utilities, Hydro One, Bell Canada and Union Gas, however, shall\nnot be required to pay in advance the monies referred to in Subsection 5.2 and\nwill not be required to provide the bonding requirements of Subsection 5.3.\n\n6. The reinstatement cost to be paid by the applicant shall be calculated on the\nestimated area of each individual cut or lineal metre as the case may be at the\nrates established from time to time by the City Engineer for the various classes\nof work involved.\n\nThe cut area will be checked after backfilling and a refund or additional charge\nwill be made to adjust the cost paid according to the measurement on\ncompletion.\n\nThe rates charged for reinstatement work shall be increased by 50 per cent for\ncuts backfilled during the period November 15\" to April 15°.\n\nThe rates charged for reinstatement shall be doubled in cases of cuts opened\nprior to issuance of a Cut Permit, except for the Belleville Utilities, Hydro One,\nUnion Gas, and Bell Canada emergencies.\n\n7. Any person who breaks, excavates, displaces, removes, takes up or shifts the\nsoil of any street, or any sidewalk, curbing, pavement or road structure of any\nsort, in any street allowance or public place in the City, shall do so under the\ndirection of the City Engineer and shall observe the conditions set out by the\nCity Engineer from time to time in a road cut memorandum.\n\n8. An application for a road cut permit shall be made at least twenty-four (24)\nhours before it is intended to commence the affected work, on forms provided\nby the City with the information supplied as required thereon, together with\nsuch other relevant information as the City Engineer may require. PROVIDED,\nhowever, that the Belleville Utilities, Hydro One, Bell Canada, and Union Gas,\nmay perform emergency road cuts, without permit, but shall apply for such\npermit not later than the next working day following such emergency cut.\n\n9. Upon obtaining such permit and before commencing the work, the applicant\nshall provide, and during the course of the work shall maintain the following:\n\n9.1 Reasonable alternate routes or detours for through traffic, and a suitable\nby-road for ali owners or occupants who cannot obtain access to their\nproperty by any other public road, together with direction signs;\n\n9.2 At either or both ends of the portion of the highway closed or partially\nclosed, as the case may be, a substantial barricade or barricades upon\nwhich shall be exposed between sunset and dawn, such red, flashing\namber or other lights as may be required herein. In addition, signs shall\nbe posted indicating the alternate or deviation route.\n"
    },
    {
      "page_number": 6,
      "text": "BY-LAW NUMBER 2001-129 Page 6\n\n10.\n\n11.\n\n12.\n\n13.\n\n14.\n\n15.\n\nAll barricades, signs, lights, alternate routes or detours shall be according to the\nspecifications of the City of Belleville or where there are no such specifications,\naccording to designs and specifications approved by the City Engineer, and\nshall be constructed, installed, supplied and maintained by the applicant at his\nsole cost.\n\nIn the event that the work is not completed by the date provided for in the road\ncut permit, application shall be made for an extension of time, at least twenty-\nfour (24) hours prior to the expiry date provided for in the permit.\n\nIf the barricades, signs, alternate routes or detours provided for herein are not\nconstructed, supplied, installed and maintained, the City Engineer may\ntemporarily provide the same at the cost and expense of the person or\ncomipany responsible for the work, and the road cut permit, if any, shall be\ndeemed to have been withdrawn and the work shall not be recommenced\nunless and until a road cut permit or a new permit is obtained and proper\nbarricades, signs, lights, alternate routes or detours as the case may be, are\nprovided in accordance with the provisions hereof, and the same are approved\nby the City Engineer.\n\nAny person convicted of a breach of any of the provisions of this By-Law shall\nforfeit and pay at the discretion of the Court, a penalty, not exceeding\n(exclusive of costs) the sum of $300.00 for each offense.\n\nEXCEPTIONS TO THE BY-LAW:\n\nExceptions to the By-Law respecting Streets and Driveway Controls are found\non Schedule “A” attached.\n\nACCESS CONTROL AND ENTRANCE GUIDELINES FOR DESIGNATED\nSTREETS\n\nApplicability\nSection 15 shall apply to those streets listed in Schedule “B” of this By-Law.\nContents\n\nThe City of Belleville Access Control and Entrance Guidelines are comprised of\nthe following three (3) parts:\n\nPart 1 - Objectives\n\nPart 2 - Functional Classification\nPart 3 - Guidelines\n\n15.1 Part 1 — Objectives\n\nThe objectives of the City of Belleville is for the free flow of traffic and the\n"
    },
    {
      "page_number": 7,
      "text": "BY-LAW NUMBER 2001-129 Page 7\n\n15.2\n\nsafe access to property abutting the City roads cognizant of the intended\nfunction of the subject road. This free flow of traffic is reduced where\ndevelopment adjacent to the road creates turning and stopping\nmovements which interfere with the free flow of traffic. Roads carrying\nheavier volumes of traffic are more sensitive to adjacent development\nthan roads carrying lower traffic volumes, and therefore, heavily travelled\nroads carrying a large percentage of through traffic should be protected\nfrom access. This does not mean that development is prohibited on\nsuch roads, but that it should be serviced through appropriate means,\nsuch as interior road systems (ie, plan of subdivision), or properly\ndesigned residential, commercial, industrial, institutional, or other private\nentrance ways subject to appropriate standards.\n\nPart 2 - Functional Classification\n\nFor the purposes of the guideline, roads under the jurisdiction of the City\nof Belleville and within the Thurlow Ward area shall be classified into five\n(5) categories according to the predominant use or designed functions,\nnamely arterial, major collector, minor collector, local and urban\ncollector.\n\n. 15.2.1 Arterial Roads\n\nArterial roads are designed to carry large volumes of traffic to\nand from major traffic generating sectors, and are projected to\nhave Average Annual Daily Time Traffic (AADT) in excess of\n5,000. Arterial roads shall be classified as those roads with\nexisting or proposed two (2) or four (4) lanes with design right-\nof-way widths of 30 to 45 metres, or have AADT in excess of\n5,000. For an arterial road to function properly, direct access\nto abutting properties should be prohibited.\n\n15.2.2 Major Collector Roads\n\nMajor collector roads are designed to collect and distribute\ntraffic to and from local roads and arterial roads at a\nmoderately high rate of speed, and are projected to have\nAADT from 1,000 to 5,000. Major collector roads shall be\nclassified as those roads with existing or proposed two (2)\nlanes or four (4) lanes with design right-of-way width of 26 to\n30 metres or have AADT from 1,000 to 5,000. Major collector\nroads are designed to tolerate limited access to adjacent lands\nwith any such access subject to appropriate standards.\n\n15.2.3. Minor Collector Roads\n\nMinor collector roads are existing and proposed roads of two\n\n"
    },
    {
      "page_number": 8,
      "text": "BY-LAW NUMBER 2001-129 Page 8\n\n15.3\n\n15.2.4\n\n15.2.5\n\n15.2.6\n\n(2) traffic lanes with a design right-of-way width of 26 to 30\nmetres. Minor collector roads are designed to collect and\ndistribute traffic at moderate to relatively high operating\nspeeds to and from local roads and major collector roads and\narterial roads. Minor collector roads are those roads which are\nprojected to have an AADT of less than 1,000. Minor collector\nroads are designed to tolerate limited direct access to adjacent\nproperties.\n\nLocal Roads\n\nLocal roads are intended to provide both traffic service and\nland service (eg. access) and are designed to collect and\ndistribute traffic to and from collector or arterial roads at a\nrelatively low rate of speed. Local roads shall be classified as\nthose roads with existing and proposed two (2) lanes with\ndesigned right-of-way width of 20 to 26 metres (or less for\nexisting) and less than 1,000 AADT. Full access to abutting\nproperties is generally permitted subject to appropriate\nstandards.\n\nUrban Collector Roads\n\nUrban collector roads are existing roads of two (2) traffic lanes\nwith a design right-of-way of 20 to 30 metres. Urban collector\nroads provide both traffic service and land service and are\ndesigned to collect and distribute traffic at relatively low\noperating speeds to and from local roads and arterial roads\nand further provide for the interconnection of rural arterial and\ncollector roads. Full access to abutting properties is generally\npermitted.\n\nPrivate Entrances\nFor the purpose of this Guideline, a private entrance shall\n\nmean a driveway providing ingress and/or egress to and/or\nfrom a City road by means other than a City road.\n\nPart 3 — Guidelines\n\nThe following guidelines are to be followed when considering an\napplication for consent for a land severance, plan of subdivision or\nrequest for a Private Entrance Permit onto City roads to create a new\nprivate entrance or to change the use or type or location of an existing\n\nprivate entrance (ie, field or bush to residential, residential to\ncommercial, etc.)\n"
    },
    {
      "page_number": 9,
      "text": "BY-LAW NUMBER 2001-129\n\nPage 9\n\n15.3.1 Arterial Roads\n\n15.3.1.1\n\n15.3.1.2\n\nPublic Roads\n\nNew public roads may be permitted at appropriate\nlocations, provided such will comply with the\ngeometric design and safety requirements of the\nCity of Belleville as may be amended from time to\ntime.\n\nPrivate Entrances\n\nNo new entrances except those approved prior to\nthe adoption of these policies by Council of the City\nof Belleville will be permitted onto an arterial road,\nwhether new or existing.\n\nException to the above noted shall be for the former\nProvincial Highway 2 from Haig Road to Point Anne\nRoad.\n\nAccess shall be permitted by Public Road Access;\nhowever, direct access for infilling and/or\ndevelopment may be permitted where all geometric\ndesign and safety requirements of the City of\nBelleville as may be revised from time to time are\ncomplied with.\n\n15.3.2 Major Collector Roads\n\n15.3.2.1\n\n15.3.2.2\n\nPublic Roads\n\nNew public roads may be permitted at appropriate\nlocations where all geometric design and safety\nrequirements of the City of Belleville as may be\nrevised from time to time are complied with.\n\nPrivate Entrances (be it commercial, industrial,\ninstitutional, residential, farm or wood lot, etc.)\n\nA limited number of new private entrances may be\npermitted to service development of lands adjacent\nto a major collector road if:\n\n15.3.2.2.1 the minimum spacing between any\nproposed new entrances and/or\nexisting entrances is 300 metres, or\n"
    },
    {
      "page_number": 10,
      "text": "BY-LAW NUMBER 2001-129 Page 10\n\n15.3.3\n\n15.3.4\n\n45.3.2.2.2 the new entrance will provide for\ninfilling development where the posted\nspeed limit is 60 km/hr or less.\n\nIn addition to the above criteria, new entrances to service land\nshall comply with all geometric design and safety requirements\nof the City of Belleville as may be amended from time to time.\n\nMinor Collector Roads\n15.3.3.1 Public Roads\n\nNew public road entrances will be permitted at\nappropriate locations where all geometric design\nand safety requirements of the City of Belleville as\nmay be revised from time to time are complied with.\n\n15.3.3.2 Private Entrances\n\nA limited number of new entrances to private\nproperty may be permitted to service development\non lands adjacent to a minor collector road where\nthe following criteria are compiled with, namely:\n\n15.3.3.2.1 the minimum spacing between\nentrances is 150 metres, or\n\n15.3.3.2.2 the entrance will provide for the infilling\nof development in an area where the\nposted speed limit as of the date of\nadoption of this By-Law is 60 km/hour\nor less.\n\nIn addition to the foregoing criteria, new entrances to private\nproperty must comply with ali geometric design and safety\nrequirements of the City of Belleville as may be amended from\ntime to time.\n\nLocal Roads\n\n15.3.4.1 Public Roads\nNew public roads may be permitted at appropriate\nlocations, where all geometric design and safety\n\nrequirements of the City of Belleville as may be\namended from time to time are complied with.\n"
    },
    {
      "page_number": 11,
      "text": "BY-LAW NUMBER 2001-129 Page 11\n\n15.4\n\n15.3.5\n\n15.3.6\n\n15.3.7\n\n15.3.4.2 Private Entrances\n\nNew private entrances may be permitted to service\ndevelopment on land adjacent to.a local road, where\nthe new entrance complies with all geometric design\nand safety requirements of the City of Belleville as\namended from time to time, as well as the\nrequirements of Sections 1, 2 & 3 of this By-Law.\n\nUrban Collector Roads\n\nNew public road entrances and new entrances to private\nproperty will be permitted provided all geometric design and\nsafety requirements of the City of Belleville as may be\namended from time to time are complied with, as well as, the\nrequirements of Sections 1, 2 & 3 of this By-Law.\n\nVacant Lots of Record\n\nVacant lots of record created prior to the adoption of this by-\n\n_ law will be permitted direct access onto Arterial Roads and\n\nCollector Roads for the purposes of assessing one single\nfamily dwelling provided that all geometric design and safety\nrequirements of the City of Belleville are complied with.\n\nProvincial Highways\n\nNotwithstanding the provision of this By-Law, all proposed new\nroads and all entrances onto Highways under the jurisdiction\nof the Ministry of Transportation or within the adjacent\ndesignated control area shall receive Ministry approval, as well\nas the City of Belleville.\n\nGeometric Design & Safety Requirements\n\n15.4.1\n\nDesign\n\nGeometric design for new public roads shall be as per the\nManual of Geometric Design Standards for Canadian Roads\npublished by the Transportation Association of Canada (TAC)\nas revised from time to time.\n\n15.4.1.1 Commercial, industrial and institutional private\nentrances shall be as required by the current issue\nof Ministry of Transportation commercial site access\npolicy and standards.\n"
    },
    {
      "page_number": 12,
      "text": "BY-LAW NUMBER 2001-129 Page 12\n\n15.4.2\n\n15.4.1.2 Residential, woodlot or field private entrances shall\nbe as per requirements of Ontario Provincial\nStandard Drawings (OPSD) 301.010, .020 and .03\nas applicable, and as revised from time to time.\n\nSafety\n\nAn application for a private entrance shall meet or exceed the\nfollowing criteria existing at the date of application:\n\n15.4.2.1. minimum stopping sight distance as required by the\nManual of Geometric Design Standards for\nCanadian Roads published by the Transportation\nAssociation of Canada (TAC), as revised from time\nto time; and\n\n15.4.2.2 have visibility equal to the minimum stopping sight\ndistance requirement of Subsection 15.4.2.1, plus\n10 kilometres per hour.\n\n15.5 Stopping Sight Distance\n\n15.5.1\n\n15.6 Visibility\n\n15.6.1\n\nStopping sight distance for Subsection 15.4 shall be defined\nas the distance between a vehicle and an object on the\nroadway that requires the vehicle to come to a stop. When the\nstopping sight distance is equal to the minimum distance\nrequired to bring the vehicle to a stop from a given speed,\ntaking into consideration the time required for a driver to\nrecognize the hazard, initiate the breaking action, and for the\nvehicle to come to a stop, such a stopping sight distance is\nknown as the Minimum Stopping Sight Distance.\n\n15.5.1.1 Stopping sight distance shall be measured from a\nheight of the driver's eye of 1.05 metres to an object\nheight representative of a vehicle's tail lights, of 0.38\nmetres (in both cases measured from the road\nsurface).\n\n15.5.1.2 Stopping sight distance must be determined within\nthe public road right-of-way (ie, not over private\nproperty).\n\nThe measurement of visibility for Subsection 15.4 is subject to\nthe following criteria:\n"
    },
    {
      "page_number": 13,
      "text": "BY-LAW NUMBER 2001-129 Page 13\n\n15.7\n\n15.6.1.1 height of eye of driver of vehicle entering the public\nroad is defined as 1.05 metres above the ground;\n\n15.6.1.2 height of object is defined as 1.30 metres above the\npublic road and represents the roof of a vehicle;\n\n15.6.1.3 height of eye is to be measured from a point 3.0\nmetres from the outside edge of outer traffic lane\n(this represents the point of location of the driver's\neye when awaiting an opportunity to enter the public\nroad); and\n\n15.6.1.4 visibility is to be measured from the point\nrepresented in Subsection 15.6.1.3 above to the\ncentre of the traffic lane affected by the entering\nvehicle which gives the least length. On public\nroads having two-way traffic lanes, visibility must be\nmeasured from both approaches. For a divided\npublic road, visibility need only be measured for one\ndirection, as vehicles only encounter other vehicles\nmoving the same direction.\n\n15.6.2 Visibility for Subsection 15.4 is to be determined from a point\n3.0 metres from the outside edge of the outer traffic lane, and\nmust be determined within the public road right-of-way (ie. not\nover private property).\n\nNew Private Entrance Permits\n\nNo new private entrances or change in type or use or location of existing\nprivate eritrances shall be permitted, unless a Road Cut Permit and a\nPrivate Entrance Permit have been issued by the City for the proposed\nnew private entrance or the new type or use of location of the private\nentrance. No Private Entrance Permit shall be issued unless the\nproposal conforms to the City of Belleville Access Control and Entrance\nGuidelines. A Private Entrance Permit shall not be issued for a change\nin type or use or location of an existing private entrance, unless the\nproposal conforms to the requirements of the City of Belleville Access\nControl and Entrance Guidelines for a Private Entrance. The Private\nEntrance Permit fee shall accompany all access permit applications or\nan application for a change in the type or use or location of an existing\nprivate entrance. If permit approval for the entrance is received, the\napplicant shall be required to take out a Road Cut Permit before initiating\nany work authorized by the Entrance Permit within the Public Road\nAllowance. If a culvert is required, the applicant shall be responsible for\nthe cost of installation by the City. The approval authority for Road Cut\nPermits and Private Entrance Permits shall be the City Engineer or his\ndesignate.\n"
    },
    {
      "page_number": 14,
      "text": "BY-LAW NUMBER 2001-129\n\n15.7.1\n\nPage 14\n\nEntrance Designations\n\n15.7.1.1\n\n15.7.1.2\n\n45.7.1.3\n\n15.7.1.4\n\n15.7.1.5\n\n15.7.1.6\n\n15.7.1.7\n\n15.7.1.8\n\nResidential Entrances\n\nEntrances to land designated in the zoning by-law(s)\nof the City as approved for residential development.\nResidential entrances shall have a minimum top\nplatform width of five (5) metres.\n\nCommercial Entrances\n\nEntrances to land designated in the zoning by-law(s)\nof the City as approved for commercial\ndevelopment. Commercial entrances shall have a\nminimum top platform width of nine (9) metres and\nbe paved.\n\nAlternative Access\n\nWhere access is available off two or more roads,\naccess will be taken from the road possessing the\nlowest classification.\n\nVisibility Triangles\nEntrances onto visibility triangles are not permitted.\n\nInterchange/Channelizations\n\nDirect access is not permitted onto any ramp or\nspeed change lane associated with interchanges\nand channelized intersections except for commuter\nparking lots.\n\nCommuter Parking Lots\nDirect access will not be permitted.\nTruck Climbing/Passing Lanes\n\nAccess onto truck climbing lanes/passing lanes is\nnot permitted.\n\nDrainage\nWhen the construction of an entrance affects the\n\nCity drainage system, the cost of the remedial work\nis the owner's responsibility.\n"
    },
    {
      "page_number": 15,
      "text": "BY-LAW NUMBER 2001-129 Page 15\n\n15.7.1.9 Guiderails\n\n15.7.1.9.1 Entrances which require crossing\nthrough existing guiderails are\ngenerally not permitted.\n\n15.7.1.9.2 Such entrances should only be\nconsidered for existing lots if no other\nalternative is available and if the\nentrance will not endanger the\ntravelling public. The owner is\nresponsible for all costs related to the\nentrance and the modifications to the\nguiderail.\n\nNote that the structural ability and\nproper functioning of guiderails\ndepend upon pre-engineered\nparameters which require a certain\nlength to effect the desired\nperformance. Therefore, the minimum\nlength required by the Ontario\nProvincial Standards Manual must be\nmaintained at all times.\n\n16. THAT By-Law Number 10699 and all other By-Laws or parts thereof\ninconsistent herewith be and the same are hereby rescinded.\n\nTHIS BY-LAW SHALL COME INTO FORCE AND TAKE EFFECT IMMEDIATELY ON\nAND AFTER THE PASSING THEREOF\n\nRead a first time this 13\" day of August, 2001\nRead a second time this 13\" day of August, 2001\nRead a third time and finally passed 13\" day of August, 2001\n\nMAYOR\n\nCITY CLERK\n"
    },
    {
      "page_number": 16,
      "text": "SCHEDULE “A”\nTO BY-LAW NUMBER 2001-129\nEXEMPTIONS TO SECTION 3\n\nNotwithstanding the provisions of Subsection 3.5.1 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the parcel of land\ndescribed below shall be permitted to have and maintain not more than\ntwo (2) driveways on the said parcel of land.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate lying and being in the City of Belleville, County of Hastings, and\nProvince of Ontario, being composed of the easterly 15.25 metres of Part\nof Lot “C” on the south side of Dundas Street East in the City of Belleville,\nhaving a frontage on said Dundas Street of 15.25 metres by a depth of\n35.075 metres, more or less to the fence as laid down on the registered\nmap of the City of Belleville made by Evans and Bolders and duly\nregistered as Number 296, and including that certain parcel of lands being\nconveyed by William Wesley Gray to the Corporation of the City of\nBelleville designated as Part 19 on Reference Plan 21R-636.\n\nNotwithstanding the provisions of Subsections 3.2.1, 3.2.2, 3.4.1, 3.5.1\nand 3.5.2 of By-Law Number 2001-129, and provided that the use of the\nlands described below is and continues to be as a site of a townhouse\ndevelopment, the provisions of said Subsections 3.2.1, 3.2.2, 3.4.1, 3.5.1\nand 3.5.2 of By-Law Number 2001-129 shall not apply to the property\ndescribed below. “\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate lying and being in the City of Belleville, County of Hastings, and\nProvince of Ontario, being composed of Block J, Registered Plan Number\n1880, located at the South East corner of Bridge Street West and Dunnett\nBoulevard.\n\n1. Notwithstanding the provisions of Subsection 3.2.1 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the distance from the northerly extremity of the entrance to\nthe property described below from Pinnacle Street to the projected\nsoutherly street line of the intersecting street, which is Dundas\nStreet East, shall be a minimum of 3.0 metres.\n"
    },
    {
      "page_number": 17,
      "text": "Schedule “A” to By-Law Number 2001-129 2\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate lying and being in the City of Belleville, County of\nHastings, and Province of Ontario, being composed of part of the\nwest half of Lot No. Fifteen (15) on the East side of Pinnacle Street\naccording to Government Plan duly registered and more particularly\ndescribed as follows:\n\nPREMISING that the northerly limit of said Lot 15 to have a bearing\nof North 72 degrees 15 minutes East (N72° 15’ E) and relating all\nbearings herein thereto.\n\nCOMMENCING at the northwest angle of Lot 15;\n\nTHENCE North 72 degrees 15 minutes East (N72° 15’ E) along the\nNorth Limit of said Lot, being also the southerly limit of Dundas\nStreet East, a distance of 26.764 metres to an iron bar;\n\nTHENCE South 18 degrees 45 minutes East and parallel with the\nwesterly limit of said Lot a distance of 38.952 metres to an iron bar\nplanted in the southerly limit of said lot;\n\nTHENCE South 72 degrees 15 minutes West (S72° 15’ W) along\nlast mentioned limit a distance of 13.039 metres to an iron bar\nplanted in the northeasterly limit of the lands of the Canadian\nNorthern Railway;\n\nTHENCE North 45 degrees 6 minutes West (N45° 06’ W) along last\nmentioned limit a distance of 30.909 metres to an iron bar planted\nin the westerly limit of said Lot 15, being also the easterly limit of\nPinnacle Street;\n\nTHENCE North 18 degrees 45 minutes West (N18° 45’ W) along\nthe last mentioned limit a distance of 11.502 metres to the place of\ncommencement.\n\n3. 2. Notwithstanding the provisions of Subsection 3.2.1 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the distance from-the westerly extremity of the entrance to\nthe property described below from Dundas Street East to the\nprojected easterly street line of the intersecting street, which is\nPinnacle Street, shall be a minimum of 3.7 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate lying and being in the City of Belleville, County of\nHastings, and Province of Ontario, being composed of part of the\n"
    },
    {
      "page_number": 18,
      "text": "Schedule “A” to By-Law Number 2001-129 3\n\nwest half of Lot No. Fifteen (15) on the East side of Pinnacle Street\naccording to Government Plan duly registered and more particularly\ndescribed as follows:\n\nPREMISING that the northerly limit of said Lot 15 to have a bearing\nof North 72 degrees 15 minutes East (N72° 15’ E) and relating all\nbearings herein thereto.\n\nCOMMENCING at the northwest angle of Lot 15;\n\nTHENCE North 72 degrees 15 minutes East (N72° 15’ E) along the\nNorth Limit of said Lot, being also the southerly limit of Dundas\nStreet East, a distance of 26.764 metres to an iron bar;\n\nTHENCE South 18 degrees 45 minutes East and parallel with the\nwesterly limit of said Lot a distance of 38.952 metres to an iron bar\nplanted in the southerly limit of said lot;\n\nTHENCE South 72 degrees 15 minutes West (S72° 15’ W) along\nlast mentioned limit a distance of 13.039 metres to an iron bar\nplanted in the northeasterly limit of the lands of the Canadian\nNorthern Railway;\n\nTHENCE North 45 degrees 6 minutes West (N45° 06’ W) along last\nmentioned limit a distance of 30.909 metres to an iron bar planted\nin the westerly limit of said Lot 15, being also the easterly limit of\nPinnacle Street;\n\nTHENCE North 18 degrees 45 minutes West (N18° 45’ W) along\nthe last mentioned limit a distance of 11.502 metres to the place of\ncommencement.\n\n4. Notwithstanding the provisions of By-Law Number 2001-129, the\nprovisions of Subsections 3.1.3 and 3.2.3 set out herein shall not apply to\nthe parcel of land described below, provided that the use of the said parcel\nof land existing at the time of the passage of this By-Law remains the\nsame.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate lying and being in the City of Belleville, County of Hastings, and\nProvince of Ontario, being composed of part of the East half of Lot No. 15,\non the East side of Pinnacle Street, and part of the West half of Lot No.\n15, on the West side of Church Street, according to Government Plan duly\nregistered and more particularly described as follows:\n"
    },
    {
      "page_number": 19,
      "text": "Schedule “A” to By-Law Number 2001-129 4\n\nPREMISING that the northerly limit of said Lot 15, on the East side of\nPinnacle Street, to have a bearing of North 72 degrees 17 minutes East\n(N72° 17’ E) and relating all bearings herein thereto.\n\nCOMMENCING at a point in the north limit of the said Lot 15, on the East\nside of Pinnacle Street, 26.678 metres East of the North West angle of the\nsaid Lot 15;\n\nTHENCE North 72 degrees 17 minutes East (N72° 17’ E) along the north\nlimit of said Lot 15, being also the southerly limit of Dundas Street East, a\ndistance of 26.678 metres to an iron bar;\n\nTHENCE South 18 degrees 47 minutes 30 seconds East (S18° 47’ 30” E),\nand parallel with the West limit of the said Lot 15, a distance of 38.784\nmetres to an iron bar planted in the southerly limit of the said lot;\n\nTHENCE South 72 degrees 07 minutes 10 seconds West (S72° 07° 10”\nW) a distance of 26.678 metres to an iron bar;\n\nTHENCE North 18 degrees 47 minutes 30 seconds West (N18° 47’ 30” W)\na distance of 38.869 metres to the place of commencement.\n\n5. 250 Victoria Avenue\n\n5. 1. Notwithstanding the provisions of Subsection 3.2.1 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the distance from the projected westerly street line of |\nMacdonald Avenue to the easterly limit of the driveway entrance\nserving the property described below from Victoria Avenue shall be\na minimum of 2.0 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate lying and being in the City of Belleville, County of\nHastings, and Province of Ontario, being composed of Part of Lot\nNo. 9, north of Victoria Avenue according to Registered Plan\nNumber 211 and being more particularly described as follows:\n\nCOMMENCING at the southeast angle of said Lot 9;\n\nTHENCE Westerly along the southerly boundary of said Lot 9 a\ndistance of 18.428 metres to a point;\n\nTHENCE Northerly parallel to the easterly boundary of said Lot 9 a\ndistance of 34.922 metres to a point;\n"
    },
    {
      "page_number": 20,
      "text": "Schedule “A” to By-Law Number 2001-129 5\n\nTHENCE Easterly paraliel to the southerly boundary of said Lot 9 a\ndistance of 18.428 metres to a point on the easterly boundary of\nsaid Lot 9:\n\nTHENCE Southerly along the easterly boundary of said Lot 9 a\ndistance of 34.922 metres to the point of commencement.\n\nThe above parcel is known as Municipal Number 250 on Victoria\nAvenue.\n\n5. 2. Notwithstanding the provisions of Subsection 3.2.2 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the distance from the curb opening to point of tangency of\ncurb with respect to the said property described below may be nil.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate lying and being in the City of Belleville, County of\nHastings, and Province of Ontario, being composed of Part of Lot\nNo. 9, north of Victoria Avenue according to Registered Plan\nNumber 211 and being more particularly described as follows:\n\nCOMMENCING at the southeast angle of said Lot 9;\n\nTHENCE Westerly along the southerly boundary of said Lot 9 a\ndistance of 18.428 metres to a point;\n\nTHENCE Northerly parailel to the easterly boundary of said Lot 9 a\ndistance of 34.922 metres to a point;\n\nTHENCE Easterly parallel to the southerly boundary of said Lot 9 a\ndistance of 18.428 metres to a point on the easterly boundary of\nsaid Lot 9;\n\nTHENCE Southerly along the easterly boundary of said Lot 9 a\ndistance of 34.922 metres to the point of commencement.\n"
    },
    {
      "page_number": 21,
      "text": "Schedule “A” to By-Law Number 2001-129 6\n\n6. 194 Victoria Avenue\n\n6. 1.\n\nNotwithstanding the provisions of Subsection 3.2.1 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the distance from the projected northerly street line of\nVictoria Avenue to the driveway entrance from Lingham Street to\nthe property described below shall be a minimum of three (3)\nmetres.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, County of\nHastings and Province of Ontario, being composed of Part of Lot\n18W, west of Bleecker Avenue north of Victoria Avenue according\nto Registered Plan Number 166 and known as Municipal\nNumber 194 on Victoria Avenue.\n\nNotwithstanding the provisions of Subsection 3.2.2 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the distance from the curb opening to point of tangency of\ncurb with respect to the property described below may be nil.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, County of\nHastings and Province of Ontario, being composed of Part of Lot\n18W, west of Bleecker Avenue north of Victoria Avenue according\nto Registered Plan Number 166 and known as Municipal Number\n194 on Victoria Avenue.\n\n7. 549 Sidney Street\n\n7. 1.\n\nNotwithstanding the provisions of Subsection 3.2.1 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the distance from the projected easterly street line of Sidney\nStreet to the west limit of the driveway entrance from Parkdale\nDrive serving the property described below shall be a minimum of\nfour (4) metres.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, County of\nHastings and Province of Ontario, being composed of Part of Lot 4,\neast of Sidney Street according to Registered Plan 797 being more\nparticularly described as follows:\n"
    },
    {
      "page_number": 22,
      "text": "Schedule “A” to By-Law Number 2001-129 7\n\nCOMMENCING at a point on the northerly limit of said Lot 4\nmeasured 3.05 metres easterly there along from the northwest\nangle of said Lot 4;\n\nTHENCE easterly along said northerly limit of Lot 4 a distance of\n33.55 metres to a point;\n\nTHENCE southerly parallel to the easterly limit of said Lot 4 a\ndistance of 22.875 metres to a point;\n\nTHENCE westerly parallel to the northerly limit of said Lot 4 a\ndistance of 33.55 metres to a point;\n\nTHENCE northerly parallel to the easterly limit of said Lot 4 a\ndistance of 22.875 metres to the point of commencement.\n\n7. 2. Notwithstanding the provisions of Subsection 3.2.2 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the distance to point of tangency or curb with respect to the\nproperty described below shall be a minimum of 0.6 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, County of\nHastings and Province of Ontario, being composed of Part of Lot 4,\neast of Sidney Street according to Registered Plan 797 being more\nparticularly described as follows:\n\nCOMMENCING at a point on the northerly limit of said Lot 4\nmeasured 3.05 metres easterly there along from the northwest\nangle of said Lot 4;\n\nTHENCE easterly along said northerly limit of Lot 4 a distance of\n33.55 metres to a point;\n\nTHENCE southerly parallel to the easterly limit of said Lot 4 a\ndistance of 22.875 metres to a point;\n\nTHENCE westerly parallel to the northerly limit of said Lot 4 a\ndistance of 33.55 metres to a point;\n\nTHENCE northerly parallel to the easterly limit of said Lot 4 a\ndistance of 22.875 metres to the point of commencement.\n\n"
    },
    {
      "page_number": 23,
      "text": "Schedule “A” to By-Law Number 2001-129 8\n\n8. 1. Notwithstanding the provisions of Subsection 3.1.1 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the maximum width of driveway measured perpendicular to\nthe center line of the driveway shall be 10.0 metres with respect to\nthe property described below.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, County of\nHastings and Province of Ontario, being composed of Part of Lots 8\nand 9 west of North Park Street according to Government Plan\nbeing more particularly described as Parts 1, 2 and 3 ona\nReference Plan Deposited in the Registry Division of Hastings (No.\n21) as 21R-3014.\n\n8. 2. Notwithstanding the provisions of Subsection 3.1.2 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the maximum dimension along the street line shall be 10.0\nmetres with respect to the property described below.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, County of\nHastings and Province of Ontario, being composed of Part of Lots 8\nand 9 west of North Park Street according to Government Pian\nbeing more particularly described as Parts 1, 2 and 3 on a\nReference Plan Deposited in the Registry Division of Hastings (No.\n21) as 21R-3014.\n\n8. 3. Notwithstanding the provisions of Subsection 3.1.4 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of passage of this By-Law remains the same,\nthe maximum width of curb opening at the roadway where curb\nreturns are used shall be 24 metres with respect to the property\ndescribed below.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, County of\nHastings and Province of Ontario, being composed of Part of Lots 8\nand 9 west of North Park Street according to Government Plan\nbeing more particularly described as Parts 1, 2 and 3 on a\nReference Plan Deposited in the Registry Division of Hastings (No.\n21) as 21R-3014.\n"
    },
    {
      "page_number": 24,
      "text": "Schedule “A” to By-Law Number 2001-129 9\n\n9. 1. Notwithstanding the provisions of Subsection 3.1.2 of By-Law\nNurriber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the maximum dimension along the street line shall be 27.4\nmetres with respect to the driveway serving the said property\ndescribed below.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, County of\nHastings and Province of Ontario, being composed of all of Lot 24\nWest of Church Street according to Registered “Government Plan”\nand the most southerly 9.937 metres of the most westerly 23.028\nmetres of Lot 25 West of Church Street according to said\n“Government Plan.”\n\n9. 2. Notwithstanding the provisions of Subsection 3.2.1 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the distance from the projected northerly street line of Bridge\nStreet East to the southerly limit of the driveway entrance serving\nthe property described below from Church Street may be a\nminimum of three (3) metres.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, County of\nHastings and Province of Ontario, being composed of all of Lot 24\nWest of Church Street according to Registered “Government Plan”\nand the most southerly 9.937 metres of the most westerly 23.028\nmetres of Lot 25 West of Church Street according to said\n“Government Plan.”\n\n9. 3. Notwithstanding the provisions of Subsection 3.4.2 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the distance between the curb openings may be nil with\nrespect to the said property described below.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, County of\nHastings and Province of Ontario, being composed of all of Lot 24\nWest of Church Street according to Registered “Government Plan”\nand the most southerly 9.937 metres of the most westerly 23.028\nmetres of Lot 25 West of Church Street according to said\n“Government Plan.”\n"
    },
    {
      "page_number": 25,
      "text": "Schedule “A” to By-Law Number 2001-129 10\n\n10.\n\n10.\n\n11.\n\n1. Notwithstanding the provisions of Subsection 3.4.1 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the minimum distance between the most northerly driveway\nentrance from Church Street and the entrance southerly therefrom\nshall be 5.5 metres with respect to the property described below.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, County of\nHastings and Province of Ontario, being composed of Lots 3 and 4\nand Lot 2 save and excepting the most southerly 4.27 metres of\neven width throughout of said Lot 2; also being composed of the\n3.66 metre lane lying west of Church Street according to\nRegistered Plan No. 235.\n\n2. Notwithstanding the provisions of Subsection 3.5.1 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, that three (3) driveways shall be permitted to serve the\nproperty described below, from Church Street.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, County of\nHastings and Province of Ontario, being composed of Lots 3 and 4\nand Lot 2 save and excepting the most southerly 4.27 metres of\neven width throughout of said Lot 2; also being composed of the\n3.66 metre lane lying west of Church Street according to\nRegistered Plan No. 235.\n\nNotwithstanding the provisions of Subsection 3.1.4 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the maximum width\nof curb opening at the roadway where curb returns are used to serve the\nmost northerly driveway entrance from Singleton Drive shall be 17.1\nmetres with respect to the property described below.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, County of Hastings and\nProvince of Ontario, being composed of that Part of Lot 19 according to a\nplan registered in the Land Registry Office for the registry division of\nHastings as Plan 217 designated as Part 1 on a plan filed in the Office of\nLand Titles (21) at Belleville as Plan 21R-3152 and being the lands laid\nout by Hastings Condominium Plan No. 6, registered in the Land Registry\nOffice (21) of the Land Registry Division at Belleville.\n\n"
    },
    {
      "page_number": 26,
      "text": "Schedule “A’ to By-Law Number 2001-129 ]\n\n12.\n\n13.\n\n14.\n\nNotwithstanding the provisions of Subsections 3.1.1 and 3.1.3 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land existing\nat the time of the passage of this By-Law remains the same, the maximum\nwidth of curb opening measured at the roadway to serve the most easterly\ndriveway entrance from Bridge Street West shall be 15 metres with\nrespect to the property described below.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, County of Hastings and\nProvince of Ontario, being composed of Part of Lots 1, 2, 3, 4, 5, 6, 15, 16,\n17, 18, 25, 26, 27 and 28 lying West of Wellington Street and South of\nBridge Street according to Registered Plan No. Q358, and being\ndesignated as Part 1 according to Plan 21R-3648.\n\nNotwithstanding the provisions of Subsections 3.1.1, 3.1.2 and 3.1.3 of\nBy-Law Number 2001-129 and provided that the use of the parcel of jand\nexisting at the time of the passage of this By-Law remains the same, of\nthe three (3) driveways permitted under Subsection 3.5.3, to serve the\nproperty described below from Bridge Street West, one driveway may\nhave a maximum width of 14 metres and one driveway may have a\nmaximum width of 12 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, County of Hastings and\nProvince of Ontario, being composed of Part of Lots 1 and 2 according to\nRegistered Plan No. 27 and Part of Lot 21A, South of Bridge Street and\nWest of Highland Avenue, according to H. Carre’s Plan and being\ndesignated as Part 1 according to Plan 21R-1074; Also part of said Lot\n21A as described is a deed registered as Instrument No. 203799.\n\n107 McFarland Drive\n\nNotwithstanding the provisions of Subsection 3.2.1 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance from\nthe easterly extremity of the entrance to the property described below,\nfrom McFarland Drive to the projected westerly street line of the\nintersecting street, which is University Avenue shall be a minimum of 2.75\nmetres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate lying and being in the City of Belleville in the County of Hastings\n\n"
    },
    {
      "page_number": 27,
      "text": "Schedule “A” to By-Law Number 2001-129 12\n\n15.\n\n15.\n\n15.\n\n16.\n\nbeing composed of Lot 24 west of University Avenue according to\nRegistered Plan No. 168.\n\n108 McFarland Drive\n\n1.\n\nNotwithstanding the provisions of Subsection 3.2.1 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the distance from the easterly extremity of the entrance to\nthe property described below, from McFarland Drive to the\nprojected westerly street line of the intersecting street which is\nUniversity Avenue shall be a minimum of 3.65 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate lying and being in the City of Belleville in the\nCounty of Hastings being composed of Part of Lots 25 and 26 west\nof University Avenue according to registered Plan No. 168 and\ndesignated as Part 4 and Part 5 on Plan 21R-3902.\n\nThe above parcel is known as Municipal Number 108 McFarland\nDrive.\n\nNotwithstanding the provisions of Subsection 3.2.2 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the distance from the curb opening to the point of tangency\nof the curb with respect to the entrance to the property described\nbelow, from McFarland Drive shall be a minimum of 0.3 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate lying and being in the City of Belleville in the\nCounty of Hastings being composed of Part of Lots 25 and 26 west\nof University Avenue according to registered Plan No. 168 and\ndesignated as Part 4 and Part 5 on Plan 21R-3902.\n\n167 University Avenue\n\nNotwithstanding the provisions of Subsection 3.2.1 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance from\nthe northerly extremity of the entrance to the property described below,\nfrom University Avenue to the projected southerly street line of the\nintersecting street, which is Tice Crescent, shall be a minimum of 3.5\nmetres.\n"
    },
    {
      "page_number": 28,
      "text": "Schedule “A” to By-Law Number 2001-129 13\n\n17.\n\n18.\n\n18.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate lying and being in the City of Belleville in the County of Hastings\nbeing composed of Part of Lot 40 east of University Avenue according to\nRegistered Plan No. 168 and designated as Part 2 on Plan 21R-3901.\n\nNotwithstanding the provisions of Subsection 3.2.1 of By-law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance from\nthe westerly extremity of the entrance to the property described below,\nfrom Cascade Boulevard to the projected easterly street line of the\nintersecting street, which is Alnet Drive, shall be a minimum of 3.7 metres.\n\nALL of Lot 13 according to Plan M-57 in the City of Belleville, in the\nCounty of Hastings.\n\n1. Notwithstanding the provisions of Subsection 3.2.1 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the distance from the northerly extremity of the entrance to\nthe property described below, from Alnet Drive to the projected\nsoutherly boundary of the intersecting street, which is Stavebank\nRoad, shall be a minimum of 3.5 metres.\n\nALL of Lot 17 according to Plan M-56 in the City of Belleville, in the\nCounty of Hastings.\n\n2. Notwithstanding the provisions of Subsection 3.2.2 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the distance from the curb opening to the point of tangency\nwith respect to the entrance of the property described below, from\nAlnet Drive shall be a minimum of 0.9 metres from the tangent\npoint.\n\nALL of Lot 17 according to Plan M-56 in the City of Belleville, in the\nCounty of Hastings.\n"
    },
    {
      "page_number": 29,
      "text": "Schedule “A” to By-Law Number 2001-129 14\n\n19.\n\n20.\n\n21.\n\n21.\n\nNotwithstanding the provisions of Subsection 3.2.1 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance from\nthe southerly extremity of the entrance to the property described below,\nfrom Alnet Drive to the projected northerly street line of the intersecting\nstreet, which is Stavebank Road, shall be a minimum of 4.6 metres.\n\nALL of Lot 18 according to Plan M-56 in the City of Belleville, in the\nCounty of Hastings.\n\nNotwithstanding the provisions of Subsection 3.2.1 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance from\nthe easterly extremity of the entrance to the property described below,\nfrom Beverley Crescent to the projected westerly street line of the\nintersecting street, which is Alnet Drive, shall be a minimum of 3.7 metres.\n\nALL of Lot 26 according to Plan M-56 in the City of Belleville, in the\nCounty of Hastings.\n\n1. Notwithstanding the provisions of Subsection 3.2.1 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the distance from the easterly extremity of the entrance to\nthe property described below, from Beverley Crescent to the\nprojected westerly street line of the intersecting street, which is\nAlnet Drive, shall be a minimum of three (3) metres.\n\nALL of Lot 17 according to Plan M-56 in the City of Belleville, in the\nCounty of Hastings.\n\n2. Notwithstanding the provisions of Subsection 3.2.2 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the distance from the curb opening to the point of tangency\nwith respect to the entrance of the property described below, from\nBeverley Crescent, shall be a minimum of 1.1 metres.\n\nALL of Lot 17 according to Plan M-56 in the City of Belleville, in the\nCounty of Hastings.\n"
    },
    {
      "page_number": 30,
      "text": "Schedule “A” to By-Law Number 2001-129 15\n\n22.\n\n23.\n\n24.\n\n24.\n\n332 North Front Street\n\nNotwithstanding the provisions of Subsection 3.2.3.2 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance from\nthe southerly extremity of the entrance of the property described below,\nfrom North Front Street, to the projected southerly lateral property line of\nthe said property described below shall be a minimum of nil.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 13 according to Registrar's Compiled Plan\nNo. 1679 and designated as Part 1 according to Plan 21R-4370.\n\nNotwithstanding the provisions of Subsection 3.2.1 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance from\nthe northerly extremity of the entrance of the property described below\nfrom Front Street, to the projected southerly street line of Bridge Street\nWest shall be a minimum of two (2) metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 32 west of Front Street according to J.J.\nHaslett’s Plan, being the most northerly 40.35 feet thereof, more or less.\n\n1. Notwithstanding the provisions of Subsection 3.1.1 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the maximum width of driveway for the property described\nbelow from Front Street shall be 10.5 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, in the\nCounty of Hastings, being composed of that Part of Lot 37 west of\nFront Street according to J.J. Hasiett's Plan, lying northerly of the\npremises known as 220 Front Street and southerly of the premises\nknown as 224 Front Street in the City of Belleville.\n\n2. Notwithstanding the provisions of Subsection 3.1.3 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the maximum width of curb cut measured at the roadway\n"
    },
    {
      "page_number": 31,
      "text": "Schedule “A” to By-Law Number 2001-129 16\n\n25.\n\n25.\n\n26.\n\nincluding transition section with respect to the entrance of the\nproperty described below from Front Street shall be 12.5 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, in the\nCounty of Hastings, being composed of that Part of Lot 37 west of\nFront Street according to J.J. Haslett’s Plan, lying northerly of the\npremises known as 220 Front Street and southerly of the premises\nknown as 224 Front Street in the City of Belleville.\n\n1. Notwithstanding the provisions of Subsection 3.1.1 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the maximum width of driveway for the property described\nbelow from Centre Street shall be 18.3 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, in the\nCounty of Hastings, being composed of Part of Lot 3 west of Centre\nStreet according to Registered Plan No. 3 designated as Parts 1, 4\nand 5 according to Plan 21R-3499.\n\n2. Notwithstanding the provisions of Subsection 3.1.3 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the maximum width of curb cut measured at the roadway\nincluding transition section with respect to the entrance of the\nproperty described below from Centre Street shall be 18.3 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, in the\nCounty of Hastings, being composed of Part of Lot 3 west of Centre\nStreet according to Registered Plan No. 3 designated as Parts 1, 4\nand 5 according to Plan 21R-3499.\n\n220 Station Street\n\nNotwithstanding the provisions of Subsections 3.1.1, 3.1.2 and 3.1.4 of\nBy-Law Number 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the same, the\nmaximum width permitted for each of the two driveways serving the\nproperty described below from Station Street, shall be 12 metres and the\nmaximum curb opening shall be 22 metres.\n"
    },
    {
      "page_number": 32,
      "text": "Schedule “A” to By-Law Number 2001-129 17\n\n27.\n\n28.\n\n29.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 7 in the first concession (formerly of the\nTownship of Thurlow, now in the City of Belleville) and known as Municipal\nNo. 220 Station St., Belleville.\n\n237 Station Street\n\nNotwithstanding the provisions of Subsection 3.2.3.2 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance from\nthe nearest point of the curb opening or curb cut with respect to the\ndriveway to serve the property known as Docter’s Hotel, described below,\nfrom Station Street to the projected lateral property line, shall be nil.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Lot 8, Lot 9, and Part of Lot 7, south of Station Street\naccording to Registered Plan No. 166 and known as Municipal No. 237\nStation St., Belleville.\n\n233 Station Street\n\nNotwithstanding the provisions of Subsection 3.2.3.2 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance from\nthe nearest point of the curb opening or curb cut with respect to the\ndriveway to serve the property known as Municipal No. 233 Station Street,\nwhich is occupied by a variety store, and which is described below, from\nStation Street to the projected lateral property line, shall be nil.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 6 and 7 south of Station Street according to\nRegistered Plan No. 166 and known as Municipal No. 233 Station St.,\nBelleville.\n\n11 Moira Street West\n\nNotwithstanding the provisions of Subsections 3.1.1, 3.1.2 and 3.1.3 of\nBy-Law Number 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the same, the\nfollowing exceptions are hereby authorized and approved with respect to\n"
    },
    {
      "page_number": 33,
      "text": "Schedule “A\" to By-Law Number 2001-129 18\n\n30.\n\n31.\n\nthe most easterly driveway serving the property described below, from\nMoira Street West.\n\ne The maximum width of the driveway shall be 22 metres.\ne The maximum dimension along the street line shall be 22 metres.\n\ne The maximum width of curb cut measured at the roadway including\ntransition section shall be 23 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of part of 1 and Part of Lot R on the south side of Moira\nStreet West according to J.J. Haslett’s Plan and known municipally as 11\nMoira Street West.\n\n4 Moira Street West\n\nNotwithstanding the provisions of Subsections 3.1.1, 3.1.2 and 3.1.3 of\nBy-Law Number 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the same, the\nfollowing exceptions are hereby authorized and approved with respect to\nthe driveway serving the property described below, from Moira Street\nWest.\n\n« The maximum width of the driveway shall be 17 metres.\ne The maximum dimension along the street line shall be 17 metres.\n\n¢ The maximum width of curb cut measured at the roadway including\ntransition section shall be 18 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Lots 1, 2, and Part of Lot 7 north of Moira Street West\naccording to Registered Plan No. 190 and known municipally as 4 Moira\nStreet West.\n\n201-205 Coleman Street\n\nNotwithstanding the provisions of Subsections 3.1.1, 3.1.2, 3.1.3 and 3.2.1\nof By-Law Number 2001-129 and provided that the use of the parcel of\nland existing at the time of the passage of this By-Law remains the same,\nthe following exceptions are hereby authorized and approved with respect\n"
    },
    {
      "page_number": 34,
      "text": "Schedule “A” to By-Law Number 2001-129 19\n\n32.\n\n33.\n\nto the driveway serving the property described below, from Coleman\nStreet.\n\ne The maximum width of the driveway shall be 34 metres.\ne The maximum dimension along the street line shall be 34 metres.\n\ne The maximum width of curb cut measured at the roadway including\ntransition section shall be 35 metres.\n\ne The maximum distance from the projected street line of the intersecting\nstreet, which is Bridge Street West, shall be a minimum of 4.5 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and: premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Lot 3 and Part of Lot 4 east of Coleman Street\naccording to J.J. Haslett’s Plan and known municipally as 201-205\nColeman Street.\n\n257-275 Coleman Street\n\nNotwithstanding the provisions of Subsection 3.5.2 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, a maximum of five\ndriveways serving the property described below, from Coleman Street,\nshall be permitted.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Lot 10 and Part of Lots 9 and 11 east of Coleman\nStreet according to J.J. Haslett’s Plan and known municipally as 257-275\nColeman Street.\n\n285 Coleman Street\n\nNotwithstanding the provisions of Subsections 3.1.1, 3.1.2 and 3.1.3 of\nBy-Law Number 2001-129 and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the same, the\nfollowing exceptions are hereby authorized and approved with respect to\nthe driveway serving the property described below, from Coleman Street.\n\ne¢ The maximum width of the driveway shall be 71 metres.\n\n¢ The maximum dimension along the street line shall be 71 metres.\n"
    },
    {
      "page_number": 35,
      "text": "Schedule “A” to By-Law Number 2001-129 20\n\n34.\n\n35.\n\ne The maximum width of curb cut measured at the roadway including\ntransition section shall be 71.9 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 11 east of Coleman Street according to J.J.\nHaslett’s Plan and known municipally as 285 Coleman Street.\n\n36 Moira Street West\n\nNotwithstanding the provisions of Subsections 3.2.2 and 3.2.3.2 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land existing\nat the time of the passage of this By-Law remains the same, the following\nexceptions are hereby authorized and approved with respect to the\ndriveways serving the property described below, from Moira Street West.\n\ne The distance from the curb opening to the point of tangency with\nrespect to the westerly driveway may be reduced to nil.\n\ne The distance from the easterly extremity to the projected easterly\nlateral property line of the said property shall be a minimum of nil.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 13 east of Coleman Street and north of\nMoira Street West according to J.J. Haslett's Plan and known municipally\nas 36 Moira Street West.\n\n18 Moira Street West\n\nNotwithstanding the provisions of Subsections 3.1.1, 3.1.2, 3.1.3 and\n3.2.3.2 of By-Law Number 2001-129 and provided that the use of the\nparcel of land existing at the time of the passage of this By-Law remains\nthe same, the following exceptions are hereby authorized and approved\nwith respect to the driveway serving the property described below, from\nMoira Street West.\n\ne The maximum width of the driveway shall be 11.8 metres.\ne The maximum dimension along the street line shall be 11.8 metres.\n\ne The maximum width of curb cut measured at the roadway including\ntransition section shall be 12.8 metres.\n"
    },
    {
      "page_number": 36,
      "text": "Schedule “A” to By-Law Number 2001-129 21\n\n36.\n\ne The distances from the westerly and easterly extremities to the\nrespective projected lateral property lines of the said property shall be\na minimum of 0. metres each.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 14 east of Coleman Street and north of\nMoira Street West according to J.J. Haslett's Plan and known municipally\nas 18 Moira Street West.\n\n30 Moira Street West\n\nNotwithstanding the provisions of Subsections 3.1.1, 3.1.2, 3.1.3, 3.4.1\nand 3.2.3.2 of By-Law Number 2001-129 and provided that the use of the\nparcel of land existing at the time of the passage of this By-Law remains\nthe same, the following exceptions are hereby authorized and approved\nwith respect to the driveways serving the property described below, from\nMoira Street West.\n\ne The maximum width of the most westerly driveway shall be 11 metres.\n\ne The maximum dimension along the street line with respect to the most\nwesterly driveway shall be 11 metres.\n\ne The maximum width of curb cut measured at the roadway including\ntransition section with respect to the most westerly driveway shall be\n12 metres.\n\ne The minimum distance between the two most westerly driveways shall\nbe 5.6 metres.\n\n« The distance from the easterly extremity of the most easterly driveway\nto the projected easterly lateral property lines of the said property shall\nbe a minimum of nil.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 13 east of Coleman Street and north of\nMoira Street West according to J.J. Haslett’s Plan and known municipally\nas 30 Moira Street West.\n"
    },
    {
      "page_number": 37,
      "text": "Schedule “A” to By-Law Number 2001-129 22\n\n37.\n\n38.\n\n39.\n\n16 Moira Street West\n\nNotwithstanding the provisions of Subsection 3.2.1 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance from\nthe easterly extremity of the driveway of the property described below,\nfrom Moira Street East, to the projected easterly lateral property line of the\nsaid property shall be a minimum of nil.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Lot 4 according to Registered Plan No. 155 and known\nmunicipally as 16 Moira Street West.\n\n138 Front Street\n\nNotwithstanding the provisions of Subsection 3.2.3.2 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance from\nthe northerly extremity of the northerly driveway of the property described\nbelow, from Front Street, to the projected northerly lateral property line of\nthe said property shall be a minimum of nil.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Lot 24 and Part of Lot 25 west of Front Street south of\nBridge Street according to Carre’s Plan and known municipally as 138\nFront Street.\n\nNotwithstanding the provisions of Subsection 3.2.3.2 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same,\n\ne The distance from the southerly extremity of the southerly driveway of\nthe property described below, from Front Street to the projected\nsoutherly lateral property line of the said property, shall be a minimum\nof nil.\n\ne The distance from the northerly extremity of the northerly driveway of\nthe property described below, from Front Street to the projected\nnortherly lateral property line of the said property, shall be a minimum\nof nil.\n"
    },
    {
      "page_number": 38,
      "text": "Schedule “A” to By-Law Number 2001-129 23\n\n40.\n\n41.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of all of Lots 20, 21 and 22 and the southerly 22 feet of\neven width of Lot 23, west of Front Street south of Bridge Street according\nto Carre’s Plan.\n\n11 Victoria Avenue\n\nNotwithstanding the provisions of Subsection 3.2.3.2 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance from\nthe nearest point of the curb opening or curb cut, with respect to the\ndriveway to serve the property known as Municipal No. 11 Victoria Avenue\n(Rollins Construction Limited office) and which is described below, from\nVictoria Avenue to the projected lateral property line, shall be nil.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 31, according to Registered Government\nPlan having 50.20 feet of frontage on the south side of Victoria Avenue\nand a depth of 60 feet and known municipally as 11 Victoria Avenue.\n\n200 Front Street\n\nNotwithstanding the provisions of Subsections 3.2.1 and 3.1.2 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land existing\nat the time of the passage of this By-Law remains the same, the distance\nfrom the easterly extremity of the most easterly driveway of the property\ndescribed below, (Municipal No. 200 Front Street — Donut King) from\nBridge Street East to the projected street line of intersecting street (Front\nStreet) be 6 metres, and the maximum dimension along the street line of\nsaid driveway be 11 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 34 west of Front Street, according to J.J.\nHaslett’s Plan having 40.16 feet of frontage on the west side of Front\nStreet and a depth of 160 feet, and known municipally as 200 Front Street.\n"
    },
    {
      "page_number": 39,
      "text": "Schedule “A” to By-Law Number 2001-129 24\n\n42.\n\n43.\n\n41 Elvins Street\n\nNotwithstanding the provisions of Subsection 3.2.1 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance from\nthe easterly extremity of the driveway of the property described below,\nfrom Elvins Street to the projected street line of the intersecting street\n(East Moira Street), be 4.57 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings\nand Province of Ontario, being composed of Lot 12, Registered Plan No.\n815.\n\n30 Dundas Street East\n\nNotwithstanding the provisions of Subsection 3.2.3.2 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance from\nthe nearest point of the curb opening or curb cut, with respect to the\ndriveway to serve the property known as Municipal No. 30 Dundas Street\nEast (Mr. Submarine) and which is described below, from Dundas Street\nEast to the projected lateral property line, shall be 0.6096 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of all of Lot 4 on the north side of Dundas Street\naccording to Registered Plan No. 16.\n\nNotwithstanding the provisions of Sections 3.1.1 and 3.2.3 2of By-Law\nNumber 2001-129 and provided that the use of the parcel of land existing\nat the time of the passage of this By-Law remains the same and subject to\nthe terms of a related Agreement entered into between The Corporation of\nthe City of Belleville and College Hill United Church, dated April 15, 1985,\n(By-Law Number 11688 refers) the following exceptions are hereby\nauthorized and approved with respect to the depressed curb area\n(driveway) abutting the property on North Park Street.\n\ne« The maximum width of the driveway measured perpendicular to the\ncentre line of the driveway be 41.5 metres as opposed to 9.0 metres.\n\ne The distance from the nearest point on the curb opening or curb cut to\nprojected lateral property line not at an intersection measured at the\n"
    },
    {
      "page_number": 40,
      "text": "Schedule “A” to By-Law Number 2001-129 25\n\n45.\n\n46.\n\nroadway edge be a minimum 0 (zero) metres as opposed to 1.5\nmetres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Part Lot 1 west of North Park Street according\nto Government Plan, having approximately 143 feet of frontage on North\nPark Street and an average depth of 95 feet.\n\nNotwithstanding the provisions of Subsection 3.4.1 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\nexception is hereby authorized and approved with respect to the\ndriveways serving the property (townhouse development — 20 units)\ndescribed below, from Progress Avenue:\n\ne The minimum distance between all driveways shall be 5 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of all of Lots 14, 15 and 16, according to Registered Plan\nNo. 1548.\n\n65 Dundas Street East\n\nNotwithstanding the provisions of Subsection 3.1.5 of By-Law Number\n2001-129 and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\nexception is hereby authorized and approved with respect to the driveway\nserving the property, i.e. Municipal No. 65 Dundas Street East described\nbelow, from Dundas Street East:\n\ne The maximum curb cut measured at the roadway, on the Municipal No.\n65 Dundas Street East side of a projected common lateral property\nline, measured at the roadway edge, be 11.8 metres\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lots 14 and 15, east of Church Street\naccording to Registered Government Plan having 90 feet of frontage on\nthe south side of Dundas Street East and a depth of 130 feet\napproximately.\n"
    },
    {
      "page_number": 41,
      "text": "Schedule *A” to By-Law Number 2001-129 26\n\n47.\n\n48.\n\n49.\n\n69 Dundas Street East\n\nNotwithstanding the provisions of Subsections 3.1.5 and 3.2.3.2 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land existing\nat the time of the passage of this By-Law remains the same, the following\nexceptions are hereby authorized and approved with respect to the\ndriveway serving the property, i.e. Municipal No. 69 Dundas Street East,\ndescribed below, from Dundas Street East:\n\ne The maximum curb cut measured at the roadway, on the Municipal No.\n69 Dundas Street East side of a projected common lateral property\nline, measured at the roadway edge, be 8.8 metres.\n\ne The driveway serving Municipal No. 69 Dundas Street East be a\nminimum distance of nil from the property line.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lots 14 and 15, east of Church Street\naccording to Registered Government Plan having 84.75 feet of frontage\non the south side of Dundas Street East and a depth of between 100 and\n130 feet approximately.\n\n22 Front Street\n\nNotwithstanding the provisions of Subsections 3.1.1 and 3.2.3.2 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land existing\nat the time of the passage of this By-Law remains the same, the distance\nfrom the northerly extremity of the northerly driveway to the projected\nnortherly property line of the said property shall be a minimum of nil and\nthe maximum width along the street line of said driveway, described\nbelow, shall be 25.0 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lots L and K, comprised of approximately 104\nfeet of frontage on the west side of Front Street according to J.J. Haslett’s\nPlan.\n\n26 Front Street\n\nNotwithstanding the provisions of Subsections 3.1.5 and 3.2.3.2 of By-Law\nNumber 2001-129 and provided that the use of the parcel of land existing\nat the time of the passage of this By-Law remains the same, the distance\nfrom the northerly extremity of the northerly driveway to the projected\n"
    },
    {
      "page_number": 42,
      "text": "Schedule “A” to By-Law Number 2001-129 27\n\n50.\n\n51.\n\nnortherly property line of the said property shall be a minimum of nil and\nthe maximum width of the portion of the common driveway of the said\nproperty, described below, shail be 7.45 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 2A west of Front Street according to J.J.\nHaslett’s Plan designated as Part 4, Plan 21R-5553.\n\nBoathouse Between 26 and 32 Front Street\n\nNotwithstanding the provisions of Subsections 3.1.1, 3.1.5 and 3.2.3.2 of\nBy-Law Numiber 2001-129, and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the same, the\ndistance from the driveway to the northerly and southerly projected\nproperty lines be nil and the maximum width of the portion of the common\ndriveway/curb cut of the said property, described below, shall be 21.03\nmetres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 7B comprised of approximately 69 feet of\nfrontage on the west side of Front Street, according to J.J. Haslett’s Plan.\n\n32 Front Street\n\nNotwithstanding the provisions of Subsections 3.1.1, 3.1.5 and 3.2.3.2 of\nBy-Law Number 2001-129, and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the same, the\ndistance from the driveway to the southerly projected property line be nil\nand the maximum width of the portion of the common driveway/curb cut of\nthe said property, described below, shall be 12.64 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\n\nbeing composed of Lot 7A west of Front Street, according to J.J. Haslett’s\nPlan.\n"
    },
    {
      "page_number": 43,
      "text": "Schedule “A” to By-Law Number 2001-129 28\n\n52.\n\n53.\n\n54.\n\n55.\n\n17 Pinnacle Street\n\nNotwithstanding the provisions of Subsection 3.1.1 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the maximum width\nof the driveway of the said property, described below, shall be 32 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 3 East of Pinnacle Street according to\nGovernment Plan having frontage of approximately 131 feet on the east\nside of Pinnacle Street.\n\n75 St. Paul Street (The Corporation of the City of Belleville)\n\nNotwithstanding the provisions of Subsection 3.2.1 of this By-Law the\ndistance from the nearest point on the curb opening to the projected street\nline of the intersecting street, described below, shall be a minimum\ndistance of 7 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Lots 14 and 15 east of George Street according to\nRegistered Plan No. 24 and Part of Lot 36 according to Registered Plan\nNo. 288 designated as Part 1, Plan 21R-7946,\n\n192 College Street East\n\nNotwithstanding the provisions of Subsection 3.4.1 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance\nbetween the two driveways, measured along the road edge, with respect\nto the property described below, shall be a minimum 4.3 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part Lot 1, Registered Plan No. 3, Part 2, 21R-5528.\n\n19 Alexander Street\n\nNotwithstanding the provisions of Subsection 3.4.1 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance\n\n"
    },
    {
      "page_number": 44,
      "text": "Schedule “A” to By-Law Number 2001-129 29\n\n56.\n\n57.\n\n58.\n\nbetween the two driveways, measured along the road edge, with respect\nto the property described below, shall be a minimum 3 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 6B, Registered Plan 296.\n\n91 North Park Street\n\nNotwithstanding the provisions of Subsection 3.2.1 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance from\nthe westerly extremity of the Bongard Crescent entrance to the property to\nthe projected street line of the intersecting street, i.e. North Park Street,\nshall be a minimum of 6 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 20, east of North Park Street, according to\nRegistered Plan No. 798.\n\n302 Charles Street\n\nNotwithstanding the provisions of Subsection 3.4.1 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the distance\nbetween the existing driveway at Municipal No. 302 Charles Street and\nthe proposed new driveway at this address be a minimum of 6 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lots 22 and 25, according to Registered Plan\nNo. 126, designated as Part 1, Plan 21R-4213.\n\n37 Prince of Wales Drive (Prince of Wales School)\n\nNotwithstanding the provisions of Subsection 3.1.2 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, a new driveway be\npermitted at Municipal No. 37 Prince of Wales Drive (Prince of Wales\nSchool) and the width of said proposed new driveway be a maximum 33.5\nmetres.\n"
    },
    {
      "page_number": 45,
      "text": "Schedule “A” to By-Law Number 2001-129 30\n\n59.\n\n60.\n\n61.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 5, Concession 2, known municipally as\nPrince of Wales Public School.\n\n380 Sidney Street\n\nNotwithstanding the provisions of Subsections 3.1.1 and 3.1.2 of By-Law\nNumber 2001-129, and provided that the use of the parcel of land existing\nat the time of the passage of this By-Law remains the same, the two\ndriveways be permitted a curb opening width of 15.0 metres each and a\nwidth of 10.0 metres at the street line with respect to the property\ndescribed below.\n\nLot 7, Registrar's Compiled Plan No. 2072, save and except therefrom\nPart 2, Plan 21R-2355.\n\nNotwithstanding the provisions of Subsection 3.1.4 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the five driveway\ncurb openings at the roadway be permitted an opening of 24.384 metres\nwith respect to the property described below.\n\nALL AND SINGULAR that parcel or tract of land described as being Lots\n3, 4 and 5, Land Registrar’s Compiled Plan 1824, and Lots 1, 2, 3, 4, 5,\nRegistered Plan No. 174, City of Belleville.\n\n156 Ann Street — Education Centre (William Street Entrance)\n\nNotwithstanding the provisions of Subsection 3.1.3 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the maximum width\nof the driveway at the William Street roadway edge, with respect to the\nproperty described below, shall be 19.5 metres.\n\nLots 1 and 2, Part Lot 3, east of William Street, Lots 1 and 2, Part Lot 3,\nwest of Ann Street and Lots 2 and 3, Part Lot 4, north of Dundas Street\nEast, According to Registered Plan No. 1; City of Belleville, County of\nHastings\n"
    },
    {
      "page_number": 46,
      "text": "Schedule “A” to By-Law Number 2001-129 31\n\n62.\n\n63.\n\n64.\n\n78 Tracey Park Drive\n\nNotwithstanding the provisions of Subsections 3.2.1 and 3.2.2 of By-Law\nNumber 2001-129, and provided that the use of the parcel of land existing\nat the time of the passage of this By-Law remains the same, the “Location\nof the Driveway” (distance from the nearest point on the curb opening or\ncurb cut) to the projected street line of intersecting street be a minimum\n1.8 metres and the distance from the nearest point on the curb opening or\ncurb cut to the point of tangency of curb be zero (0) metres with respect to\nthe property described below.\n\nLot 85, Plan 21M-80, City of Belleville, County of Hastings\n\n35 Emily Street\n\nNotwithstanding the provisions of Subsections 3.1.1, 3.1.2 and 3.2.1 of\nBy-Law Number 2001-129, and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the same, the\nfollowing exceptions be permitted with respect to the property described\nbelow:\n\ne Maximum width of driveway — 34.3 metres\ne Maximum dimension along street line — 34.3 metres\n\ne The distance from the nearest point on the curb opening or curb cut to\nprojected street line of intersecting street — minimum 5.0 metres\n\nLots 30 and 31, Registered Plan No. 15, in the City of Belleville.\n\n298 North Front Street\n\nNotwithstanding the provisions of Subsection 3.2.3.2 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\nexception be permitted with respect to the property described below:\n\ne The distance from the nearest point on the curb opening or curb cut to\nprojected lateral property line not at an intersection measured at the\nroadway edge, minimum 0.91 metres.\n\nLot 13, Registered Plan No. 1679, in the City of Belleville.\n\n"
    },
    {
      "page_number": 47,
      "text": "Schedule “A” to By-Law Number 2001-129 32\n\n65.\n\n66.\n\n265 Moira Street West\n\nNotwithstanding the provisions of Subsection 3.1.4 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\nexception be permitted with respect to the property described below:\n\ne The driveway opening be 18 metres wide.\n\nFirstly:\nLot 10 Registrar's Compiled Plan 1816 SAVE AND EXCEPT Parts 4 and\n5, Plan HSR-250 City of Belleville, County of Hastings.\n\nSecondly:\nLot 9, Registrars Compiled Plan 1816 SAVE AND EXCEPT Part 6, Plan\nHSR-250 City of Belleville, County of Hastings.\n\nThirdly:\n\nPart of Lot 4, Part of Lot 3 and Part of Lot “A” (known as Elgin Street)\nRegistered Plan No. 6, and Part of the Road Allowance between Lot 38 in\nthe First and Second Concessions of Township of Sidney, closed by By-\nLaw No. 12066, Registered April 7, 1987, as Instrument No. 373872, and\nclosed by By-Law No. 11274, Registered on March 31, 1983, as\nInstrument No. 314193, and Part of Lots 8 and 10, Registrar's Compiled\nPlan No. 1816 Designated as Parts 3, 4, 5, 6 and 7, Plan 21R-9832 and\nDesignated as Part 1, HSR 334.\n\nSUBJECT to an easement in favour of The Corporation of the City of\nBelleville over Part 1, Plan HSR 334 and over said Parts 5, 6 and 7, Plan\n21R-9832;\n\nAND SUBJECT to an easement in favour of Belleville Utilities over said\nParts 3, 4, 5, 6 and 7, Plan 21R-9832, as set out in Instrument No.\n381814.\n\n191 Bleecker Avenue\n\nNotwithstanding the provisions of Subsection 3.4.1 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\nexception be permitted with respect to the property described below:\n\ne The distance between two driveways be 6.5 metres as measured at\nthe road edge.\n"
    },
    {
      "page_number": 48,
      "text": "Schedule “A” to By-Law Number 2001-129 33\n\n67.\n\n68.\n\n69.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 27, east of Bleecker Avenue and south of\nBridge Street East, according to Registered Plan Number 166 and known\nas Municipal Number 191 on Bleecker Avenue.\n\n220 Dundas Street East\n\nNotwithstanding the provisions of Subsection 3.4.1 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\nexception be permitted with respect to the property described below:\n\ne The distance between two driveways be 3.5 metres as measured\nalong the road edge.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 33W, west of Bleecker Avenue, north of\nDundas Street East, according to Registered Plan Number 296 and known\nas Municipal Number 220 Dundas Street East.\n\n17 Alexander Street\n\nNotwithstanding the provisions of Subsection 3.4.1 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\nexception be permitted with respect to the property described below:\n\ne The distance between two driveways be 4.0 metres as measured at\nthe road edge\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nbeing composed of Part of Lot 6, according to Registered Plan Number\n126 and known as Municipal Number 17 Alexander Street.\n\n291 Victoria Avenue\n\nNotwithstanding the provisions of Subsection 3.1.3 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\nexception be permitted with respect to the property described below:\n"
    },
    {
      "page_number": 49,
      "text": "Schedule “A” to By-Law Number 2001-129\n\n70.\n\n71.\n71.\n\n71.\n\n34\n\ne The width of curb cut measured at the roadway, including transition\nsection, 11.5 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nand known as Municipal Number 291 Victoria Avenue.\n\n302 Victoria Avenue\n\nNotwithstanding the provisions of Subsection 3.4.1 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\nexception be permitted with respect to the property described below:\n\ne The distance between two driveways be 1.35 metres as measured\nalong the road edge.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings\nand known as Municipal Number 302 Victoria Avenue.\n\n58 Bertram Boulevard\n\n1. Notwithstanding the provisions of Subsection 3.1.3 of By-Law\nNumber 2001-129, and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the following exception be permitted with respect to the\nproperty described below:\n\ne The width of curb cut measured at the roadway, including\ntransition section, 12.2 metres.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, in the\nCounty of Hastings and known as Municipal Number 58 Bertram\nBoulevard.\n\n2. Notwithstanding the provisions of Subsection 3.2.1 of By-Law\nNumber 2001-129, and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the following exception be permitted with respect to the\nproperty described below:\n"
    },
    {
      "page_number": 50,
      "text": "Schedule “A” to By-Law Number 2001-129 35\n\n71,\n\n72.\n\n73.\n\ne There be a distance of 3.6 metres from the nearest point on the\ncurb cut to the projected street line of the intersecting street.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, in the\nCounty of Hastings and known as Municipal Number 58 Bertram\nBoulevard.\n\n3. Notwithstanding the provisions of Subsection 3.2.2 of By-Law\nNumber 2001-129, and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the following exception be permitted with respect to the\nproperty described below:\n\ne There be a distance of one (1) metre from the nearest point on\nthe curb cut to the point of tangency of the curb.\n\nALL AND SINGULAR that certain parcel or tract of land and\npremises situate, lying and being in the City of Belleville, in the\nCounty of Hastings and known as Municipal Number 58 Bertram\nBoulevard.\n\n346 Victoria Avenue\n\nNotwithstanding the provisions of Subsection 3.4.1 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same distance between\nthe two permitted driveways relevant to the property described below:\n\ne There be a distance of 4.5 metres as measured along the road edge.\n\nALL AND SINGULAR that certain parcel or tract of land and premises\nsituate, lying and being in the City of Belleville, in the County of Hastings,\nand known as Municipal Number 346 Victoria Avenue.\n\n379 North Front Street\n\nNotwithstanding the provisions of Subsection 3.1.2 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\nexceptions be permitted with respect to the property described below:\n"
    },
    {
      "page_number": 51,
      "text": "Schedule “A” to By-Law Number 2001-129 36\n\n74,\n\n75.\n\n76,\n\ne Maximum dimension along street line of driveways on North Front\nStreet: 10.07 metres and 9.24 metres.\n\ne Maximum dimension along street line of driveway on Bell Boulevard:\n10.69 metres.\n\nPart of Part Lot 13, west of North Park Street, Government Plan (Thurlow),\nCity of Belleville, County of Hastings, designated as Part 1, Plan 21R-\n12069.\n\n56 Moira Street East\n\nNotwithstanding the provisions of Subsection 3.1.5 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\nexception be permitted with respect to the property described below:\n\ne Curb cut to extend to approximately 7.0 metres west of the projected\ncommon lateral property line of 56 Moira Street East and 2 South Park\nStreet.\n\nPlan 155, Part Lot 16, City of Belleville, County of Hastings.\n\n405 Bridge Street East\n\nNotwithstanding the provisions of Subsection 3.1.4 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\nexception be permitted with respect to the property described below:\n\ne To allow the maximum width of the curb opening at the roadway for\n405 Bridge Street East to be 29.0 metres.\n\nPart of Lot 6, Plan 65, City of Belleville, County of Hastings.\n\n417-421 Bridge Street East\n\nNotwithstanding the provisions of Subsection 3.1.4 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\nexception be permitted with respect to the property described below:\n"
    },
    {
      "page_number": 52,
      "text": "Schedule “A” to By-Law Number 2001-129 37\n\ne The maximum width of the curb opening at the roadway for 417-421\nBridge Street East to be 25.0 metres.\n\nPart of Lot 6, Plan 65, City of Belleville, County of Hastings.\n\n77. 1 South Park Street\n\nNotwithstanding the provisions of Subsections 3.1.3, 3.1.5, 3.2.1 and 3.2.2\nof By-Law Number 2001-129, and provided that the use of the parcel of\nland existing at the time of the passage of this By-Law remains the same,\nthe following exceptions be permitted with respect to the property\ndescribed below:\n\ne The maximum width of the curb opening measured at the roadway\nincluding transition section, of approximately 19 metres.\n\ne The total length curb cut of approximately 24 metres extending\napproximately 19 metres west of the common projected lateral\nproperty line of 1 South Park Street and 66 Moira Street East.\n\ne The distance from the nearest point on the curb cut to the projected\nstreet line of approximately 6 metres.\n\ne The distance from the nearest point on the curb cut to the point of\ntangency of the radius to be nil.\n\nPart of Lot P, Plan 12, City of Belleville, County of Hastings, being\ndesignated as Part 1, Reference Plan No. 21R-7447.\n\n78. 110 North Front Street\n\n78. 1. East Driveway off of College Street West. Notwithstanding the\nprovisions of Subsections 3.1.1, 3.1.2 and 3.1.4 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at\nthe time of the passage of this By-Law remains the same, the\n\nfollowing exceptions be permitted with respect to the property\ndescribed below:\n\ne The maximum width of the driveway to be 11.2 metres.\n\ne The maximum width of the driveway along the street line to be\n14.229 metres.\n"
    },
    {
      "page_number": 53,
      "text": "Schedule *A\" to By-Law Number 2001-129 38\n\n78.\n\n78.\n\ne The maximum width of the curb opening with curb returns to be\n29.207 metres.\n\nPlan of Survey of Part of Block 2 (West of North Front Street),\nRegistered Plan 25, City of Belleville, County of Hastings.\n\nNorth Driveway off of North Front Street. Notwithstanding the\nprovisions of Subsections 3.1.1, 3.1.2 and 3.1.4 of By-Law Number\n\n2001-129, and provided that the use of the parcel of land existing at\nthe time of the passage of this By-Law remains the same, the\nfollowing exceptions be permitted with respect to the property\ndescribed below:\n\ne The maximum width of the driveway to be 12.1 metres.\n\n¢ The maximum width of the driveway along the street line to be\n13.169 metres.\n\ne The maximum width of the curb operiing with curb returns to be\n28.561 metres.\n\nPlan of Survey of Part of Block 2 (West of North Front Street),\nRegistered Plan 25, City of Belleville, County of Hastings.\n\nOne Way Driveway off of King George Square. Notwithstanding\nthe provisions of Subsections 3.1.1, 3.1.2 and 3.1.4 of By-Law\nNumber 2001-129, and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the following exceptions be permitted with respect to the\nproperty described below:\n\ne The maximum width of the driveway to be 7.5 metres.\n\ne The maximum width of the driveway along the street line to be\n7.8339 metres.\n\n© The maximum width of the curb opening with curb returns to be\n14.072 metres.\n\nPlan of Survey of Part of Block 2 (West of North Front Street),\nRegistered Plan 25, City of Belleville, County of Hastings.\n"
    },
    {
      "page_number": 54,
      "text": "Schedule “A” to By-Law Number 2001-129 39\n\n79.\n\n80.\n\n95 Hanna Court South\n\nNotwithstanding the provisions of Subsections 3.1.1 and 3.1.2 of By-Law\nNumber 2001-129, and provided that the use of the parcel of land existing\nat the time of the passage of this By-Law remains the same, the following\nexceptions be permitted with respect to the property described below:\n\ne The maximum width of the south driveway to be 11.0 metres.\n\ne The maximum width of the south driveway along the street line to be\n16.0 metres.\n\nPart of Lot 12, Registered Plan No. 2186; City of Belleville, County of\nHastings, being designated as Part 1, Plan 21R-9718.\n\n336 North Front Street\n\nNotwithstanding the provisions of Subsections 3.1.5, 3.2.3.2 and 3.4.1 of\nBy-Law Number 2001-129, and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the same, the\nfollowing exceptions be permitted with respect to the property described\nbelow:\n\ne The maximum width of the curb cut for the abutting or common\ndriveway at the north abutting lateral property line to be 13.2 metres.\n\ne The maximum width of the curb cut on the south side of the north\nprojected common lateral property line to be 10.1 metres.\n\ne The distance from the nearest point on the curb cut to the projected\nlateral property line for the south driveway to be nil.\n\ne The distance between the curb cut for the center driveway and the\ncurb cut for the north driveway to be 7.2 metres.\n\nLot 5, Registrar's Compiled Plan 1680, designated as Parts 1, 2, 3 and 4,\nPlan 21R-3655, subject to a right-of-way over, along and upon Part 1,\nPlan 21R-3655 and together with a right-of-way in common with others\nentitled thereto over Part of Lot 15, Registrar's Compiled Plan 1680,\ndesignated as Part 5, Plan 21R-3655, City of Belleville, County of\nHastings. As in Instrument No. 249308.\n"
    },
    {
      "page_number": 55,
      "text": "Schedule “A” to By-Law Number 2001-129 40\n\n81.\n\n82.\n\n83.\n\n417 Bridge Street East\n\nNotwithstanding the provisions of Subsection 3.1.4 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\nexception be permitted with respect to the property described below:\n\ne The maximum width of the curb opening at the roadway for 417 Bridge\nStreet East to be 26.7 metres.\n\nPart of Lot 6, Plan 65, City of Belleville, County of Hastings.\n\n345 Bell Boulevard (Hanna Court South Access)\n\nNotwithstanding the provisions of Subsections 3.1.1, 3.1.2, 3.1.4 and\n3.2.3.2 of By-Law Number 2001-129, and provided that the use of the\nparcel of land existing at the time of the passage of this By-Law remains\nthe same, the following exceptions be permitted with respect to the\nproperty described below:\n\ne The maximum width of the driveway measured perpendicular to the\ncenter line of the driveway to be 12.8 metres.\n\n¢ The maximum width of the driveway along the street line to be 13\nmetres.\n\ne The maximum width at the roadway to be 18.0 metres.\n\ne The distance from the nearest point at the roadway to the projected\nlateral property line to be nil.\n\nPart of Lot 37, Concession 2, Township of Sidney, now in the City of\nBelleville, County of Hastings, Designated as Part 1, Plan No. 21R-1714.\n300 Sidney Street (Our Lady of Fatima School)\n\nNotwithstanding the provisions of Subsections 3.1.3 and 3.3 of By-Law\nNumber 2001-129, and provided that the use of the parcel of land existing\nat the time of the passage of this By-Law remains the same, the following\n\nexceptions be permitted with respect to the property described below:\n\ne The maximum width of the southerly curb opening to be 12.0 metres.\n"
    },
    {
      "page_number": 56,
      "text": "Schedule “A” to By-Law Number 2001-129 41\n\n85.\n\n* The southerly driveway to met the roadway at an angle of less than 60\ndegrees.\n\nLot 12, Plan 1819, City of Belleville, County of Hastings.\n\nSouth Side of Bell Boulevard between Lemoine Street and Sidney\nStreet\n\nNotwithstanding the provisions of Subsections 3.1.4 and 3.2.3.2 of By-Law\nNumber 2001-129, and provided that the use of the parcel of land existing\nat the time of the passage of this By-Law remains the same, the following\nexceptions be permitted with respect to the property described below:\n\ne The maximum width of the two (2) requested curb openings on Bell\nBoulevard to be 22.3 metres.\n\ne The distance from the nearest point on the curb cut for the east\nentrance to the projected lateral property line, as measured at the\nroadway edge, to be nil.\n\nPart of Lots 17, 18 and 19, Registered Plan No. 22, City of Belleville,\nCounty of Hastings.\n\n200 Bell Boulevard\n\nNotwithstanding the provisions of Subsections 3.1.4 and 3.2.3.2 of By-Law\nNumber 2001-129, and provided that the use of the parcel of land existing\nat the time of the passage of this By-Law remains the same, the following\nexceptions be permitted with respect to the property described below:\n\ne The maximum width of the curb opening for the west entrance to be\n31.6 metres.\n\ne The maximum width of the curb opening for the east entrance to be\n28.0 metres.\n\ne The distance from the nearest point on the curb opening for the east\nentrance to the projected lateral property line, as measured at the\nroadway edge, to be nil.\n\nPart of Lots 34, 35 and 36, and Part of Mary Street, Registered Plan No.\n22, City of Belleville, County of Hastings.\n"
    },
    {
      "page_number": 57,
      "text": "Schedule “A\" to By-Law Number 2001-129 42\n\n86.\n\n87.\n\nNorth Side of Bell Boulevard, West of Lemoine Street (Hawley/Ming\nPartnership Il)\n\nNotwithstanding the provisions of Subsections 3.1.4 and 3.2.3.2 of By-Law\nNumber 2001-129, and provided that the use of the parcel of land existing\nat the time of the passage of this By-Law remains the same, the following .\nexceptions be permitted with respect to the property described below:\n\ne The maximum width of the curb opening to be 31.5 metres.\n\ne The distance from the nearest point on the curb opening to the\nprojected lateral property line, as measured at the roadway edge, to be\nnil.\n\nPart of Lots 19 and 20, Registered Plan No. 22, designated as Parts 2 and\n4 on Reference Plan 21R-17161, City of Belleville, County of Hastings.\n\nSouth Side of Bell Boulevard between Lemoine Street and the\nCanadian Tire Property (835309 Ontario Inc.)\n\nNotwithstanding the provisions of Subsections 3.1.4 and 3.2.3.2 of By-Law\nNumber 2001-129, and provided that the use of the parcel of land existing\nat the time of the passage of this By-Law remains the same, the following\nexceptions be permitted with respect to the property described below:\n\ne The maximum width of the curb opening for the west entrance to be\n22.3 metres.\n\ne The distance from the nearest point on the curb opening for the west\nentrance to the projected lateral property line, as measured at the\nroadway edge, to be nil.\n\ne The maximum width of the curb opening for the east entrance to be\n22.3 metres.\n\n¢ The distance from the nearest point on the curb opening for the east\nentrance to the projected lateral property line, as measured at the\nroadway edge, to be 0.48 metres.\n\nFirstly:\nParcel 36-1, in the Register for Section 22 (Belleville), being Part of Lots\n\n36 and 37, Registered Plan No. 22, designated as Part 1, Reference Plan\n21R-14852;\n"
    },
    {
      "page_number": 58,
      "text": "Schedule “A” to By-Law Number 2001-129 43\n\n88.\n\nSAVE AND EXCEPT the following: (a) Part of Lot 36, designated as Part\n2, Reference Plan 21R-17325; (b) Parts of Lots 36 and 37, designated as\nPart 3, Reference Plan 21R-17325 and Part 1, Reference Plan 21R-\n16256; and (c) Part of Lot 37, designated as Part 1, Reference Plan 21R-\n16261;\n\nTOGETHER WITH a right-of-way over Part of Lots 37 and 38, Registered\nPlan No. 22, designated as Part 2 on Plan 21R-14828 as in Instrument\nNo. 192631;\n\nSecondly: -\n\nParcel 36-3, in the Register for Section 22 (Belleville), being Part of Lot\n37, Registered Plan No. 22, designated as Part 1, Reference Plan 21R-\n16261;\n\nSAVE AND EXCEPT Part of Parcel 36-3, in the Register for Section 22\n(Belleville), being Part of Lot 37, designated as Part 4, Reference Plan\n21R-17325;\n\nTOGETHER WITH a right-of-way over Part of Lots 37 and 38, Registered\nPlan No. 22, designated as Part 2 on Plan 21R-14828 as in Instrument\nNo. 192631.\n\nAll in the City of Belleville, County of Hastings.\n\n222 Bell Boulevard - North Side of Bell Boulevard Immediately East\nof Sidney Street (Reid’s Dairy)\n\nNotwithstanding the provisions of Subsections 3.1.4 and 3.2.3.2 of By-Law\nNumber 2001-129, and provided that the use of the parcel of land existing\nat the time of the passage of this By-Law remains the same, the following\nexceptions be permitted with respect to the property described below:\n\ne The maximum width of the curb opening for the east entrance to be\n21.4 metres.\n\ne The distance from the nearest point on the curb opening for the east\nentrance to the projected lateral property line, as measured at the\nroadway edge, to be nil.\n\ne The maximum width of the curb opening for the west entrance to be\n21.2 metres.\n\nPart Lot 20, Plan 22, City of Belleville, County of Hastings, Designated as\nPart 1, Deposited Plan 21R-7413.\n"
    },
    {
      "page_number": 59,
      "text": "Schedule “A” to By-Law Number 2001-129 44\n\n89.\n\n90.\n\n222 Bell Boulevard - North Side of Bell Boulevard Immediately East\nof Sidney Street (Reid’s Dairy)\n\nNotwithstanding the provisions of Subsection 3.1.3 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\nexception be permitted with respect to the property described below:\n\ne The maximum width of the curb opening for the entrance on Sidney\nStreet to be 28.0 metres.\n\nPart Lot 20, Plan 22, City of Belleville, County of Hastings, Designated as\nPart 1, Deposited Plan 21R-7413.\n\n165 Pinnacle Street (Transit Terminal)\n\nNotwithstanding the provisions of Subsections 3.1.1, 3.1.2, 3.1.4, 3.2.3.2\nand 3.4.3 of By-Law Number 2001-129, and provided that the use of the\nparcel of land existing at the time of the passage of this By-Law remains\nthe same, the following exceptions be permitted with respect to the\nproperty described below:\n\nNorth Driveway on Pinnacle Street\n\ne The maximum width of this one-way entrance to be 9.0 metres.\n\ne The maximum dimension along the street line to be 10.84 metres.\n\ne The maximum width of curb opening at the roadway to be 18.94\nmetres.\n\ne The distance from the nearest point on the curb line to the projected\n(north) lateral property line as measured at the roadway edge to be nil.\n\nSouth Driveway on Pinnacle Street\ne The maximum width of this one-way exit to be 9.0 metres.\ne The maximum dimension along the street line to be 11.31 metres.\n\ne The maximum width of curb opening at the roadway to be 19.48\nmetres.\n\ne The distance from the nearest point on the curb line to the projected\n(south) lateral property line as measured at the roadway edge to be nil.\n"
    },
    {
      "page_number": 60,
      "text": "Schedule *A” to By-Law Number 2001-129 45\n\n91.\n\nNorth Driveway on Church Street\n\nThe maximum width of this one-way exit to be 7.5 metres.\n\nThe maximum dimension along the street line to be 7.94 metres.\n\nThe maximum width of curb opening at the roadway to be 20.0 metres.\nThe distance from the nearest point on the curb line to the projected\n\n(north) lateral property line as measured at the roadway edge to be 0.8\nmetres.\n\nSouth Driveway on Church Street\n\nThe maximum width of this one-way entrance to be 7.5 metres.\nThe maximum dimension along the street line to be 7.94 metres.\nThe maximum width of curb opening at the roadway to be 18.0 metres.\n\nThe distance from the nearest point on the curb line to the projected\n(south) lateral property line as measured at the roadway edge to be nil.\n\nThe distance between the nearest points on the adjacent Church\nStreet curb openings to be 0.5 metres.\n\nPart of Lots 19 and 20, east of Pinnacle Street, Government Plan and Lots\n3, 4 and Part of the Lane, Registered Plan 235.\n\n400 Dundas Street East\n\nNotwithstanding the provisions of Subsections 3.1.2, 3.1.4 and 3.2.3.2 of\nBy-Law Number 2001-129, and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the same, the\nfollowing exceptions be permitted with respect to the property described\nbelow:\n\nDriveway on Herchimer Avenue\n\nThe maximum dimension along the street line to be 11.8 metres.\n\nThe maximum width of curb opening to be 26.8 metres.\n"
    },
    {
      "page_number": 61,
      "text": "Schedule “A” to By-Law Number 2001-129 46\n\n92.\n\ne The distance from the nearest point on the curb opening to the\nprojected lateral property line as measured at the roadway edge to be\nnil.\n\nEast Driveway on Dundas Street East\n\ne¢ The maximum width at the roadway edge to be 26.0 metres.\n\nWest Driveway on Dundas Street East\n\ne The maximum dimension along the street line to be 11.5 metres.\n\ne The maximum width at the roadway edge to be 33.2 metres.\n\ne The distance from the nearest point at the roadway edge to the\nprojected lateral property line as measured at the roadway edge to be\nnil.\n\nPart of Lots 18 and 19, Registered Plan No. 22, City of Belleville, County\n\nof Hastings, more particularly described as Parts 1, 2, 3, 4, 5, 6, 8, 9 and\n\n10, Plan 21R-18099.\n\n135 Adam Street (St. Theresa Secondary School)\n\nNotwithstanding the provisions of Subsections 3.1.2 and 3.1.4 of By-Law\n\nNumber 2001-129, and provided that the use of the parcel of land existing\n\nat the time of the passage of this By-Law remains the same, the following\n\nexceptions be permitted with respect to the property described below:\n\nDriveway on Adam Street\n\n« The maximum dimension along the street line to be 10.0 metres.\n\n« The maximum width at the edge of pavement to be 22.0 metres.\n\nDriveway on Centre Street\n\ne The maximum width at the edge of pavement to be 25.3 metres.\n\nPart Lot 6, Registered Plan No. 3. Lots 1, 2, 3 and 44 and Block 24,\nRegistered Plan M73, City of Belleville, County of Hastings.\n"
    },
    {
      "page_number": 62,
      "text": "Schedule “A” to By-Law Number 2001-129 47\n\n93.\n\n94,\n\n95.\n\n28 Wallbridge Crescent\n\nNotwithstanding the provisions of Subsection 3.1.1 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\nexception be permitted with respect to the property located at Municipal\nNumber 28 Wallbridge Crescent:\n\ne The maximum width of the northerly driveway, as measured\nperpendicular to the centre line of the driveway, to be 11.6 metres.\n\n390 North Front Street (Quinte Mall)\n\nNotwithstanding the provisions of Subsection 3.1.6 of By-Law Number\n\n2001-129, and provided that the use of the parcel of land existing at the\n\ntime of the passage of this By-Law remains the same, the following\n\nexceptions be permitted with respect to Quinte Mall — 390 North Front\nStreet:\n\nDriveway on North Front Street\ne The maximum dimension along the street line to be 9.0 metres.\n\ne The maximum width at the edge of pavement to be 15.0 metres.\n\n210 Dundas Street East\n\nNotwithstanding the provisions of Subsection 3.2.3.2 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\n\nexception be permitted with respect to the property at 210 Dundas Street\nEast:\n\nDriveway on Dundas Street East\n\ne The nearest point on the curb cut to extend beyond the projection of\nthe east property line by 1.2 metres.\n"
    },
    {
      "page_number": 63,
      "text": "Schedule “A” to By-Law Number 2001-129 48\n\n96.\n\n96.\n\n96.\n\n97.\n\n98.\n\n98.\n\n98.\n\n160 Dundas Street West\n\n1.\n\nNotwithstanding the provisions of Subsection 3.1.2 of By-Law\nNumber 2001-129, and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the following exception be permitted with respect to the\nproperty located at Municipal Number 160 Dundas Street West:\n\ne The maximum dimension of the driveway as measured at the\nstreet line to be 12.0 metres.\n\nNotwithstanding the provisions of Subsection 3.1.3 of By-Law\nNumber 2001-129, and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the following exception be permitted with respect to the\nproperty located at Municipal Number 160 Dundas Street West:\n\ne The maximum width of the curb cut measured at the roadway to\nbe 12.0 metres.\n\n396 North Front Street (Shell Gas Station)\n\nNotwithstanding the provisions of Subsection 3.1.2 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the following\nexception be permitted with respect to the property located at Municipal\nNumber 396 North Front Street:\n\nThe maximum dimension of the driveways as measured at the street\nline to be 11.0 metres.\n\n31 Station Street\n\n1.\n\nNotwithstanding the provisions of Subsection 3.1.2 of By-Law\nNumiber 2001-129, and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the\nsame, the following exception be permitted with respect to the\nproperty at Municipal Number 31 Station Street:\n\ne The maximum dimension of the driveway as measured at the\nstreet line to be 30.0 metres.\n\nNotwithstanding the provisions of Subsection 3.1.3 of By-Law\nNumber 2001-129, and provided that the use of the parcel of land\n"
    },
    {
      "page_number": 64,
      "text": "49\n\nSchedule “A” to By-Law Number 2001-129\n\n99.\n\n100.\n\nexisting at the time of the passage of this By-Law remains the\nsame, the following exception be permitted with respect to the\nproperty at Municipal Number 31 Station Street:\n\ne The maximum width of the curb cut as measured at the street\nline to be 30.0 metres.\n\n93 Station Street (Stevens Motors)\n\nNotwithstanding the provisions of Subsections 3.1.2, 3.1.3 and 3.2.3.2 of\nBy-Law Number 2001-129, and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the same, the\nfollowing exceptions be permitted with respect to the property located at\nMunicipal Number 93 Station Street.\n\ne The maximum dimension of the driveway as measured at the street\nline to be 15.0 metres.\n\ne The maximum width of the curb cut measured at the roadway to be\n15.0 metres.\n\ne The distance from the nearest point on the curb opening to the\nprojected lateral property line as measured at the roadway edge to be\nnil.\n\n514 Sidney Street (Parkdale Baptist Church)\n\nNotwithstanding the provisions of Subsections 3.1.1, 3.1.2 and 3.1.3 of\nBy-Law Number 2001-129, and provided that the use of the parcel of land\nexisting at the time of the passage of this By-Law remains the same, the\nfollowing exceptions be permitted with respect to the property described\nbelow:\n\ne The maximum dimension of the driveways as measured at the street\nline to be 12.8 metres.\n\ne The maximum width of the curb cut measured at the roadway to be\n14.5 metres.\n"
    },
    {
      "page_number": 65,
      "text": "Schedule “A” to By-Law Number 2001-129 50\n\n101.\n\n102.\n\n103.\n\n355 Dundas Street West (Proposed Whitney Townhomes)\n\nNotwithstanding the provisions of Subsection 3.1.4 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the maximum width\nof curb opening at the roadway where curb returns are used shall be 18.5\nmetres with respect to the property located at Municipal Number 355\nDundas Street West.\n\nPart of Lots 36 and 37, Broken Front Concession, Township of Sidney,\nnow in the City of Belleville, County of Hastings, Plan 21R-18662.\n\n2173 Old Highway No. 2 (West City Honda)\n\nNotwithstanding the provisions of Subsection 3.1.4 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the maximum width\nof curb opening at the roadway where curb returns are used shall be 18.5\nmetres with respect to the property described below:\n\nPart of Lot 31, Broken Front Concession, formerly Township of Sidney,\nnow City of Belleville, County of Hastings, being Parts 1 and 3, 21R-3301.\n\n196 Palmer Road (Quinte Ballet School)\n\nNotwithstanding the provisions of Subsection 3.4.1 of By-Law Number\n2001-129, and provided that the use of the parcel of land existing at the\ntime of the passage of this By-Law remains the same, the minimum\nseparation of 4.0 metres at the edge of the road be allowed with respect to\nthe property described below:\n\nPart of Lots 36 and 37, Concession 1, formerly Township of Sidney, now\nCity of Belleville, County of Hastings.\n\n104. 420 College Street East (Nordenia Canada Limited)\n\nNotwithstanding the provisions of Subsection 3.1.4 of By-Law Number\n2001-129, and providing that the use of the parcel of land existing at\nthe time of passage of this By-Law remains the same, the following\nexception be permitted with respect to the property located at\nMunicipal Number 420 College Street East.\n\ne The maximum width at the edge of the roadway for industrial\nproperties to be 20.0 metres.\n"
    },
    {
      "page_number": 66,
      "text": "Schedule “A” to By-Law Number 2001-129 51\n\n105. 320 Sidney Street (Hitchon’s Physiotherapy)\n\nNotwithstanding the provisions of Subsection 3.2.3.2 of By-Law\nNumber 2001-129, and providing that the use of the parcel of land\nexisting at the time of passage of this By-Law remains the same, the\nfollowing exception be permitted with respect to the property located at\nMunicipal Number 320 Sidney Street.\n\ne« The minimum distance from the end of the curb cut to the projected\nlateral lot line at the edge of the roadway to be 0.0 metres.\n\n"
    },
    {
      "page_number": 67,
      "text": "SCHEDULE “B”\nTO BY-LAW NUMBER 2001-129\n\nDESIGNATED STREETS FOR ACCESS CONTROL\nAND ENTRACE GUIDELINES\n\nDESIGNATED STREETS FOR SECTION 15\n\nOld Highway 2 — Pointe Anne Road easterly to City Limits\n\nWallbridge Loyalist Road -— Old Highway 2 northerly to Moira Street West\nMoira Street West ~ Wallbridge Loyalist Road easterly to Palmer Road\nAirport Parkway — College Street East easterly to City Limits\n\nBlessington Road — Highway 37 easterly to City Limits\n\nSidney Street -— Bell Boulevard northerly to Vermilyea Road\n\nVermilyea Road — Highway 62 westerly to Sidney Street\n\nMudcat Road — Ashley Street easterly to Highway 37\n\n"
    }
  ]
}