{
  "file_name": "BL 2005-206 A Bylaw to Provide for the Licensing Regulation and Registration of Dogs.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\nBY-LAW NUMBER 2005-206\n\nA BY-LAW TO PROVIDE FOR THE LICENSING, REGULATION AND\nREGISTRATION OF DOGS, WITHIN THE CITY OF BELLEVILLE\n\nWHEREAS the Municipal Act, 2001 authorizes the Councils of municipalities to pass\nby-laws with respect to animals;\n\nAND WHEREAS City Council considers it advisable to pass such a by-law;\n\nNOW THEREFORE the Council of The Corporation of the City of Belleville enacts as\nfollows:\n\nTITLE\n\nThis By-Law may be referred to as the \"Animal Control By-Law\".\n\nSECTION 1\nDEFINITIONS\nFor the purpose of this by-law:\n\n“Control” means having at all times, the ability to manage, direct, restrict and restrain\nthe movements of a dog.\n\n“Corporation” shall mean The Corporation of the City of Belleville and City shall have\na corresponding meaning.\n\n“Dog” shall mean any member of the species Canis Familiars.\n\n“Domestic Animal” shall mean and include, a dog, a cat or other animal that is\nnormally kept as a household pet.\n\n“Domestic Fowl” shall mean and include, chickens, geese, ducks, turkeys and other\nsuch poultry and the young thereof, and also includes game birds as defined in\nthe Game and Fish Act.\n"
    },
    {
      "page_number": 2,
      "text": "By-Law Number 2005-206 Page 2\n\n“Dwelling Unit” shall mean a room or suite of two or more rooms designed or intended\nfor use by an individual or family in which culinary and sanitary conveniences are\nprovided for the exclusive use of such individual or family and with a private\nentrance from outside the building or from a common hallway or stairway inside,\nbut does not include a hotel, motel, boarding, rooming and/or lodging house,\nrecreational vehicle or mobile home.\n\n“Guide Dog” shall mean a dog professionally trained as a guide dog for a blind or\nvisually impaired person and having the qualifications prescribed by the\nregulations under the Blind Person's Rights Act; and shall also include a dog\nprofessionally trained as a guide dog for other physically disabled persons.\n\n“Injured” in respect of livestock or poultry shall mean injured by wounding, worrying or\npursuing. Injured and injuring shall have a corresponding meaning.\n\n“Kennel” shall mean premises other than a pet store, veterinary hospital or clinic,\nanimal shelter or property that is operating a legitimate fostering program for\ndogs or cats under the authority of the Society, in which the predominant activity\nconsists of the raising, boarding or training of dogs;\n\n“Leash” shall mean a restraining device of sufficient strength and material for holding a\ndog.\n\n“Leashed” shall mean a restraining device securely attached to the dog and the person\nor object.\n\n“Licence” for the purpose of this By-law shall be deemed to be the receipt issued by\nthe Treasurer of The Corporation of the City of Belleville or his authorized agent,\nupon payment of the appropriate tax or licence fee.\n\n“Medical Officer” shall mean the Medical Officer of Health for the Hastings and Prince\nEdward Counties Health Unit.\n\n“Municipal Law Enforcement Officer” shall mean a Police Officer, a Municipal Law\nEnforcement Officer for the City of Belleville or anyone acting under his authority.\n\n“Muzzle” shall mean a humane fastening or covering device of adequate strength over\nthe mouth to prevent a dog from biting and muzzled and muzzling have\ncorresponding meanings.\n\n“Owner” shall include any person who possesses or harbours dogs and owns or\nowned shall have a corresponding meaning and shall include the person or\npersons who are temporarily the keeper of dogs and, where the owner is a minor,\nthe person responsible for the custody of the minor.\n"
    },
    {
      "page_number": 3,
      "text": "By-Law Number 2005-206 Page 3\n\n“Person” shall mean any individual, firm, incorporated group, business entity or club to\nwhom the context can apply.\n\n“Police Work Dog” shall mean a dog trained to aid law enforcement officers and is\nactually being used for police work purposes for the protection of the public,\nincluding the investigation of crime and the apprehension of law violators.\n\n“Pound” shall mean such premises and facilities designated by The Corporation of the\nCity of Belleville as a City Pound.\n\n“Pound Keeper” shall mean a person, persons, association or society appointed by\nThe Corporation of the City of Belleville to maintain and administer the pound.\n\n“Restrained” shall mean being kept inside a building or house or in an enclosed pen of\nsufficient dimensions and strength to be humane or leashed to prevent a dog\nfrom coming in contact with persons other than the owner of the dog.\n\n“Running At Large” means, in the case of a dog, being in a place other than a\nproperty or premises owned or occupied by the owner of the dog and not under\nthe control of its owner or another person acting on behalf of its owner and “run\nat large” and “at large” shall have corresponding meanings. For clarification,\n\"property or premises owned or occupied by the owner\" includes any building,\nhouse, dwelling unit, commercial or industrial unit and any exclusively associated\nprivate outdoor space or accessory building but does not include common areas\nsuch as stairways, hallways, lobbies and common outdoor spaces such as those\nfound at apartment buildings, condominium and townhouse complexes and other\nsimilar residential, commercial or industrial developments.\n\n“Society” or “Humane Society” shall mean \"Quinte Humane Society\".\n“Under the control of its owner” means, in the case of a dog, being kept on a leash\nand leashed by its owner or by another person acting on the owner’s behalf;\n“Waste” shall mean:\ni) waste matter sent out from the body (excrement), or\nii) asolid waste matter sent from the body (faeces).\n\n‘Vicious Dog” shall mean a dog that, without provocation, has bitten a person,\ndomestic animal or domestic fowl.\n\n“Zoning By-Law” means a by-law passed under Section 34 of the Planning Act that\nrestricts the use of land.\n"
    },
    {
      "page_number": 4,
      "text": "By-Law Number 2005-206 Page 4\n\n2.1\n\n3.1\n\n3.2\n\n3.3\n\nSECTION 2\n\nGENERAL INTERPRETATION\n\nFor the purpose of this by-law:\n\ni)\n\nwords importing the singular number or the masculine gender only,\nincludes parties or things of the same kind and females as well as males\nand the converse.\n\nTHIS or other words importing the singular number, or the masculine\n\ngender only shall include more persons, parties or things of the same kind\nthan one, and females as well as males and the converse.\n\nSECTION 3\n\nLICENSING\n\nIt shall constitute an offence for an owner of a dog to fail to cause the dog to be\nregistered, numbered, described and licensed at City Hall of The Corporation, or\nsuch other place as may be designated by resolution of Council of The\nCorporation, annually on or before the 1°' day of January in each year.\n\ni)\n\nii)\n\nii)\n\nThe fee payable for each licence shall be in accordance with Schedule \"A\"\nof this by-law, as amended from time to time.\n\nFees shall increase as per Schedule \"A\" for a licence that is applied for\nafter the last day of March each year. This shall not be deemed to apply\nto dogs that fall under the provisions of Subsection 3.3. iii) of this Section.\n\nIt shall constitute an offence for an owner of a dog born in the City to fail to\nlicence and register the dog within three (3) months after its date of birth.\n\nIt shall constitute an offence for an owner of a dog to fail to licence and\nregister the dog within two (2) weeks of being brought into the City.\n\nWhere the owner of a dog to which this Section applies is not required to\nregister and licence that dog until after the 30\" day of September in\nany year, the fee payable shall be in accordance with Schedule \"A\" of this\nBy-Law.\n"
    },
    {
      "page_number": 5,
      "text": "By-Law Number 2005-206 Page 5\n\n3.4\n\n3.5\n\n3.6\n\n4.1\n\ni) a) On payment of the licence fee for a dog, the owner shall be\nfurnished with a dog tag bearing a serial number and the year in\nwhich it was issued.\n\nb) Unless a dog is being lawfully used for hunting in the bush, it shall\nconstitute an offence for any owner to fail to keep a dog tag\nsecurely fixed on the dog at all times until the tag is renewed or\nreplaced.\n\nii) It shall constitute an offence for any person to use a tag upon a dog other\nthan the dog for which it was issued.\n\nThe licence fee set out in Schedule \"A\" of this By-Law shall not apply to a dog\nprofessionally trained to aid or assist a disabled person, or a dog professionally\ntrained to assist a law enforcement agency, including dogs that are in the\nprocess of being professionally trained.\n\nAny person who is so required by The Corporation, or its authorized agent, shall\nforthwith deliver to The Corporation, or its authorized agent, a statement in\nwriting showing the number of male dogs, neutered male dogs, female dogs, and\n\nspayed female dogs owned by such person or which are habitually kept upon the\npremises for which such person is assessed as owner or otherwise.\n\nSECTION 4\nRESTRICTIONS\ni) Subject to Subsections ii and iii, it shall constitute an offence for any\nperson (or persons) to harbour more than a total of three (3) dogs in or\nabout any single dwelling unit.\n\nii) This Section does not apply to:\n\na) the operation of a kennel for the purposes of breeding or boarding\nanimals;\n\nb) an animal hospital owned and operated by a veterinarian licensed\nby the Ontario Veterinarian Association;\n\nc) a pet store;\n"
    },
    {
      "page_number": 6,
      "text": "By-Law Number 2005-206 Page 6\n\n5.1\n\n5.2\n\n5.3\n\n5.4\n\n5.5\n\n5.6\n\n5.7\n\nd) an Ontario Humane Society shelter, or the Pound, which complies\nwith the Zoning By-Laws of The Corporation of the City of Belleville,\nZoning By-Laws of the Township of Thurlow (as it was prior to\namalgamation on January 1, 1998) if applicable and Zoning By-\nLaws of the Township of Sidney (as it was prior to amalgamation on\nJanuary 1, 2000) if applicable.\n\niii) This section does not apply to dogs under the age of three (3) months.\n\nSECTION 5\nKENNELS\n\nNo person shall operate a kennel anywhere within the City unless he or she has\nfirst obtained a kennel license in accordance with this by-law.\n\nEvery application for a kennel license or for the renewal of such a license shall\nbe submitted to the City Clerk’s Department in the form provided by the City,\ntogether with the annual license fee, as set out in Schedule “A”.\n\nEvery application for a kennel license will be reviewed by the City to determine\nwhether it meets the requirements of this by-law and, as part of this review, may\nbe circulated to the Planning Department, Belleville Fire Department, Hastings &\nPrince Edward County Health Unit, Belleville Police, Quinte Humane Society,\nand a Municipal Law Enforcement Officer for comments.\n\nThese agencies and individuals, as part of their review, may require an\ninspection of the property, other than a room or place used as a dwelling.\n\nIf it is determined that an application meets the requirements of this by-law, the\nCity will issue the license if the license fee has been paid.\n\nIf it is determined that an application does not meet the requirements of this by-\nlaw, the City will refuse to issue the license and will refund the license fee.\n\nIf, at any time, the City determines, as a result of evidence that is provided, that\nthe operation of a kennel does not conform to the requirements of this by-law, it\nmay suspend or revoke the license.\n"
    },
    {
      "page_number": 7,
      "text": "By-Law Number 2005-206 Page 7\n\n5.8\n\n6.1\n\nA person is not eligible for a kennel license or the renewal of a kennel license\nunless:\n\ni)\n\nthe use or proposed use conforms with the zoning by-law that applies to\nthe property;\n\nthe property complies with the property standards by-law and any other\napplicable by-laws\n\nthe property conforms with all applicable law, including the Health\nProtection and Promotion Act, the Ontario Society for the Prevention of\nCruelty to Animals Act, and the Fire Protection and Prevention Act;\n\nthe property is kept in a clean and sanitary condition at all times; and\nevery dog that has reached the age of six months and that resides on the\n\nproperty permanently has been licensed pursuant to the requirements of\nthis by-law.\n\nSECTION 6\n\nPUBLIC NUISANCE\n\nNo owner shall cause or permit his or her dog to become a public nuisance by:\n\npersistently barking or howling;\ndamaging public or private property;\nscattering garbage or interfering with waste management activities;\n\npersistently barking at or chasing persons, vehicles, domestic animals,\ndomestic fowl, livestock, poultry, or other animals;\n\nswimming at a public beach, swimming or wading pool; or\n\nbeing in a public park or recreational area and not under the control of its\nowner.\n"
    },
    {
      "page_number": 8,
      "text": "By-Law Number 2005-206 Page 8\n\n7.1\n\n7.2\n\n8.1\n\n8.2\n\n8.3\n\n8.4\n\n8.5\n\n8.6\n\n8.7\n\nSECTION 7\nWASTE\n\nSubject to Subsection 7.2, it shall constitute an offence for any person to allow a\ndog to deposit waste (excrement/faeces) on private property or property of The\nCorporation unless such person immediately and entirely, without leaving the\nscene, causes such waste to be picked up and disposed of in an environmentally\napproved manner.\n\nSubsection 7.1 shall not apply to a guide dog while on a leash and actually in use\nproviding assistance to a disabled person.\n\nSECTION 8\nRUNNING AT LARGE\n\nNo owner shall cause or permit his or her dog to run at large, except within the\nconfines of the City operated Dog Park at Zwick's Park.\n\nEvery dog shall be under the control of its owner or another person acting on\nbehalf of the owner, at all times when on any property that is not owned or\noccupied by its owner.\n\n(deleted by By-law 2013-45)\n\nWhen directed by the Municipal Law Enforcement Officer, or anyone acting\nunder his authority to leash a dog, it shall constitute an offence for every person\nor owner of a dog who fails to maintain sufficient control of the dog, while off the\nproperty of the owner, to leash the dog so that it is securely attached to the\nperson in control of the dog.\n\nA Municipal Law Enforcement Officer may seize any dog running at large in the\nCity and cause such dog to be returned to the owner or impounded.\n\nAny owner who fails to claim a dog within the time period as set out by the\nregulations of the Humane Society shall forfeit all rights to ownership of that dog.\n\nAny owner of a dog that has been seized or impounded shall pay an amount in\naccordance with Schedule \"A\" prior to the release of the dog.\n"
    },
    {
      "page_number": 9,
      "text": "By-Law Number 2005-206 Page 9\n\n8.8\n\n8.9\n\n8.10\n\n8.11\n\n8.12\n\n8.13\n\n9.1\n\ni) Any owner of a dog that has been seized or impounded that has not\nobtained a dog licence for the current year shall purchase a licence before\nthe dog is released.\n\nii) Any dog impounded shall be taken to the pound facility of the Humane\nSociety.\n\nThe Municipal Law Enforcement Officer or anyone acting under his authority may\nkill any dog that he finds running at large if:\n\ni) he reasonably believes the dog is likely to cause imminent harm to any\nperson, dog, domestic animal, or domestic fowl; or\n\nii) the dog is injured or ill and he reasonably believes should be destroyed\nwithout delay for public safety and humane reasons.\n\nA dog shall not be considered to be running at large if it is a guide dog or a police\nwork dog.\n\nWhen a dog is known to have bitten a person the Medical Officer of Health may\norder the Municipal Law Enforcement Officer for the City to confine the dog under\nsupervised quarantine for a period not to exceed fourteen (14) days in\naccordance with Health Protection and Promotion Act Regulations.\n\nAny dog known to be rabid or suspected of being rabid shall be placed in\nquarantine, or with the permission of the Medical Officer of Health, it shall be\nkilled in such a manner that the brain is not damaged and the head shall be\nsubmitted to a laboratory for diagnosis.\n\nThe Municipal Law Enforcement Officer or anyone acting under his authority\nshall notify the Belleville Police Service prior to discharging a firearm. Should it\nnot be practical to contact the police first, they shall be contacted as soon as\npossible.\n\nSECTION 9\n\nDOG BITES\nUnless it is a police work dog, it shall constitute an offence for any person or\nowner of a dog fail to take all precautions necessary to prevent the dog from\n\nbiting or attacking any person or fighting, attacking, or biting any dog, domestic\nanimal or domestic fowl, whether on private or public property.\n"
    },
    {
      "page_number": 10,
      "text": "By-Law Number 2005-206 Page 10\n\n9.2\n\n10.1\n\n10.2\n\ni)\n\nWhen a dog has bitten or attacked a person, or fought with, bitten or\nattacked a dog, domestic animal or domestic fowl, the owner shall cause\nthe dog to remain muzzled or leashed until such time as the incident has\nbeen reviewed by the Municipal Law Enforcement Officer. The Municipal\nLaw Enforcement Officer, as a result of his review may:\n\na) exempt the owner from the muzzling or leashing requirement;\n\nb) rule that the dog is a vicious dog, whereby the owner must comply\nwith Section 10 of this by-law if in the opinion of the Officer, the dog\nhas fought, bitten or attacked without provocation; or\n\nc) commence proceedings under the Dog Owner's Liability Act,\nwhereby at the discretion of a Judge, penalties ranging from a fine\nto an order to destroy the dog, may be imposed.\n\nIf the Municipal Law Enforcement Officer requires that a dog be leashed\nand/or muzzled after biting a person, dog, domestic animal, or domestic\nfowl, the owner of the dog may request and is entitled to a hearing by the\ncouncil or a committee thereof or the animal control official of the\nmunicipality if so delegated by council, which or who may exempt the\nowner from the muzzling or leashing requirement, or both.\n\nSECTION 10\n\nVICIOUS DOGS\n\nSubject to Subsection 10.10, when not in the owner's dwelling unit but otherwise\nwithin the boundaries of the owner's lands, it shall constitute an offence for the\nowner of a vicious dog to fail to ensure the dog is secured in accordance with\nSubsections 10.1 i) and 10.2 ii) so as to prevent the dog from causing injury to\nany person, dog, domestic animal or domestic fowl.\n\ni)\n\nThe vicious dog shall be located wholly within a fenced area and any gate\nin such fenced area shall be locked at all times when the vicious dog is in\nthe fenced area.\n\nWhen the vicious dog is kept in an enclosed run or pen, such run or pen\nshall be enclosed on all four (4) sides and its top shall be of material of the\nsame or greater strength than that of the sides.\n\nSubject to Subsection 10.10, it shall constitute an offence for an owner to fail to\nensure that any person who is left with the charge of a vicious dog is fully\ncapable of controlling the dog.\n"
    },
    {
      "page_number": 11,
      "text": "By-Law Number 2005-206 Page 11\n\n10.3\n\n10.4\n\n10.5\n\n10.6\n\n10.7\n\n10.8\n\n10.9\n\nSubject to Subsection 10.10, when the dog is outside the boundaries of its\nowner's land, it shall constitute an offence for an owner of a vicious dog to fail to\nensure that at all times the dog is leashed and muzzled so as to prevent it from\nbiting.\n\nSubject to Subsection 10.10, it shall constitute an offence for a person to operate\na kennel containing a vicious dog except as permitted in Subsection 10.5.\n\nA vicious dog may be temporarily kept in a kennel that has been licensed under\nthis by-law while the kennel is providing any of the services listed herein:\n\ni) boarding iii) training\nii) | grooming iv) medical attention\n\nSubject to Subsection 10.10, it shall constitute an offence for any person to\npermit a vicious dog to attack or bite any person, or to attack, bite or fight with\nany dog, domestic animal or domestic fowl.\n\nSubject to Subsection 10.10, it shall constitute an offence for every owner of a\nvicious dog to fail to inform the Municipal Law Enforcement Officer that the dog is\nvicious when a licence is being applied for.\n\nSubject to Subsection 10.10, it shall constitute an offence for an owner or\nimmediately previous owner of a vicious dog to fail to inform the Municipal Law\nEnforcement Officer of the change of ownership within fourteen (14) days of the\ntransfer of the vicious dog from one owner to another.\n\nSubject to Subsection 10.10, it shall constitute an offence for the owner of a\nvicious dog to fail to post a sign in a conspicuous place on his property stating\nthat there is a vicious dog on the premises.\n\n10.10 This section shall not apply to police work dogs.\n\n11.1\n\nSECTION 11\nADMINISTRATION\n\nThis by-law shall be administered by The Corporation of the City of Belleville.\n"
    },
    {
      "page_number": 12,
      "text": "By-Law Number 2005-206 Page 12\n\n12.1\n\n12.2.\n\n13.1\n\nSECTION 12\nVIOLATIONS AND PENALTIES\n\nEvery person who contravenes any provision of this by-law is guilty of an offence\nand upon conviction is liable to a fine, as provided for in the Provincial Offences\nAct, RSO 1990, Chapter P.33, as amended.\n\nUpon registering a conviction for a contravention of any provision of this by-law,\nthe Ontario Court of Justice may, in addition to any penalty imposed by this By-\nLaw, make an order prohibiting the continuation or repetition of the offence by the\nperson convicted.\n\nSECTION 13\nVALIDITY\nTHAT By-Law Numbers 99-82, 99-147 and 2001-63 and all amendments thereto\n\nare hereby rescinded and all by-laws or parts of by-laws inconsistent with the\nprovisions of this By-Law are hereby rescinded.\n\nTHIS BY-LAW SHALL COME INTO FORCE AND TAKE EFFECT IMMEDIATELY ON\nAND AFTER THE PASSING THEREOF.\n\nRead a first time this 12\" day of December 2005.\nRead a second time this 12\" day of December 2005.\n\nRead a third time and finally passed this 12\" day of December 2005.\n\nMary-Anne Sills\nMARY-ANNE SILLS MAYOR\n\nWayne B Tod\nWAYNE B. TOD CITY CLERK\n"
    },
    {
      "page_number": 13,
      "text": "By-Law Number 2005-206 Page 13\n\nSCHEDULE A TO BY-LAW 2005-206 AS AMENDED\n\nCity of Belleville Dog Tag and Impound Fees\n\nType of Dog Licence Fee\nKennel $60.00\nOwner of a kennel for purebred dogs duly registered in the registry of the\nCanadian Kennel Club and holding a current kennel licence\nMale or Female Dog\n- Tag purchased during December in the year preceding the year of the tag $25.00\n- Tag purchased during the year of tag $32.50\nSpayed or Neutered Dog (See Special Provision 1)\n- Tag purchased during December in the year preceding the year of the tag $20.00\n- Tag purchased during the year of tag $27.50\nSenior Citizen Rates - Owner over age sixty-five\nFirst Male or Female Dog\n- Tag purchased during December in the year preceding the year of the tag $15.00\n- Tag purchased during the year of tag $22.50\nEach Spayed or Neutered Dog (See Special Provision 1)\n- Tag purchased during December in the year preceding the year of the tag $10.00\n- Tag purchased during the year of tag $15.00\nReplacement Fee for Lost Tag $5.00\nReplacement fee for licencing new dog to replace deceased dog $5.00\nImpound Fee\nImpound fee is to be increased by $25.00 for each repeat offence to a $50.00\n\nmaximum of $100.00\n\nSpecial Provisions\n\n1. Veterinarian’s Certificate is necessary to certify that dogs have been spayed or\n\nneutered and immunized.\n\n2. The owner of a properly certified guide dog shall not be required to obtain a tag for\n\nsuch dog.\n\n3. The tag fee for dogs registered in accordance with the terms of the By-law after\n\nSeptember 30\" shall be 50% of the fees specified above.\n\n"
    }
  ]
}