{
  "file_name": "BL 2019-169 A Bylaw to Regulate the Operation of All-terrain Vehicles on Municipal Highways.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "CORPORATION OF THE CITY OF BELLEVILLE\nBY-LAW NUMBER 2019-169\n\nBEING A BY-LAW TO AMEND BY-LAW NUMBER 2017-156, A BY-LAW TO\nREGULATE THE OPERATION OF ALL-TERRAIN VEHICLES ON MUNICIPAL\nHIGHWAYS WITHIN THE CITY OF BELLEVILLE\n\nWHEREAS By-Law Number 2017-156 was duly passed by the Council of The\nCorporation of the City of Belleville on the 23\" day of October, 2017;\n\nAND WHEREAS it is now deemed to be necessary and expedient that By-Law\nNumber 2017-156 be amended;\n\nNOW THEREFORE THE COUNCIL OF THE CORPORATION OF THE CITY OF\nBELLEVILLE HEREBY ENACTS AS FOLLOWS:\n\nThat Part IV General be amended by deleting the following:\n\n1 Operation of ATV's shall be subject to the provisions of this by-law and in\naccordance with Ontario Regulation 316/03, as amended by O. Reg\n135/15, of the Highway Traffic Act and the Off Road Vehicles Act, as\namended.\n\n2 Operation of ATV's shall be excluded on the following highways in the City\nof Belleville:\n\na. All City of Belleville highways located in the area as shown on\nSchedule ‘A” appended hereto.\n\n3 Schedule \"A\" appended hereto shall be deemed to be a part of this by- law\nto the same extent and effect as if incorporated herein.\n\nThat Part IV General be amended by adding the fotlowing:\n\n1 Operation of ATV's shall be subject to the provisions of this by-law and in\naccordance with Ontario Regulation 316/03, as amended by O. Reg\n135/15, of the Highway Traffic Act and the Off Road Vehicles Act, as\namended.\n\n2 Operation of ATVs shall be excluded on the following highways in the City\nof Belleville:\n"
    },
    {
      "page_number": 2,
      "text": "By-law Number 2019-169 Page 2\n\na. All City of Belleville highways located in the area identified as\nArea A, as shown on Schedule “A” appended hereto.\n\nb. All City of Belleville highways located in the area identified as\nArea B as shown on Schedule “A” appended hereto except when\nexplicitly for the purpose of ATVs travelling directly to and from the\nEastern Ontario Trail located on Cannifton Road.\n\n3 Schedule \"A\" appended hereto shall be deemed to be a part of this by- law\nto the same extent and effect as if incorporated herein.\n\nTHIS BY-LAW SHALL COME INTO FORCE AND TAKE EFFECT IMMEDIATELY ON\nAND AFTER THE PASSING THEREOF.\n\nRead a first time this 9\"\" day of September 2019.\nRead a second time this 12 day of November 2019.\nRead a third time and finally passed this 12\" day of November 2019.\n\nCITY CLERK\n"
    },
    {
      "page_number": 3,
      "text": "6Loz isn6ny\n\n= : = , =\nwo\naquynG fo Sog Sees bi\ng\n: Bs\n. « 3 aé\noz\n5 = AVEO GTS “ARNG NWS. | Fy <=>\nQt ie = KL! L° ; Si&\ny=) |\\\\e a @ AU r Bre |\nz ia is Hd rs\ng -~ oh\nis}\n: A\n“i aa : AIS aR :\nCU TaEINV \\ P Cf a {\n> \"BR Avoid LEON ia aa = |\né 2 } ——\ni _ eee — i zm\n318495 i s =| les BS m™\n{ 3 bases\n= oan\n= 3 _ 1\nZ or 4\n: one Tia\n= . NM {\naN | H i\n= t — i\na it\nto a vauv-Al [FJ\n-om\n2 1 =\nEl S\\2_Je v vauv-Alw EJ\n= = : =\n: - bole |\nos Za rd pi\nbal jz\nee Sig SVAN ALY\n3 3 - ely ities\ni 5 eu, @« amas ag\nis 4 / = q\nP f \\ 10 3gvCONINNETS\nY al i\n~ oan om\n\nOa 2s\n"
    },
    {
      "page_number": 4,
      "text": "CORPORATION OF THE CITY OF BELLEVILLE\nBY-LAW NUMBER 2017-156\n\nBEING A BY-LAW TO REGULATE THE OPERATION OF ALL-TERRAIN\nVEHICLES ON MUNICIPAL HIGHWAYS WITHIN THE CITY OF BELLEVILLE\n\nWHEREAS pursuant to Section 191.8(3) of the Highway Traffic Act, R.S.O.,\n1990, Chapter H8, as amended, the Council of a municipality may pass by-laws:\n\n1. permitting the operation of off-road vehicles with low pressure bearing tires\non any highway within the municipality that is under the jurisdiction of the\nmunicipality, or any part or parts of such highway;\n\n2. prescribing a lower rate of speed for All-Terrain Vehicles by regulation on\nany highway within the municipality that is under its jurisdiction , or on any\npart or parts of such highway including prescribing different rates of speed\nfor different highways or parts of highways;\n\nNOW THEREFORE THE COUNCIL OF THE CORPORATION OF THE CITY OF\nBELLEVILLE HEREBY ENACTS AS FOLLOWS:\n\nI. Title\nThis By-law shall be entitled the \"ATV By-law”.\ni Definitions\n\n“All-Terrain Vehicle (ATV)\" means an off-road vehicle as defined in O. Reg.\n316/03 , as amended by O. Reg 135/15, under the Highway Traffic Act entitled\n\"Operation of Off Road Vehicles on Highways\"; and for the purposes of this by-\nlaw, All-Terrain Vehicle shall also include Multipurpose Off-Highway Utility\nVehicle and Recreational Off-Highway Vehicle as defined in O. Reg 316/03, as\namended by O. Reg 135/15, under the Highway Traffic Act entitled “Operation of\nOff-Road Vehicles on Highways\".\n\n\"Highway\" includes a common and public highway, street, avenue, parkway,\ndriveway, any part of which is intended for use or used by the general public for\nthe passage of vehicles and includes the area between the lateral property lines\nthereof.\n\nMulti-Purpose Off-Highway Utility Vehicle means an off-road vehicle as\ndefined in O. Reg 316/03, as amended by O. Reg 135/15, under the Highway\nTraffic Act entitled \"Operation of Off-Road Vehicles on Highways”.\n"
    },
    {
      "page_number": 5,
      "text": "By-law Number 2017-156\n\nPage 2\n\n\"Off-Road Vehicle\" means an off-road vehicle within the meaning of the\nHighway Traffic Act, Ontario Regulation 316/03 — Operation of Off Road Vehicles\n\non Highways.\n\nRecreational Off-Highway Vehicle means an off-road vehicle as defined in\nO. Reg 316/03, as amended by O. Reg 135/15, under the Highway Traffic Act\nentitled “Operation of Off-Road Vehicles on Highways\".\n\nI. Regulation Of All-Terrain Vehicles On Highways\n\n1)\n\nNo person shall operate an All-Terrain Vehicle on a highway under\nmunicipal jurisdiction unless it meets the equipment requirements of\nSections 7 to 15 of O. Reg. 316/03, as amended by O. Reg 135/15\nand it is operated in accordance with Sections 16 to 24 of 0. Reg.\n316/03, as amended by O. Reg 135/15.\n\nNo person shall operate an All-Terrain Vehicle at a rate of speed\ngreater than:\n\ni) 20 kilometers per hour, if the speed limit established under the\nHighway Traffic Act or by Municipal By-law for that part of the\nhighway is not greater than 50 kilometers per hour, or\n\nii) 50 kilometers per hour, if the speed limit established under the\nHighway Traffic Act or by Municipal By-law for that part of the\nhighway is greater than 50 kilometers per hour.\n\nIV. General\n\n1,\n\nOperation of ATV's shall be subject to the provisions of this by-law and\nin accordance with Ontario Regulation 316/03, as amended by O. Reg\n135/15, of the Highway Traffic Act and the Off Road Vehicles Act, as\n\namended.\n\nOperation of ATV's shall be excluded on the following highways in the\nCity of Belleville:\n\na) All City of Belleville highways located in the area as shown on\nSchedule ‘A” appended hereto.\n\nSchedule \"A\" appended hereto shall be deemed to be a part of this by-\nlaw to the same extent and effect as if incorporated herein.\n"
    },
    {
      "page_number": 6,
      "text": "By-law Number 2017-156 Page 3\n\nV. Penalties\n\nAny person who contravenes any section of this By-law is guilty of an\noffence and upon conviction is liable to such fines and penalties as are\nprovided for in the Provincial Offences Act, R.S.O. 1990, c.P-33, as\namended\n\nVi. = Validity\nIf any provision or requirement of this By-law or the application thereof to\nany person shall to any extent be held to be invalid or unenforceable, the\nremainder of this By-law or the application of such provision or requirement\nto all persons other than those to which it is held to be invalid or\nunenforceable shall not be affected thereby and is hereby declared to be\nthe intention of Council that each provision and requirement of this By-law\nshall be separately valid and enforceable to the fullest extent permitted by\nlaw.\n\nVil. Effect And Force\nThis By-law shall come into force and take effect upon the final passing\nthereof.\n\nRead a first time this 28\"\" day of August 2017.\n\nRead a second time this 23 day of October 2017.\n\nRead a third time and finally passed this 23\" day of October 2017.\n\nVv\n\nTASO GHRIST@PHER MAYOR\n\nLD CITY CLERK\n"
    },
    {
      "page_number": 7,
      "text": "2102 SNAC\n\n: Pepnexs spLy-eaiy entvetog FJ\nANN LA vdad SADIANTS <\n\nANSNdOTSARC ® ONRIZENIONS eae,\n\nATVIAATITAIA JO ALIO ash\n\nVauV G3qnN19xX4a - ALY\n\nR= WMHOIH fale)\n\ncA\n\nGY LSIMWAOTSADCINETIVM\n\nMIS VuIOW\n\n“ZS 1s sos TIONS |\n\n=\nm\nn\n=\n2\nwo\nfo}\nze)\n\ny ay NOISNISSSIg— =\n\nNX\n\nGuy NOLONINYVH\n"
    }
  ]
}