{
  "file_name": "BL 2011-206 A Bylaw to Prohibit Debris on Private or Minicipal Property.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\n\nBY-LAW NUMBER 2011-206\n\nBEING A BY-LAW TO PROHIBIT THE THROWING, PLACING OR\nDEPOSITING OF DEBRIS ON PRIVATE OR MUNICIPAL PROPERTY\nWITHIN THE CITY OF BELLEVILLE\n\nWHEREAS the Municipal Act, 2001 provides that a local Municipality may pass by-laws on\nmatters dealing with the economic, social and environmental well being of the municipality;\n\nAND WHEREAS it is deemed desirable and expedient to prohibit the throwing, placing or\ndepositing of refuse or debris on property within the Municipality without authority from the\nowner or occupant of such property;\n\nNOW THEREFORE the Council of the corporation of the City of Belleville enacts as follows:\n\nShort Title\n\n1.\n\nDefinitions\n\n2.\n\n(a)\n\n(b)\n\n(c)\n(d)\n\nThis By-law may be referred to as the “Littering By-law”.\n\nIn this By-law:\n\n“debris” means all waste, garbage, litter, rubbish, material, refuse, discarded paper\nor wrappers, cigarette butts and any other discarded or abandoned commodities of\nany kind whatsoever and without limiting the generality of the foregoing includes\na motor vehicle that appears by reason of its age, appearance, mechanical\ncondition or lack of licence plates to be inoperative, inoperative mechanical\nequipment, automotive and mechanical parts, disused furniture, old clothing,\ngarden refuse, earth or rock fill, old or decayed lumber, material from\n\nconstruction or demolition projects and other vehicles, machinery equipment,\nmaterials or structures apparently disused in their existing location;\n\n“private property” means those buildings, structures, lands and premises within\nthe City of Belleville that are not owned or occupied by the City;\n\n“City” means the Corporation of the City of Belleville;\n“City property” includes:\n\n@) buildings and structures within the City of Belleville of which the City is\nthe owner, lessee or licensee; and\n"
    },
    {
      "page_number": 2,
      "text": "By-law Number 2011-206 Page 2\n\n(e)\n\n()\n(g)\n\n(h)\n\n(ii) lands and premises within the City of Belleville of which the City is the\nregistered owner, lessee or licensee; and\n\n(iii) lands and/or premises within the City of Belleville the ownership of which\nhas been vested in the City through statute or otherwise; and\n\nwithout limiting the generality of the foregoing, includes those roads and road\nallowances under the jurisdiction of the City whether open or closed.\n\n“Owner” includes an occupant, lessee, tenant, mortgagee in possession, and the\nperson in charge of the property;\n\n“Person” includes a corporation and an owner;\n\n“Municipal Law Enforcement Officer” means a Municipal Law Enforcement\nOfficer appointed by the City;\n\n“Receptacle” means any barrel, bin, dumpster or other device placed on property,\nby the owner of such property, for the disposal of debris.\n\nNo person shall throw, dump, place, deposit or cause or permit to be thrown, dumped,\nplaced or deposited debris on private property without authority from the owner or\noccupant of such property.\n\nNo person shall throw, dump, place, deposit or cause or permit to be thrown, dumped,\nplaced or deposited debris on City property without authority from the City.\n\nNo owner of any property in the City of Belleville on which any debris of any kind has\nbeen or may hereafter be thrown, dumped, placed or deposited, shall fail to forthwith\nremove the same.\n\nNo person shall place debris in a receptacle which is not owned by the City except with\nthe consent of the owner of such receptacle.\n\nNo person shall deposit any debris, generated at a residence, institution or place of\nbusiness, in a receptacle owned by the City except with the consent of the City.\n\nNo person shall permit debris to be blown or otherwise transferred or conveyed from the\nproperty occupied by him or her on to any lane, street, creek, water course, roadway or\nother property in the City.\n"
    },
    {
      "page_number": 3,
      "text": "By-law Number 2011-206 Page3\n\nExemptions\n\n9. Sections 3 and 4 of this By-law shall not apply to the following:\n\n(a) Where, in the normal course of waste collection, a person deposits acceptable\ndebris on a highway or on land owned by the Municipality in compliance with the\nprovisions of applicable by-laws respecting garbage and waste collection;\n\n(b) Where, in the course of engaging in home composting, a person deposits grass,\ntree trimmings and prunings, garden waste and other vegetable matter in a home\ncomposter;\n\n(c) Where, during the course of construction on a property, construction materials\n\nincluding excavated material or fill are stored on that property.\n\nSeverability\n\n10. If any section of this By-law may be found by any court of law to be illegal or beyond the\npower of Council to enact, such section shall be deemed to be severable and all other\nsections of this By-law shall be deemed to be separate and independent therefrom.\n\nEnforcement\n\n11. The provisions of this By-law shall be enforced by a Municipal Law Enforcement\nOfficer, Police Officer or other individual duly appointed by the City for the purpose of\nenforcing this By-law.\n\n12. Subject to the provisions of Section 13 of this by-law, wherever this by-law directs or\nrequires anything to be done, in default of it being done by the person directed or\nrequired to do it, such thing may be done under the direction of a Municipal Law\nEnforcement Officer at the expense of such person and the City may recover the expenses\nincurred in doing it by action or the same may be recovered in like manner as municipal\ntaxes.\n\n13. At least seven days before proceeding under Section 12, the Municipal Law Enforcement\nOfficer shall give written notice to the owner of the property informing the owner of his\nor her intention to proceed, which notice may be either delivered to the owner in person\nor sent by prepaid ordinary mail to the owner at the address shown for him or her on the\nlast revised assessment roll and such mailing of the notice shall be deemed to be good\nand sufficient delivery of the same to the owner.\n"
    },
    {
      "page_number": 4,
      "text": "Penalties\n\n14. Any person who violates any provisions of this By-law is, upon conviction, guilty of an\noffence and shall be liable to such penalties prescribed by the Provincial Offences Act,\nR.S.O. 1990, ¢.P.33. Each day that such offence is committed, or permitted to continue,\nshall constitute a separate offence and may be punishable as such.\n\n15. Where a conflict arises between the provisions of this By-law and any other By-law of\n\nthe City the more stringent provisions shall apply.\n\nREAD A FIRST, SECOND AND THIRD TIME/AND FINALLY PASSED THIS 12\" DAY\nOF DECEMBER , 2011.\n\nMayor\n\nie Oram Clerk\n"
    },
    {
      "page_number": 5,
      "text": "PEWIHSS B ‘9OZ-T1OZ MO-Ag JO 7 | UOYD@S Ul POUID{UODS $| BAOGD Paipdipul! seoUSjo Jy (s)UO!sIAOI AyJOUSd ey\n\n*‘Pd|E U@Eq SoU YoIYUM jo Adoo\n\nT3JON\n\n00°00z$ B'S | SSUINODIOJ{OM/1994S/PUD] Of PSUS|SUBI/UMO|Q Sq Oj SUGSP jeg 8\nJUSSUOD [NOULIM\n00°00¢$ £S B[O_jA8991 AIID Ul SUGEP SsoUISNG/JOUOINIYSUI/|OYUSPISO1 BODI|g Z\n00'00z¢ oS {UBSUOD JNOUUM BOO} ded9i ul suqap Song 9\n00°00z¢ ss Apiedoid Woly SUGeP SAOUISI OF [ID] IOUMO S\n00°00z$ vs AWOULND {NOU ApSdoid AD Uo suqap Jo ysodep jue v\n00°00z$ vs MUOULND |NOUPM ALiodoid AUD UO suqap ys6daq €\n00°00z$ es AWLOUIND JNOUUM ALedold S|DANd US SiGap Jo yisodap pluie, z\n00°00Z$ es AJUOUIND jNouLM Aedoid SpOAUC UO suqap fisodeq Ll\naauayO Buluyeaq\nauld jes Jo Buypalsd uoisiAolg Bulpio,, Wo ous Wall\n€ NWNIOD éNWNIOS LNWNIOD\n\nSTASI JO AUD Sus UY Apedodd jDdIoUNW 40 ayDALG\nUO sLiqeg Jo Buyisodag Jo Bulanjg ‘Buimoiyy dy; fiqiyolg Of MO]-Ag b Bulag ‘S0Z-L10e # MOI-Ag\n\nLDV SSDN3ddO TVWIDNIAOUd ‘L Lud\n\nATHARTIAG JO ALID AHL IO NOWWYOdYOD AHL\n\nJINGIHOS ANI 13S\n\n"
    }
  ]
}