{
  "file_name": "BL 2013-45 A Bylaw to amend BL 2005-206 Dogs running at large.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\n\nBY-LAW NUMBER 2013-45\n\nA BY-LAW TO AMEND BY-LAW NUMBER 2005-206, BEING A BY-LAW TO PROVIDE FOR\nTHE LICENSING, REGULATION AND REGISTRATION OF DOGS, WITHIN THE CITY OF\n\nBELLEVILLE\n\nWHEREAS the Municipal Act, 2001 authorizes the Councils of Municipalities to pass by-laws\nwith respect to animals;\n\nAND WHEREAS Council of the City of Belleville deems it advisable to amend by-law number\n2005-206, the Animai Control By-law;\n\nNOW THEREFORE THE COUNCIL OF THE CORPORATION OF THE CITY OF BELLEVILLE\nENACTS as follows:\n\n1. The definition of Running at large in Section 1 of by-law 2005-206 as amended is hereby\ndeleted and the following definition for Running at Large is inserted in its place:\n\n“Running At Large means, in the case of a dog, being in a place other than a property or premises\nowned or occupied by the owner of the dog and not under the control of its owner or another person\nacting on behalf of its owner and “run at large” and “at large” shall have corresponding meanings.\nFor clarification, “property or premises owned or occupied by the owner\" includes any building,\nhouse, dwelling unit, commercial or industrial unit and any exclusively associated private outdoor\nspace or accessory building but does not include common areas such as stairways, hallways,\nlobbies and common outdoor spaces such as those found at apartment buildings, condominium\nand townhouse complexes and other similar residential, commercial or industrial developments.”\n\n2. Section 8.1 of by-law 2005-206 as amended is hereby deleted and the following inserted\nin its place:\n\n“8.1 No owner shall cause or permit his or her dog to run at large, except within the confines of the\nCity operated Dog Park at Zwick's Park.”\n\n3. Section 8.3 of By-law 2005-206 as amended is hereby deleted.\n\nTHIS BY-LAW SHALL COME INTO FORCE AND TAKE EFFECT IMMEDIATELY ON AND\nAFTER THE PASSING THEREOF.\n\nRead a first time this 25\" day of March 2013.\nRead a second time this 25\" day of March 2013.\n\nRead a third time and finally passed this 25\" diy of Ta\n\nNEIL EMIS” MAYOR\n\nMATT MACDONALD = ACTING CITY CLERK\n"
    }
  ]
}