{
  "file_name": "BL 2010-88 Construction Demolition and Change of Use.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\nBY-LAW NO. 2010-88\nA BY-LAW RESPECTING CONSTRUCTION, DEMOLITION AND CHANGE OF USE\nPERMITS AND INSPECTIONS\n\nBY-LAW INDEX\n\nPart ‘I\nDEFINITIONS\n11 Definitions\n1.2 Word - term - not defined - meaning\nPart 2\n\nCLASSES OF PERMITS — OTHER APPROVALS\n\n2.1 Set out - Schedule \"A\"\n2.2 Conditional Permits\n2.3 Other Approvals\nPart 3\nPERMITS\n3.1 File application on forms prescribed\n3.2 Information - submitted - to Chief Building Official\n3.3 Partial Permits - Requirements\n3,4 Partial Permits- Limitations\n3.5 Inactive Permit Application\nPart 4\n\nPLANS AND SPECIFICATIONS\n\n4.1 Information - sufficient - to determine conformity\n4.2 Two complete sets - required - unless specified\n\n4.3 Plans - drawn to scale - on durable material - legible\n4.4 Site plans - referenced - to plan of survey\n\n4.5 As Constructed Plans\n\n4.6 Building Location Survey\n\n4.7 Plans property of Corporation\n"
    },
    {
      "page_number": 2,
      "text": "By-Law Number 2010-88\n\n5.1\n5.2\n\n6.1\n6.2\n6.3\n\n7.1\n7.2\n7.3\n\n8,1\n8.2\n8.3\n\n9.1\n9.2\n9.3\n9.4\n\n10.1\n\n11.1\n\nPart 5\nRegistered Code Agencies\n\nRegistered Code Agency — hired — by Chief Building Official\nDuties of Registered Code Agency\n\nPart 6\nFEES AND REFUNDS\n\nDue - payable - upon application - Schedule \"A\"\nWork without permit\nRefunds\n\nPart 7\nTRANSFER OF PERMITS\n\nApplication - completed - by new owner\nFee - Schedule \"A\"\nNew owner - permit holder - upon transfer\n\nPart 8\nREVOCATION OF PERMITS\n\nNotice of Revocation\nDeferral of Revocation\n\nFee for Deferral\n\nPart 9\n\nNOTICE REQUIREMENTS FOR INSPECTIONS — APPOINTED DESIGNATE\n\nNotice - each stage - to Chief Building Official\nEffective - when received - by Chief Building Official\nTime periods — inspections\n\nAppointed Designate\n\nPart 10\nCODE OF CONDUCT\nApplicability\nPart 11\nVALIDITY\nSeverability\nPart 12\n\nCONTRAVENTION OF BY-LAW - OFFENCE\n\nOffence\n"
    },
    {
      "page_number": 3,
      "text": "By-Law Number 2010-88\n\n13.1\n13.2\n13.3\n\nSchedule \"A\"\nSchedule \"B\"\nSchedule \"C\"\n\nPart 13\nREPEAL - ENACTMENT\n\nBy-law previous\nShort Title\nEffective Date\n\nSCHEDULES\n\nClasses of Permits and Fees\nRequired Plans\nPrescribed Forms\n"
    },
    {
      "page_number": 4,
      "text": "By-Law Number 2010-88\n\nBUILDING BY-LAW\n\nBY-LAW NO. 2010-88\n\nA BY-LAW RESPECTING CONSTRUCTION, DEMOLITION AND CHANGE OF USE PERMITS\nAND INSPECTIONS\n\nWHEREAS section 7 of the Building Code Act, 1992, S.0. 1992, Chapter 23 as amended,\nempowers Council to pass certain by-laws respecting construction, demolition and change of use\npermits and inspections and the setting and refunding of fees;\n\nTHE COUNCIL OF THE CORPORATION OF THE CITY OF BELLEVILLE therefore\nENACTS as follows:\n\n1. DEFINITIONS:\n\nIn this by-law:\n\n1.1 \"Act\" means the Building Code Act, 1992, S.O. 1992, c.23, as amended.\n\"applicant\" means the owner of a building or property who applies for a permit or\nany person authorized by the owner to apply for a permit on the owner's behalf, or\nany person or Corporation empowered by statute to cause the construction or\ndemolition of a building or buildings and anyone acting under the authority of such\n\nperson or Corporation.\n\n\"architect\" means the holder of a license, certificate of practice or a\ntemporary licence issued under the Architects Act as defined in the Building Code.\n\n\"Building Code\" means the regulations made under section 34 of the Act.\n\"Chief Building Official\" means the Chief Building Official appointed by\nby-law by the Corporation of the City of Belleville for the purposes of\nenforcement of the Act.\n\n\"construct\" means construct as defined in subsection 1(1) of the Act.\n\"Corporation\" means the Corporation of the City of Belleville.\n\n\"demolish\" means demolish as defined in subsection 1(1) of the Act.\n\n\"designer\" means an Architect, Engineer or designer qualified to carry out\ndesigns under the requirements of Bill 124.\n"
    },
    {
      "page_number": 5,
      "text": "By-Law Number 2010-88\n\n\"inspector\" means an inspector appointed by by-law by the Corporation of the City\nof Belleville for the purposes of enforcement of the Act.\n\n\"owner\" means the registered owner of the property and includes a\nlessee, mortgagee in possession, and the authorized agent in lawful control\nof the property.\n\n\"permit\" means permission or authorization given in writing from the Chief\nBuilding Official to perform work, to change the use of a building or part\nthereof, or to occupy a building or part thereof, as regulated by the Act and\nBuilding Code.\n\n\"permit holder\" means the owner to whom a permit has been issued or\nwhere a permit has been transferred, the new owner to whom the permit\nhas been transferred.\n\n\"professional engineer or \"engineer means a person who holds a licence or\ntemporary licence under the Professional Engineers Act, as defined in the Building\nCode,\n\n\"Registered Code Agency\" means a registered code agency as defined in\nsubsection 1(1) of the Act.\n\n\"sewage system\" means a sewage system as defined in subsection 1(1) of\nthe Act.\n\n\"work\" means construction or demolition of a building or part thereof, as the case\nmay be.\n\n1.2 Word - term - not defined - meaning\nAny word or term not defined in this by-law, that is defined in the Act or.Building\nCode shall have the meaning ascribed to it in the Act or the Building Code.\n2. CLASSES OF PERMITS — OTHER APPROVALS:\n2.1 Set out — Schedule \"A\"\nThe classes of permits set out in Schedule \"A\" of this By-law are hereby established,\n2.2 Conditional Permits\n\nThe Chief Building Official is hereby authorized to enter into one or more\nagreements for the issuance of a Conditional Permit as authorized in the Building\nCode Act.\n"
    },
    {
      "page_number": 6,
      "text": "By-Law Number 2010-88 a)\n\n2.3 Other Approvals\n\nNothing in this by-law shall exempt any person from complying with the\nrequirements of any other By-law of the Corporation, or from applying for and\nobtaining any permit, license, permission or approval required by this or any other\nBy-law or regulation of the Corporation or any other law in force from time to time.\n\n3. PERMITS:\n\n3.1 File Application on Forms Prescribed\n\n(1)\n\nTo obtain a permit, the owner or an agent authorized in writing by the\nowner shall file an application in writing by completing a prescribed form\navailable from the Chief Building Official or from the Building Code website\nwww.obc.mahlov.on.ca;\n\nThe forms prescribed for use as applications for permits, orders,\ninspections and administrative matters shall be as set out in Schedule 'C’\nattached hereto and forming part of this by-law;\n\nThis by-law shall not be deemed to limit the use of any form which is\nprescribed by provincial regulation notwithstanding that the form is not\nlisted or is a revised or updated form from the forms set out in Schedule 'C'\nto this by-law.\n\n3.2 Information — submitted — to Chief Building Official\n\nEvery application for a permit shall be submitted to the Chief Building Official, and\nshall contain the following information:\n\n(1)\n\nWhere application is made for a construction permit under\nsubsection 8(1) the Act, the application shall:\n(a) use the provincial application form, \"Application for a Permit to\nConstruct or Demolish\"; and\n(b) include complete plans and specifications, documents and other\ninformation as required by the Building Code and as described in\nthis by-law and schedules for the work to be covered by the permit,\nand\nWhere application is made for a demolition permit under subsection\n8(1) of the Act, the application shall:\n(a) use the provincial application form, \"Application for a Permit to\nConstruct or Demolish\"; and\n(b) include complete plans and specifications, documents and other\nInformation as required by the Building Code and as described in\nthis by-law and schedules for the work to be covered by the permit;\nand\n(c) include;\n(') proof satisfactory to the Chief Building Official, that\narrangements have been made with the proper authorities\nfor the cutting off of all services; and\n\n(ii) written confirmation that the site will be backfilled and\ngraded with clean fill material and that all private drain\n"
    },
    {
      "page_number": 7,
      "text": "By-Law Number 2010-88 wel\n\n(3)\n\n(4)\n\nconnections will be excavated and properly sealed at the\nproperty line.\n\nWhere application is made for a conditional permit under subsection\n8(3) of the Act, the application shall:\n\n(a) use the provincial application form, \"Application for a Permit to\nConstruct or Demolish\";\n(b) include complete plans and specifications, documents and other\n\ninformation as required by the Building Code and as described in this\nby-law and schedules for the work to be covered by the permit;\n\n(c) state in writing the reasons why the applicant believes that\nunreasonable delays in construction would occur if a conditional\npermit is not granted;\n\n(d) state in writing the necessary approvals which must be obtained in\nrespect of the proposed building and the time in which such\napprovals will be obtained; and\n\n(e) state in writing the time in which plans and specifications of the\ncomplete building will be filed with the Chief Building Official.\n\nWhere application is made for a change of use permit issued under\n\nsubsection 10(1) of the Act the application shall:\n\n(a) use the Provincial prescribed form;\n\n(b) describe the building in which the occupancy is to be changed, by a\ndescription that will readily identify and locate the building;\n\n(c) identify and describe in detail the current and proposed\noccupancies of the building or part of a building for which the\napplication is made;\n\n(d) include complete plans and specifications showing the current and\nproposed occupancy of all parts of the building, and which contain\n\nsufficient information to establish compliance with the requirements of\nthe Building Code, including: floor plans; details of wall, ceiling and\nroof assemblies identifying required fire resistance ratings and load\nbearing capacities, details of the existing sewage system, if any, a\nbuilding code matrix and analysis, and any other drawings,\ndocumentation and other information required by the Chief Building\nOfficial to issue a Building Permit .\n\n(e) be accompanied by the required fee;\n(f) state the name, address and telephone number of the owner;\n(g) be signed by the owner or his or her authorized agent who shall\n\ncertify the truth of the contents of the application.\n\nWhere application is made for a sewage system permit issued under\nsubsection 8(1) of the Act, the application shall:\n\n(a) use the provincial application form, \"Application for a Permit to\nConstruct or Demolish\";\n(b) include complete plans and specifications, documents and other\n\nInformation as required by the Building Code and as described in this\nby-law and schedules for the work to be covered by the permit;\n(c) include a site evaluation which shall include all of the following\n"
    },
    {
      "page_number": 8,
      "text": "By-Law Number 2010-88 8\n\nitems, unless otherwise specified by the Chief Building Official:\n\n(i) include the date the evaluation was done;\n\n(ii) include name, address, telephone number and signature of\nthe person who prepared the evaluation; and\n\n(iii) include a scaled drawing of the site showing: - the legal\n\ndescription, lot size, property dimensions, existing rights-\nof-way, easements or municipal I utility corridors;\n\n- the location of items listed in Division B Column 1 of Tables\n8.2.1.6.A., 8,2.1.6.B. and 8.2.1.6.C. of the Building Code;\n- the location of the proposed sewage system;\n\n- the location of any unsuitable, disturbed or compacted\nareas;\n\n- proposed access routes for system maintenance; -\ndepth to bedrock;\n\n- depth to zones of soil saturation;\n\n- soil properties, including soil permeability; and\n\n- soil conditions, including the potential for flooding.\n\n(6) Where application is made for a transfer of permit because of a\n\nchange of ownership of the land, as permitted under clause 7(h) of\n\nthe Act, the application shall:\n\n(a) make such request in writing;\n\n(b) provide the names and addresses of the previous and new land\n\nowner;\n\n(c) provide the date that the land ownership change took place;\n\n(d) describe the permit that is being transferred.\n\n(e) provide written confirmation from the original permit holder and owner\nthat the permit is to be transferred.\n\n(f) provide written confirmation from the Designers that use of their\ndrawings for this permit is acceptable.\n\n(g) provide new drawings where the drawings which formed the basis of\nthe original permit issuance were prepared by the original owner and\nthe owner is not a \"Designer\".\n\n3.3 Partial permit— requirements\n\nWhen, in order to expedite work, approval of a portion of the building or project is\n\ndesired prior to the issuance of a permit for the complete building or project,\n\n(a) application shall be made and all applicable fees paid for the complete\nproject; and\n\n(b) complete plans and specifications covering the portion of the work for which\nimmediate approval is desired shall be filed with the Chief Building Official; and\nwhere a partial permit is requested the application is deemed to be incomplete.\n\n3.4 Partial permit — limitations\nWhere a permit is issued for part of a building or project this shall not be\nconstrued to authorize construction beyond the plans for which approval was given\nnor that approval will necessarily be granted for the entire building or project.\n"
    },
    {
      "page_number": 9,
      "text": "By-Law Number 2010-88 dD\n\n3.5\n\nInactive Permit Application\n\nWhere an application for a permit remains incomplete or inactive for six months after it\nis made, the application may be deemed by the Chief Building Official to have been\nabandoned and notice thereof shall be given to the applicant. If an application is\ndeemed to be abandoned, a new application must be filed for the proposed work.\n\n4. PLANS AND SPECIFICATIONS\n\n4.1\n\n4.2\n\n4.3\n\n4,4\n\n45\n\n4.6\n\nInformation - sufficient to determine conformity\n\nSufficient information shall be submitted with each application for a permit to enable\nthe Chief Building Official to determine whether or not the proposed construction,\ndemolition, change of use or transfer of permit will conform with the Act, the Building\nCode and any other applicable law.\n\nTwo complete sets — required — unless specified\n\nEach application shall, unless otherwise specified by the Chief Building Official, be\naccompanied by two complete sets of the plans and specifications as described in\nthis By-law and Schedule \"B\" of this by-law.\n\nPlans — drawn to scale — on durable material — legible\n\nPlans shall be drawn to scale on paper, cloth, or other durable material capable of\nbeing archived in the records system of the Corporation and shall be legible. Upon\napproval of the Corporation plans may be submitted by electronic media in a form\nsuitable to the Corporation.\n\nSite Plans — referenced — to plan of survey\n\nSite plans shall be referenced to an up-to-date survey and, when required to\n\ndemonstrate compliance with the Act, the Building Code or other applicable law, a\n\ncopy of the survey shall be submitted to the Chief Building Official. Site plans shall\n\nshow:\n\n(1) Lot size and the dimensions of property lines and setbacks to any existing\nor proposed buildings;\n\n(2) existing and finished ground levels or grades; and\n\n(3) existing rights-of-way, easements and municipal services.\n\nAs constructed plans\n\nOn completion of the construction of a building, the Chief Building Official may\nrequire a set of as constructed plans, including a plan of survey showing the location of\nthe building.\n\nBuilding Location Survey\n\nUpon completion of the foundation, a building location survey shall be submitted\nwhen requested by the Chief Building Official for new residential buildings and\nbuildings under Site Plan Agreement with the Corporation or any other building as\nrequested in order to confirm compliance with any Building Code or zoning\nrequirement.\n"
    },
    {
      "page_number": 10,
      "text": "By-Law Number 2010-88\n\n4.7\n\n5.\n\n7.\n\nPlans property of Corporation\n\nPlans and specifications furnished according to this By-law or otherwise required by\nthe Act become the property of the Corporation and will be disposed of or retained in\naccordance with relevant legislation.\n\nREGISTERED CODE AGENCIES\n\n5.1\n\n5.2\n\nRegistered Code Agency — hired « by Chief Building Official\n\nThe Chief Building Official is authorized to enter into and sign contracts for service\nagreements with registered code agencies and appoint them to perform specified\nfunctions from time to time in order to maintain the time periods for permits\nprescribed in the Building Code.\n\nDuties of Registered Code Agency\nThe registered code agency may be appointed to perform one or more of the\nspecified functions described in section '15.15 of the Act.\n\nFEES AND REFUNDS\n\n6.1\n\n6.2\n\n6.3\n\nDue — payable upon application — Schedule \"A\"\n\nThe Chief Building Official shall determine the required fees for the work proposed\ncalculated in accordance with schedule \"A\" of this By-law and the applicant shall pay\nsuch fees upon application. Without payment of the required fee the application\nshall be deemed to be incomplete.\n\nWork without permits\n\nAny person or Corporation who commences construction, demolition or changes the\nuse of a building before submitting an application for a permit or after submitting an\napplication for a permit but before the building permit has been issued by the\nCorporation, shall in addition to any other penalty under this Act, Building Code, or in\nthis Bylaw pay an additional fee in accordance with schedule A of this by-law in order\nto compensate the Corporation for the additional work incurred by such early start of\nwork.\n\nRefunds\n\nIn the case of withdrawal of an application, or the abandonment of all or a portion of\nthe work, or refusal of a permit, or the non-commencement of any project, the Chief\nBuilding Official shall determine the amount of paid permit fees that may be\nrefunded to the applicant, if any, in accordance with Schedule \"A\" of this By-law. No\nrefund shall be applied where the permit has been revoked, except where the permit\nwas issued in error. The applicant must make any request for a permit refund within\ntwelve months of issuance of the permit. Refunds requested after this time will not\nbe considered.\n\nTRANSFER OF PERMITS\n\n7.1\n\nApplication — completed — by new owner\n\nA permit may be transferred if the new landowner completes the permit application form in\naccordance with the requirements of Part 3 of this By-law.\n"
    },
    {
      "page_number": 11,
      "text": "By-Law Number 2010-88 1\n\n7.2\n\n7.3\n\nFee — Schedule \"A\"\n\nA fee shall be payable on an application for a transfer of permit as provided in\nSchedule \"A\" of this By-law.\n\nNew owner— permit holder — upon transfer\nThe new owner shall, upon a transfer of a permit, be the permit holder for the\npurpose of the Act and the Building Code,\n\nREVOCATION OF PERMITS\n\n8.1\n\n8.2\n\n8.3\n\nNotice of Revocation\n\nPrior to revoking a permit under subsection 8(10) of the Act, the Chief Building\nOfficial may serve a notice by personal service or registered mail at the last known\naddress to the permit holder, and following a thirty (30) day period from the date of\nservice the Chief Building Official may revoke the permit if grounds to revoke still\nexist, without any further notice,\n\nDeferral of Revocation\n\nA permit holder may within thirty (30) days from the date of service of a notice under\nthis Part, request in writing the Chief Building Official to defer the revocation by stating\nreasons why the permit should not be revoked. The Chief Building Official having\nregard to any changes to the Act, Building Code or other applicable law may allow the\ndeferral, in writing.\n\nFee for Deferral\nA request for deferral shall be accompanied by the non-refundable fee therefore set\nout in Schedule \"A\" of this By-law.\n\nNOTICE REQUIREMENTS FOR INSPECTIONS— APPOINTED DESIGNATE\n\n9.1\n\n9.2\n\nNotice prior — each stage — to Chief Building Official\n\nThe permit holder shall notify the Chief Building Official or a Registered Code Agency\nwhere one is appointed, of each stage of construction for which a mandatory\nnotice is required under the Building Code. in addition, the permit holder shall provide\nthe notice of completion as prescribed by Section 11 of the Act, or where occupancy is\nrequired prior to completion, notice of inspection to ensure that the requirements of\nSection 11 of the Act and the Building Code are complied with.\n\nEffective — when received — by Chief Building Official\n\nA notice pursuant to this Part of the by-law is not effective until notice is actually\nreceived by the Chief Building Official or the Registered Code Agency and the\npermit holder receives a confirmation number issued by the Corporation or the\nRegistered Code Agency.\n"
    },
    {
      "page_number": 12,
      "text": "By-Law Number 2010-88 wd2\n\n10.\n\n11,\n\n12.\n\n13.\n\n9.3 Time Periods— Inspections\nUpon receipt of proper notice, the inspector or a registered code agency, if one is\nappointed, shall undertake a site inspection of the building to which the notices\nrelates in accordance with the time periods stated in the Building Code and section 11\nof the Act.\n\n9.4 Appointed Designate\nThis by-law shall not be deemed to limit the appointment of a designate who may\nperform or execute any authority of the Chief Building Official where authorized by\nthe Building Code Act, provided such designate, where required, is duly appointed\nby by-law under the Building Code Act.\n\nCODE OF CONDUCT\n\n10.1 Applicability\n\nA code of conduct in accordance with 7.1(1) of the Act is applicable to the Chief\nBuilding Official and Building Inspectors appointed by the Corporation. Complaints\nregarding improper conduct of the Chief Building Official or an Inspector shall be\nmade in writing and shall be filed with the Director of Development Services.\n\nVALIDITY\n\n11.1 Severability\nIn the event that any provision of this by-law is declared by a court of competent\njurisdiction to be invalid, the same shall not affect the validity of the remaining\nprovisions of this by-law.\n\nCONTRAVENTION OF BY-LAW— OFFENCES\n\n12.1 Offence\nEvery person who contravenes any provision of this by-law is guilty of an offence\nand on conviction is liable to a fine as provided in section 36 of the Building Code\nAct, 1992, S.O. 1992, c.23, as amended.\n\nREPEAL — ENACTMENT\n\n13.1 By-law previous\nBy-law 2005-103 and all amendments thereto are hereby repealed.\n\n13.2 Short Title\nThis bylaw may be referred to as the Building By-law.\n\n13.3 Effective Date\nThis by-law comes into force on the date of passing.\n"
    },
    {
      "page_number": 13,
      "text": "By-Law Number 2010-88 ak)\n\nRead a first time this 25\" day of May 2010.\nRead a second time this 25\" day of May 2010.\n\nRead a third time and finally passed this 25'\" day of May 2010.\n\nNEIL R. ELLIS MAYOR\n\nCITY CLERK\n"
    },
    {
      "page_number": 14,
      "text": "By-Law Number 2010-88 as amended by by-law 2012-35\n\nSCHEDULE ‘A’\n\nCLASSES OF PERMITS AND FEES\n\nwl\n\nCLASS OF PERMIT / TYPE OF FEE\nBuilding Permit:\n\nRATES\n\n$10.00 / $1,000.00 construction\nvalue, $50.00 Minimum\n\nRepair/Alteration Permit:\n\n$10.00 | $1,000.00 construction\nvalue, $50.00 Minimum\n\nPlumbing Permit: - Residential:\n\n- Other\n\n- Water Heater Replacement - Residential\nWater Heater Replacement - Other\n\n$15.00 + $7.00 per fixture,\n$50.00 Minimum\n$75.00 + $7.00 per fixture\n+ $50.00 for underground,\n$50.00 Minimum\n$25 00\n\n$80.00\n\nSewer Permit:\n\n$6.00 per 25mm of pipe diameter for\neach 30m of pipe or part thereof,\n$25.00 Minimum\n\nCatch basins and manholes: $40.00 each\n\nSewage System permit: Class 1 (New) No fee\n\nClass 2, 3, 4 or 5 (New) $500.00\n\nAfter March 1, 2013 — Class 2, 3, 4 or 5 (New) $640.00\n\nSewage System repairs, alterations, additions $150.00\n\nIn-Floor Radiant Heating Systems: (per floor) $50.00\n\nas 4. 25% of the Building Permit Fee\n\nConditional Permit: Minimum $250.00\n\nDemolition Permit: - Main Building $50.00\n\n- Accessory Building $25,00\n\nChange of Use Permit: - No construction $50.00\n\n- With construction\n\n$10.00 / $1,000.00 construction\nvalue, $50.00 minimum\n\nTransfer of permit fee $25.00\nDeferral of permit revocation fee $25.00\nOccupancy Permit: per Suite/Unit/Residential Unit/Permit/Building $20.00\nInspection fee: Construction stage not ready or Re-inspection\n\nafter first two inspections of same stage of construction (per $50.00\ninspection) :\n\nSurcharge for Building without Permit: 30% of Permit Fee\n\n$150.00 Minimum\n\nWood Burning Appliance Permit: (Except Inserts):\n\n$10.00 | $1,000.00 construction\nvalue, $50.00 Minimum\n\nFireplace Insert Permit:\n\n$100.00\n\nCommercial Kitchen exhaust hood Permit:\n\n$100.00\n\nSwimming Pool/Pool Enclosure (per $1,000 of construction value)\n\n$10.00 / $1,000.00 construction\nvalue, $50.00 Minimum\n\nWritten Request for By-law and/or Work Orders:\n\n$50.00\n\n"
    },
    {
      "page_number": 15,
      "text": "Schedule A Cont'd.\n\nIn addition to the above listed fees, the following fees shall apply;\n\n1.\n\nWhere a drawing review has been completed by the Corporation and a review letter issued,\nand the applicant changes the \"model\" of a house and proposes a new model of house for\nthe same lot, an additional fee of 55 percent of the new value of construction will apply to\nthe permit fee for costs incurred by the Corporation.\n\nThe fee for a request for the use of an Alternative Solution as described in the Building Code\nas amended shall be based on an hourly rate of $100.00 per hour with a minimum fee of\n$100.00 based on the number of hours or portion thereof to the nearest % hour spent by the\nCorporation to review and research the proposed Alternative Solution. When the Alternative\nSolution warrants review by a third party the applicant shall also be responsible for the cost\nof the third party review and a deposit as determined by the Chief Building Official to cover\nthe cost of the third party review shall be provided to the Corporation by the Applicant prior\nto the review of the proposal by the third party. The determination of the requirement to\ninvolve a third party is solely at the discretion of the Chief Building Official.\n\nREFUNDS\n\nPursuant to Section 6 of this By-law, the fees that may be refunded shall be a percentage of the\nfees payable under this By-law, calculated by the Chief Building Official as follows:\n\n(a) Eighty (80) percent if administrative functions only have been performed;\n\n(b) Seventy (70) percent if administrative and zoning functions only have been\nperformed;\n\n(c) Forty-Five (45) percent if administrative, zoning and plan examination functions have\n\nbeen performed;\n\n(d) Thirty-Five (35) percent if the permit has been issued and no field inspections have\nbeen performed subsequent to permit issuance;\n\n(e) Five (5) percent shall additionally be deducted for each field inspection that has been\nperformed after the permit has been issued;\n\nNo refund shall be made for an amount less than $35.00.\n\nMISCELLANEOUS CHARGES\n\nFor classes of permits not described in this Schedule, a reasonable permit fee shall be applied by\nthe Chief Building Official.\n\nINTERPRETATION\n\nThe following explanatory notes are to be observed in the calculation of permit fees:\n\n(a) Where cost of construction is used to calculate permit fees (example $10.00 per $1,000 of\nconstruction value) the current industry average may be applied to the construction value to\ndetermine the cost of a permit;\n\n(b) Where there is a conflict between the applicant and the Corporation in regards to the value of\nconstruction at the time of permit issuance, the Corporation may request audited\ndocumentation to confirm construction costs. In cases where both parties do not agree upon the\nvalue of construction, the current industry average shall be used and upon completion of the\nproject, the applicant shall submit the audited cost of all items pertaining to the\nconstruction to determine if any refund is applicable.\n"
    },
    {
      "page_number": 16,
      "text": "By-Law Number 2010-88 —16\n\nOANDOARWNM =\n\n=a 8 oo\nwonm=a0oT~rrvrevrvrevrvrwr\nerry a=\n\n14)\n\n15)\n\n16)\n\n17)\n\nSCHEDULE \"B\"\n\nREQUIRED PLANS\n\nList of Plans, Specifications and Other Information Required to accompany\napplications for permits:\n\nSite Plan (two copies);\n\nA Current Legal Survey for the property (two copies)\n\nFloor Plans (two sets);\n\nFoundation Plans (two sets);\n\nFraming Plans (two sets);\n\nRoof Plans (two sets);\n\nReflected Ceiling Plans (two sets);\n\nSections and Details (two sets);\n\nBuilding Elevations (two sets);\n\nElectrical Drawings (two sets);\n\nHeating, Ventilation and Air Conditioning Drawings (two sets);\n\nPlumbing Drawings (two sets);\n\nFire Alarm and Sprinkler Plan (two sets);\n\nHeat Loss calculations, Duct Design Calculations and a duct layout drawing\nfor the heating and ventilation system(s) (two sets);\n\nA Building Code Matrix and Analysis for any building, which is a Small\nBuilding, Large Building or Complex Building, as described in Division C\nTable 3.5.2.1. of the Building Code;\n\nA Building Code Matrix and Analysis for the change of use of any building or\npart thereof; and\n\nAny other information required by the Chief Building Official in order to\ndetermine that the proposed construction; demolition or change of use will\ncomply with the Building Code, the Act and any other applicable law.\n\nNote: The Chief Building Official may specify that not all the above-\nmentioned plans be required to accompany an application for a\npermit.\n"
    },
    {
      "page_number": 17,
      "text": "By-Law Number 2010-88 wlT7\n\nSCHEDULE \"C\"\n\nPRESCRIBED FORMS\n\nThe following forms constitute the forms used by the Corporation of the City of\nBelleville in the administration of the Building Code Act:\n\nForm\nForm\nForm\nForm\nForm\nForm\nForm\nForm\nForm\nForm 10\n\nOMNOORWN =\n\nApplication to Construct or Demolish\nConstruction Permit\n\nOrder To Comply\n\nStop Work Order\n\nOrder To Remedy Unsafe Building\nOrder Prohibiting Use or Occupancy\nOrder Not to Cover or Enclose\nEmergency Order\n\nOrder Requiring Tests and Samples\nBuilding Inspection Report\n"
    }
  ]
}