{
  "file_name": "BL 2010-40 A Bylaw to Impose Fees for Automatic Alarms (False).pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\n\nBY-LAW NUMBER 2010-40\n\nA BY-LAW TO IMPOSE FEES FOR AUTOMATIC ALARMS (FALSE)\n\nWHEREAS Section 391 of the Municipal Act, 2001, S.O. 2001, c.25, as amended,\nprovides that a municipality and a local board may pass by-laws imposing fees or\ncharges on any class of persons for services or activities provided or done by or on\n\nbehalf of it;\n\nAND WHEREAS the Council deems it desirable to impose fees for false fire alarms;\n\nNOW THEREFORE the Municipal Council of the Corporation of the City of Belleville\nenacts as follows:\n\n1. In this by-law:\n\na)\n\nb)\n\n“City” shall mean the Corporation of the City of Belleville.\n\n“False alarm” means the activation of a fire alarm system or emergency\nsystem through a mechanical failure, equipment malfunction, improper\nuse/improper installation of the system or failure to maintain the system\nas prescribed by the Fire Code being O.Reg. 388/97, under the Fire\nProtection and Prevention Act, 1997, as amended.\n\n“Fire Chie? means a fire chief appointed under subsection 6(1), (2) or\n(4) of the Fire Protection and Prevention Act, 1997; (“chef des\npompiers”) or his/her designate.\n\n“Owner” means the person, for the time being, managing or receiving\nthe rent of the land or premises in connection with which the word is\nused whether on his own account or as an agent or trustee of any other\nperson or who would receive the rent if such land and premises were let,\nand shall also include a lessee or occupant of the property who, under\nthe terms of the lease, is required to repair and maintain the property in\naccordance with the standards for maintenance and occupancy of\nproperty;\n\n“Property” means the property defined by the municipal address.\n\n“Fiscal Year” being January to December.\n"
    },
    {
      "page_number": 2,
      "text": "By-law Number 2010-40 Page 2\n\n2. When the Belleville Fire & Emergency Services Department responds to a false\nalarm, the following fees shall be payable by the owner of the property from\nwhich the alarm originated to the Corporation of the City of Belleville:\n\na) first false alarm within fiscal year - no charge — a warning notice shall be\nissued;\n\nb) second false alarm within the fiscal year - $250.00;\nc) each subsequent false alarm within the fiscal year - $500.00\n\n3. No person shall undertake any work on any fire alarm or emergency alarm\nsystem that sends an alarm directly to the Belleville Fire & Emergency Services\nDepartment or a fire/emergency alarm monitoring company without first\nnotifying the Belleville Fire & Emergency Services Department.\n\n4. If a property owner fails to notify the Belleville Fire & Emergency Services\nDepartment in advance of any work being conducted on a fire alarm system or\nemergency system, and as a result of the work being done on a fire alarm\nsystem or emergency system an alarm is triggered, resulting in the attendance\nof the Fire & Emergency Services Department, the property owner shall be\nrequired to pay a fee of $250.00.\n\n5. The Belleville Fire & Emergency Services Department shall continue to\nrespond to all alarms and calls for assistance notwithstanding any previous\nfalse alarm from a property or non-payment of any fee hereunder.\n\n6. The Treasurer of the Corporation of the City of Belleville may add any amount\npayable under this by-law which is not paid within thirty (30) days of demand to\nany property in the municipality for which all the owners are responsible for\npaying the fees and charges and may collect them in the same manner as\nmunicipal taxes or through the use of other legal means as deemed\nappropriate.\n\n7. The City shall deliver an invoice to each person upon whom a fee is imposed\nunder this by-law and the person shall pay the fee within thirty days of receipt\nof the invoice.\n\n8. Notwithstanding the provisions of this by-law, the Fire Chief or his/her\ndesignate may, at his or her discretion and under the following conditions,\nexempt an owner from the requirement to pay the stipulated fee:\n\na) if the owner provides suitable evidence, in the opinion of the Fire Chief, that\nthe cause of the false alarm is being rectified; or\n\nb) if the owner provides to the Fire Chief, in writing, a specific date acceptable\nto the Fire Chief by which time the cause of the false alarms will be rectified.\n"
    },
    {
      "page_number": 3,
      "text": "By-law Number 2010-40 Page 3\n\n9. The City may deliver an invoice either personally, or by registered mail, or by\n\n11.\n\nordinary mail to a person’s home address or, in the case of a property owner, to\nthe property owners address as recorded on the City’s assessment roll.\nReceipt of an invoice shall be deemed to have occurred:\n\na) on the date of delivery in the case of personal delivery\n\nb) three days after mailing by registered mail if delivered to an address within\nthe City of Belleville\n\nc) five days after mailing by registered mail if delivered to an address outside\nof the City of Belleville\n\nd) seven days after mailing by ordinary mail\n\nIf any section, clause or provision of this By-law is for any reason declared by a\ncourt of competent jurisdiction to be invalid, the same shall not affect the\nvalidity of this By-law as a whole or any part thereof other than the section,\nclause or provision so declared to be invalid and it is hereby declared to be the\nintention of Council for the City that all remaining sections, clauses or\nprovisions of this By-law shall remain in full force and effect until repealed,\nnotwithstanding that one or more provisions thereof may have been declared\ninvalid.\n\nThis by-law shall come into force and take effect upon the date of final passing\nthereof.\n\nRead a first time this 22\" day of March 2010.\n\nRead a second time this 12\" day of April 2010.\n\nRead a third time and finally passed this 12\" day of April 2010.\n\nNEIL ELLIS MAYOR\n\nJULIE ORAM CITY CLERK\n"
    }
  ]
}