{
  "file_name": "BL 2025-117 Land Maintenance By-law - Repeals 2011-206 _ 2014-120.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "The Corporation of the City of Belleville\nBy-law Number 2025-117\n\nA By-law Respecting Litter and Land Maintenance\nAnd to Repeal By-law Numbers 2011-206 and 2014-120\n\n(Land Maintenance By-law)\n\nWhereas Section 127 of the Municipal Act, 2001, S.O. 2001, c.25, as amended,\nprovides that a local municipality may require an owner or occupant of land to clean and\nclear the land, not including buildings, or to clear refuse or debris from the land, not\nincluding buildings; to regulate when and how such matters be done; to prohibit\ndepositing of refuse or debris on land without the consent of the owner or occupant of\nthe land; and to define refuse;\n\nAnd Whereas Section 128 of the Municipal Act, 2007, S.O. 2001, c.25, as amended,\nprovides that a local municipality may prohibit and regulate with respect to public\nnuisances, including matters, that, in the opinion of Council, are or could become public\nnuisances;\n\nAnd Whereas Section 131 of the Municipal Act, 2001, S.O. 2007, c.25, as amended,\nprovides that a municipality may prohibit and regulate the use of any land for the\nstorage of motor vehicles for the purpose of wrecking or dismantling them or salvaging\nparts from them for sale or other disposition;\n\nAnd Whereas Section 10 (2) of the Municipal Act, 2001, S.O. 2001, c.25, as amended,\nprovides that a municipality may pass by-laws respecting health, safety, and the well\nbeing of Persons; ,\n\nAnd Whereas Section 429 of the Municipal Act, 2001, S.O. 2001, c.25, as amended,\nprovides that a municipality may establish a system of fines for offences under a by-law;\n\nAnd Whereas Section 425 (1) of the Municipal Act, 2007, S.O. 2007, c.25, as\namended, provides that a municipality may pass by-laws providing that a Person who\ncontravenes a by-law of the municipality passed under the Municipal Act is guilty of an\noffence;\n\nAnd Whereas Section 446 of the Municipal Act, 2001, S.O. 2001, c.25, as amended,\nprovides that where a municipality has authority under the Municipal Act or any other\nAct or under a by-law made under the Municipal Act or any other Act to direct or require\na Person to do a matter or thing, the municipality may also provide that in default of it\nbeing done by the Person directed to do it, the matter or thing shall be done at the\nPerson's expense and the municipality may recover the expense incurred by action or\nadding the cost to the tax roll and collecting them in the same manner as property\ntaxes;\n\nPage 1 of 9\n\n"
    },
    {
      "page_number": 2,
      "text": "Now Therefore the Council of The Corporation of the City of Belleville hereby enacts as\nfollows:\n\n1. Definitions\n\n1.1.\n\n1.2.\n\n1.3.\n14.\n\n1.5.\n\n1.6.\n\n1.7.\n\n18.\n\n1.9.\n\nClean shall mean the removal and proper disposal of debris and refuse from any\nproperty within the boundaries of the City of Belleville.\n\nCorner Sight Triangle shall mean triangular area formed by the boundaries of\nthe lot common with the street line and a straight line connecting the points on\neach of those lines measured 6.0metres from where they intersect.\n\nCouncil shall mean the Municipal Council of the City of Belleville\n\nDebris shall mean any item, article, thing, matter, substance or effluent that has\nbeen cast aside, discarded, abandoned or is used up in whole or in part, or\nexpended or worn out in whole or in part; or appears to be worthless, or useless\nor of no practical value but including, but not limited to, materials described in\nSchedule 'A' to this By-law, and all similar or like materials.\n\nInoperable Vehicle shall mean any vehicle, including a trailer, that appears by\nreason of its appearance, mechanical condition, or lack of valid licence plates, to\nbe inoperative. A vehicle is an inoperable vehicle if it bears licence plates that are\nnot registered as being attached to that vehicle and/or the licence plate\nregistration is not current and up to date, in accordance with the records of the\nMinistry of Transportation\n\nDomestic Waste means any debris, refuse or rubbish, garbage, article, thing,\nmatter or any effluent belonging to or associated with a residence, household or\ndwelling unit\n\nGrass shall mean perennial turfgrass grown for ground cover, of a type that\nforms a dense, uniform turf when mown, including but not limited to Kentucky\nbluegrass, perennial ryegrass, or fine fescue.\n\nMotor Vehicle shall mean an automobile, truck, motorcycle, and any other\nvehicle propelled or driven otherwise than by muscular power, but does not\ninclude a motorized snow vehicle, traction engine, self-propelled implement of\nhusbandry or road building machine within the meaning of the Highway Traffic\nAct, R.S.O 1990, c. H.8, as amended.\n\nNaturalized Garden shall mean an area dedicated to the intentional, deliberate\nand maintained plantings of North American species and includes, without\nlimiting the generality of the foregoing, an annual or perennial flower garden, food\ngarden, rain garden, hedge, shrub, plant, vine, and groundcover, but does not\ninclude trees or Grass.\n\n1.10. Officer shall mean a By-Law Enforcement Officer appointed by the City of\n\nBelleville, a Police Officer in the Province of Ontario or any Person as authorized\nby the Council of The Corporation of the City of Belleville for the enforcement of\nmunicipal By-laws.\n\nPage 2 of 9\n\n"
    },
    {
      "page_number": 3,
      "text": "1.14.\n\n1.15.\n\n. Occupant shall mean any Person over the age of 18 years in control of the\n\nproperty.\n\n. Owner shall mean the Person or Persons appearing on the Municipal Tax\n\nAssessment Roll or property tax account and persons having lawful title to the\nland and includes \"Person\" as defined in this By-law.\n\n. Person shall mean any individual, association, firm, partnership, or incorporated\n\ncompany.\n\nProperty shall mean yards, vacant lands, or any part of a lot not occupied by a\nprincipal building, if any, and includes the space within or upon unenclosed\ndecks, unenclosed porches, unenclosed carports and unenclosed accessory\nstructures.\n\nRefuse shall have the same meaning as Debris.\n\n2. Land Maintenance\n\n2.1.\n\n2.2.\n\n2.3.\n\nEvery Owner or Occupant shall keep their land free and clear of all Debris,\nRefuse or Domestic Waste of any kind.\n\nEvery Owner or Occupant shall keep their land free and clear of any conditions\nthat might create a health, fire or accident hazard.\n\nEvery Owner or Occupant of any building or land may provide for the composting\nof plant matter on the land provided that the composting material is kept in a\ncontainer that is secured on all sides so as to prevent the entry of rodents or\nother animals, covered with a tight fitting cover which shall be kept closed at all\ntimes except when material is being placed therein. The container for such\ncomposting shalt be no greater than 1.82m in height and shall be kept 1m from\nall property lines.\n\n3. Grass and Naturalized Gardens\n\n3.1.\n3.2.\n\n3.3.\n\n3.4.\n3.5.\n\n3.6.\n\nNo Owner or Occupant of land shall permit grass to exceed 15cm in height.\n\nNo Owner or Occupant of land shall permit noxious weeds, as defined by the\nWeed Control Act R.S.O. 1990, c. W.5, as amended, on their land.\n\nNo Owner or Occupant shall permit Naturalized Gardens on their property to\nexceed 0.6m in height within any Corner Sight Triangle.\n\nNo Owner or Occupant of land shall fail to maintain a Naturalized Garden.\n\nEvery Owner or Occupant shall ensure that any Naturalized Garden on their\nproperty shall be kept 1m from all property lines.\n\nEvery Owner or Occupant of land shall keep vegetation trimmed and kept from\noverhanging public property to affect safety, visibility, or the passage of the\ngeneral public.\n\nPage 3 of 9\n\n"
    },
    {
      "page_number": 4,
      "text": "4. Standing Water\n4.1. Every Owner or Occupant shall keep their land free of standing water.\n\n4.2. Every Owner or Occupant shall keep their land free of containers or debris\ncapable of holding standing water in such a manner as to be exposed to the\nbreeding of larvae and/or growth of insects.\n\n5. Inoperable Vehicles\n\n5.1. No Owner or Occupant of land shall use their land for the parking and/or storage\nof inoperable vehicles.\n\n5.2. Despite Section 5.1 of this By-law, the Owner of land may park, place or store\none (1) inoperable vehicle on the land for the purpose of repairing it for their own\nuse, but not for commercial purposes, provided such repair is completed within\nthirty (30) days from the date on which the inoperable vehicle is first parked,\nplaced or stored on the land.\n\n6. Litter\n\n6.1. No Person shall throw, dump, place, deposit or cause or permit to be thrown,\ndumped, placed or deposited debris or refuse on private property without the\nconsent of the Owner of such property.\n\n6.2. No Person shall throw, dump, place, deposit or cause or permit to be thrown,\ndumped, placed or deposited debris on City property without written consent from\nthe City.\n\n6.3. No Owner or Occupant of any property in the City of Belleville on which any\ndebris of any kind has been or may hereafter be thrown, dumped, placed or\ndeposited, shall fail to forthwith remove the same.\n\n6.4. No Person shall place debris in a receptacle which is not owned by the City i\nwithout the consent of the Owner of such receptacle.\n\n6.5. No Person shall deliver, throw, drop or place cause, permit or allow the delivery,\nthrowing, dropping or placing of any newspaper, magazine, flyer, leaflet or similar\ndevice if the Owner or Occupant has provided explicit direction not to do so.\n\n6.6. Where debris is thrown, dumped, placed or deposited from a vehicle the\nregistered owner of the vehicle shall be presumed to have been the person who\nthrew, placed, dumped or deposited the debris, which presumption may be\nrebutted by evidence contrary on a balance of probabilities.\n\n6.7. Where debris is thrown, dumped, placed, or deposited and the nature of the\ndebris, any markings on the debris, or other evidence with respect to the debris,\nreasonably indicates its origin, the Owner of the property of the debris’ origin\nshall be presumed to have been the person who threw, placed, dumped or\ndeposited the debris, which presumption may be rebutted by evidence to the\ncontrary on a balance of probabilities.\n\nPage 4 of 9 :\n"
    },
    {
      "page_number": 5,
      "text": "7. Exemptions\n\n7.1. Section 2.1 shall not apply to construction equipment and materials stored in an\norderly manner on land where there is an active building permit issued for the\nconstruction of a building or structure on such land.\n\n7.2. This By-law does not apply so as to prevent a farm operation or practice meeting\nthe definition of “agricultural operation” and “normal farm practice” under the\nFarming and Food Production Protection Act, 1998, SO 1998, c.1, as amended\nfrom carrying out a normal farm practice as provided for and defined under that\nAct.\n\n7.3. Section 3 of this By-law does not apply to property owned or leased by the City\nof Belleville or it’s agents.\n\n8. Inspections\n\n8.1. An Officer may enter upon any land at any reasonable time to determine whether\nthe land conforms with this By-law or to determine whether a direction,\nrequirement or Order made under this By-law or an Order under Section 431 of\nthe Municipal Act, 2001, S.O. 2001, c.25, as amended, is being complied with.\n\n8.2. For the purposes of an inspection under Section 8.1 of this By-law, an Officer\nmay:\n\na. Require the production for inspection of documents or things that may be\nrelevant to the land or any part thereof;\n\nb. Inspect and remove documents or things relevant to the land or part thereof\nfor the purpose of making copies or extracts;\n\nc¢. Require information from any person concerning a matter related to the land\nor part thereof;\n\nd. Be accompanied by a person who has special or expert knowledge in relation\nto the land or part thereof;\n\ne. Alone or in conjunction with any person possessing special or expert\nknowledge, make examinations or take tests, samples or photographs\nnecessary for the purposes of the inspection. .\n\n8.3. No Person shall hinder or obstruct or attempt to hinder or obstruct any Officer\nexercising a power or performing a duty under this By-law.\n\n8.4. The City may charge the Owner of a property a fee or charge pursuant to the\nCity’s current Fees & Charges By-law to conduct an inspection, including\nadditional fees for multiple inspections.\n\nPage 5 of 9\n"
    },
    {
      "page_number": 6,
      "text": "9. Order to Comply\n\n9.1.\n\n9.2.\n\n9.3.\n\n9.4.\n\n9.5.\n\nWhere an Officer is satisfied that there has been a contravention of any provision\nof this By-law, the Officer may issue an Order requiring the owner or occupier of\nthe premises on which the contravention has occurred to do work to correct the\ncontravention.\n\nAn Order shall set out,\n\na.\nb.\n\nc.\n\nd.\n\nReasonable particulars of the contravention;\nThe location of the premises on which the contravention occurred;\n\nThe general nature of the work required to be done to correct the\ncontravention; and\n\nThe date by which the work must be done.\n\nAn Order may be served by:\n\na.\n\nb.\n\nPersonal service upon an Owner or Occupant;\n\nRegular or registered mail sent to the address of the owner as shown in the\nmost current tax records;\n\nBy email to the last known email address of the Owner or Occupant; or\n\nBy posting a copy of the Order conspicuously either on the subject property or\non any structure located on the subject property.\n\nAn Order issued under Section 9.1 of this By-law is deemed to be served:\n\nImmediately upon personal service of such Order; or\nOn the 5 day after such Order has been mailed; or\nOn the end of day such Order has been emailed; or\n\nImmediately upon the posting of such Order in a conspicuous place on the\nsubject property or structure located on the subject property.\n\nWhere the Owner or Occupant fails to comply with an Order issued under this\nBy-law the City, in addition to other remedies:\n\na.\n\nShall have the right to carry out the work as required in the Order and for this\npurpose may, with its servants and agents from time to time, enter in and\nupon the property;\n\nShall have the right to recover the expense of carrying out the work as\nrequired in the Order by adding the expense to the tax roll and collecting such\nexpense in the same manner as taxes; and\n\nPage 6 of 9\n\n"
    },
    {
      "page_number": 7,
      "text": "c. Shall not be liable to compensate such Owner, Occupant or Other person\nhaving an interest in the property by reason of anything done by or on behalf\nof the City under the provisions of this By-law.\n\n10.Enforcement and Penalties\n10.1. The provisions of this By-law may be enforced by an Officer.\n\n10.2. Any person who contravenes an Order or fails to comply with an Order made\nunder this By-law is guilty of an offence.\n\n10.3. Any person who is in contravention of any provision of this By-law, or who\ncontravenes an Order made under this By-law is deemed to be committing a\ncontinuing offence for each day that the contravention continues.\n\n10.4. Any person who contravenes any provision of this By-law is liable to a fine or\nother penalty as provided for in the Provincial Offences Act, R.S.O. 1990, c.\nP.33, as amended.\n\n11.Validity\n\n11.1. Notwithstanding any section, subsections, clause, paragraph or provision of this\nBy-law, or parts thereof may be declared by a court of competent jurisdiction to\nbe invalid, unenforceable, illegal or beyond the powers of Council to enact, such\nsection or sections or parts thereof shall be deemed to be severable and that all\nother sections or parts of this Bylaw are separate and independent therefrom\nand enacted as such as a whole. Same shall not affect the validity or\nenforceability of any other provisions of this By-law or of the By-law as a whole.\n\n11.2. Where a provision of this By-law conflicts with the provision of another By-law,\nAct, or Regulation in force within the City of Belleville, the provisions that\nestablish the higher standards to protect the health and safety of the persons\nshall prevail.\n\n12.Transition\n\n12.1. After the date of passing of this By-law, By-law Nos. 2011-206 and 2014-120\nshall apply only to those properties in which an Order has been issued prior to\nthe date of passing of this By-law, and then only to such properties until such\ntime as the work required by such Order has been completed or any\nenforcement proceedings with respect to such Order including any demolition,\nclearance, or repair carried out by the City shall have been concluded.\n\n13.Short title\n\n13.1. This By-law shall be known as the “Land Maintenance By-law’.\n\nPage 7 of 9\n\n"
    },
    {
      "page_number": 8,
      "text": "14.Repeal and Enactment\n\n14.1. By-law 2025-117 will take effect on July 1, 2025, except for the purposes set out\nin Section 12.1 of this By-law, and will repeal By-law Numbers 2011-206 and\n\n2014-120 in their entirety.\n\nBy-law read and passed this 23\"? day of June 2025.\n\nNeil R. Ellis, Mayor\n\nPage 8 of 9\n\n"
    },
    {
      "page_number": 9,
      "text": "Schedule “A”\nto By-law Number 2025-117 for\nThe Corporation of the City of Belleville\n\nHousehold appliances such as stoves, refrigerators, freezers, washers, dryers,\nair conditioners, dishwashers, televisions sets and their component parts.\n\nHousehold furniture such as beds, bed springs, mattresses, tables, chairs and\ntheir component parts\n\nEmpty barrels, boxes, water and fuel tanks.\n\nMotor vehicles, motorcycles, snowmobiles, bicycles, trailers, go-carts, boats,\nvessels or all-terrain vehicles which are in a wrecked, discarded, inoperative or\n‘dismantled condition, in whole or in part, and their component parts.\n\nBoulders, bricks, concrete, asphalt, glass, scrap wood, scrap metal, scrap wire,\npaint cans, cardboard, paper, plastics, packing foam, roofing shingles, or scrap\nconstruction materials.\n\nDiscarded clothes, cloth or canvas.\n\nFallen trees, tree stumps, branches, brush, leaves, bagged or piled grass and\nweeds, hedge cuttings, open compost piles, garden waste, snow and ice.\n\nHousehold garbage not set out for collection, beverage containers, fast food\nbags, containers, wrappings, animal carcasses, animal feces.\n\nWaste from demolished buildings, discarded signs, and discarded placards.\nIndustrial, commercial or any other hazardous waste, liquid or solid.\n\nExcavated materials.\n\nPage 9 of 9\n\n"
    },
    {
      "page_number": 10,
      "text": "PROVINCIAL OFFENCES ACT\nPart I\n\nIT IS ORDERED pursuant to the provisions of the Provincial Offences Act and the\nrules for the Ontario Court of Justice, that the amount set opposite each of the\noffences in the schedule of offences under the Provincial Statutes and Regulations\nthereunder and Municipal By-law No. 2025-117, of the City of Belleville attached\nhereto is the set fine for that offence. This Order is to take effect on August 20,\n\n2025.\n\nDated at Ottawa, this 20! day of August 2025.\n\nElectronic Signature:\n\nW. Vincent Clifford\nRegional Senior Justice\nOntario Court of Justice\nEast Region\n"
    },
    {
      "page_number": 11,
      "text": "City of Belleville\n\nPart | Provincial Offences Act\n\nBy-law Number 2025-117: Land Maintenance By-law\n\nProvisions\nItem Short Form Wording Creating or Set Fine\nDefining Offence\n1 Fail to Clear Land of Debris, Refuse, Waste. Section 2.1 $250\n2 __| Create Health/Fire/Accident Hazard. Section 2.2 $350\n3 Improper Composting: Unauthorized Section 2.3 $150\nContainer.\n4 | Grass Exceeds 15cm. Section 3.1 $250\n5 _| Permit Noxious Weeds. Section 3.2 $250\n6 Naturalized Garden Exceeds 0.6m in Corner Section 3.3 $350\nSight Triangle.\n7 __| Fail to Maintain Naturalized Garden. Section 3.4 $250\n8 Naturalized Garden Less Than 1m from Section 3.5 $250\nProperty Line.\n9 | Vegetation Overhangs Public Property. Section 3.6 $300\n10 | Fail to Remove Standing Water. Section 4.1 $250\n11_ | Park/Store Inoperable Vehicle. Section 5.1 $250\n42 Throw/Dump/Place/Deposit Debris on Private Section 6.1 $300\nProperty.\nThrow/Dump/Place/Deposit Debris on Cit .\n18 Property Without Consent, ” Section 6.2 $300\n14 | Fail to Remove Debris. Section 6.3 $150\n15 | Place Debris in Unauthorized Receptacle. Section 6.4 $150\n16 | Deliver/Place Unwanted Material. Section 6.5 $100\n17 | Obstruct an Officer. Section 8.3 $500\n\nNOTE: The penalty provision for the offences indicated above is Section 10.4 of By-law\n2025-117, a certified copy of which has been filed.\n\nThe fine amounts listed above have been approved by the Regional Senior Justice.\n\nDated: August 20, 2025\n\nElectronic Signature:\n\nW. Vincent Clifford\nRegional Senior Justice\nOntario Court of Justice - East Region\n\n"
    },
    {
      "page_number": 12,
      "text": "THE HONOURABLE L'HONORABLE\nW. VINCENT CLIFFORD W. VINCENT CLIFFORD\nREGIONAL SENIOR JUSTICE JUGE PRINCIPAL REGIONAL\nONTARIO COURT OF JUSTICE COUR DE JUSTICE DE L'ONTARIO\nEAST REGION REGION DE L’EST\nCOURTHOUSE PALAIS DE JUSTICE\n161 ELGIN STREET, 6™ FLOOR 161, RUE ELGIN, 6° ETAGE\nOTTAWA, ONTARIO. OTTAWA (ONTARIO)\nK2P 2L1\n\nTELEPHONE/TELEPHONE (613) 239-1520\n\nAugust 20, 2025\nalhill@belleville.ca\nThe Corporation of the City of Belleville\n\nCity Hall - 169 Front Street\nBelleville ON K8N 2Y8\n\nAttention: Aggie Hill, Manager, By-law Enforcement\nDear Aggie Hill:\n\nRe: Set Fines — Provincial Offences Act — Part |\nBy-Law No. 2025-117: Land Maintenance\n\nEnclosed herewith is the original Order (Part 1) dated August 14, 2025, and original schedule of\nset fines for By-Law No. 2025-117, the By-Law indicated in the schedule.\n\nThe setting of the fines does not constitute my approval of the short form of wording used to\ndescribe the offences.\n\nPlease ensure that a copy of the said documents is forwarded to the Provincial Offences Office,\nwhich has jurisdiction for the City of Belleville.\n\nYours truly,\n\nW. Vincent Clifford\nRegional Senior Justice\nOntario Court of Justice\nEast Region\n\n/nl\nEnclosures\nc.c.:_ Benjamin Hedley\n\nLaw Clerk, Crown Law Office - Criminal\nMinistry of the Attorney General, Ontario Public Service\n"
    }
  ]
}