{
  "file_name": "BL 2002-12 A Bylaw to Control the Discharge of Sewage into the Sewage System.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\n\nBY-LAW NUMBER 2002-12\n\nA BY-LAW TO CONTROL THE DISCHARGE OF SEWAGE INTO THE SEWAGE\nSYSTEM OF THE CITY OF BELLEVILLE PURSUANT TO PARAGRAPHS 83 AND\n150 OF SECTION 210 OF THE MUNICIPAL ACT, R.S.O. 1990, CHAPTER M.45.\n\nWHEREAS it is expedient to prohibit and regulate the discharge of domestic sewage and\nindustrial wastes into drains, sewers, sewer systems and sewage works.\n\nNOW, THEREFORE, THE COUNCIL OF THE CORPORATION OF THE CITY OF\nBELLEVILLE ENACTS AS FOLLOWS:\n\nPART 1\nDEFINITIONS\n1. In this by-law:\n\n(a) “acute hazardous waste chemicals” means acute hazardous waste chemicals within the\nmeaning of O.Reg. 347, as amended from time to time, made under the Environmental\nProtection Act, R.S.O. 1990 c. E. 19 (EPA);\n\n(b) “biochemical oxygen demand” means carbonaceous oxygen demand (biochemical) as\ndetermined by Method 507 in Standard Methods when an inhibiting chemical has been\nadded to prevent ammonia oxidation;\n\n(c) “biomedical waste” means biomedical waste as defined in the Ontario Ministry of the\nEnvironment Guideline C-4 entitled “The Management of Biomedical Waste in Ontario”\ndated April 1994, as amended from time to time;\n\n(d) “blowdown water” means water that is discharged from a cooling or heating water\nsystem for the purpose of controlling the level of water in the system or for the purpose\nof discharging from the system materials contained in the system, the further build-up of\nwhich would impair the operation of the system;\n\n(e) “combined sewer” means a sewer intended to function as a storm sewer and a sanitary\nsewer designed to carry sewage, storm water, or uncontaminated water;\n\n(f) “combustible liquid” means a liquid that has a flash point not less than 37.8 degrees\nCelsius and not greater than 93.3 degrees Celsius;\n\nPage 1 of 13\n"
    },
    {
      "page_number": 2,
      "text": "(g)\n\n(h)\n\n(i)\n\nG)\n\n(k)\n\n()\n\n(m)\n\n(n)\n\n(0)\n\n(p)\n\n“composite sample” means a volume of sewage, storm water, uncontaminated water, or\neffluent made up of three or more grab samples that have been combined automatically or\nmanually and taken at intervals during the sampling periods;\n\n“cooling water” means water that is used in a process for the purpose of removing heat\nand that has not, by design, come into contact with process materials and that has been\ncirculated through the cooling device, but does not include blowdown water;\n\n“discharger” means an individual, association, partnership, corporation, municipality, or\nan agent or employee thereof, in occupation or having the charge, management, or\ncontrol of a plant, sewage, storm water, uncontaminated water or any combination\nthereof, to which this by-law applies;\n\n“fuel” means alcohol, gasoline, naphtha, diesel fuel, fuel oil or any other ignitable\nsubstance intended for use as a fuel;\n\n“hauled sewage” means waste removed from a cesspool, a septic tank system, a privy\nvault or privy pit, a chemical toilet, a portable toilet, or a sewage holding tank;\n\n“hauled waste” means any industrial waste which is transported to and deposited into any\nlocation in the sewage works excluding hauled sewage;\n\n“ignitable waste” means a substance that,\n\ni) is a liquid, other than an aqueous solution containing less than 24 per cent alcohol\nby volume and has a flash point less than 61 degrees Celsius, as determined by the\nTag Closed Cup Tester (ASTM D-56-79), the Setaflash Closed Cup Tester\n(ASTM D-3243-77 or ASTM D-3278-78), the Pensky-Martens Closed Cup Tester\n(ASTMD-93-79), or as determined by an equivalent test method,\n\nii) is a solid and is capable, under standard temperature and pressure, of causing fire\nthrough friction, absorption of moisture or spontaneous chemical changes and,\nwhen ignited, burns so vigorously and persistently that it creates a danger;\n\niii) is an ignitable compressed gas as defined in the regulations under the\nTransportation of Dangerous Goods Act, 1992, S.C. 1992, as amended,\niv) is an oxidizing substance (Class 5, Divisions | and 2) as defined in the regulations\n\nunder the Transportation of Dangerous Goods Act, 1992, S.C. 1992, as amended;\n\n“industrial” means of or pertaining to industry, manufacturing, commerce, trade,\nbusiness, or institutions as distinguished from domestic or residential;\n\n“pathological waste” means pathological waste within the meaning of O.Reg. 347. as\namended from time to time, made under the Environmental Protection Act, R.S.O. 1990\n\nc.E.19 (EPA);\n\n“PCB” means any monochlorinated or polychlorinated biphenyl or any mixture of them\nor mixture that contains one or more of them;\n\nPage 2 of 13\n"
    },
    {
      "page_number": 3,
      "text": ")\n(u)\n\n(v)\n\n(w)\n\n(x)\n\n(y)\n\n(2)\n\n“PCB waste” means a PCB waste within the meaning of O.Reg.352, as amended, made\nunder the Environmental Protection Act, R.S.O. 1990 c.E. 19 (EPA);\n\n“pesticides” means a pesticide regulated under the Pesticides Act, R.S.O. 1990, c.P. 11;\n\n“pH” means the logarithm to the base 10 of the reciprocal of the concentration of\nhydrogen ions in moles per litre of solution;\n\n“plant” means any site capable of discharging to a sewage works covered by this bylaw;\n\n“reactive waste” means a substance that,\n\n(a) is normally unstable and readily undergoes violent changes without detonating,\n\n(b) reacts violently with water,\n\n(c) forms potentially explosive mixtures with water,\n\n(d) when mixed with water, generates toxic gases, vapours or fumes in a quantity\nsufficient to present danger to human health or the environment,\n\n(e) is a cyanide or sulphide bearing waste which, when exposed to pH conditions\nbetween 2 and 12.5, can generate toxic gases, vapours or fumes in a quantity\nsufficient to present danger to human health or the environment,\n\n(f) is capable of detonation or explosive reaction if it is subjected to a strong initiating\nsource or if heated under confinement,\n\n(g) is readily capable of detonation or explosive decomposition or reaction at standard\ntemperature and pressure,\n\n(h) is an explosive (Class 1) as defined in the regulations under the Transportation of\nDangerous Goods Act, 1992, S.C. 1992, as amended;\n\n“sanitary sewer” means a sewer for the collection and transmission of domestic,\nresidential, commercial, institutional and industrial sewage or any combination thereof;\n\n“severely toxic waste” means waste containing any contaminant listed in Schedule 3 of\nO.Reg. 347, as amended from time to time, made under the Environmental Protection\nAct, R.S.O. 1990c.E. 19 (EPA);\n\n“sewage” means any liquid, solid or gas containing organic, inorganic, animal, vegetable\nor mineral matter in solution or in suspension but does not include storm water or\nuncontaminated water;\n\n“sewage works” means any works for the collection, transmission, treatment and disposal\nof sewage, storm water or uncontaminated water, including a combined sewer, sanitary\nsewer or storm sewer, or any part of such works, but does not include plumbing or other\nworks to which the Building Code Act, 1992 applies;\n\n“sewer” means a pipe, conduit, drain, open channel, or ditch for the collection and\n\ntransmission of sewage, storm water and/or uncontaminated water, or any combination\nthereof;\n\nPage 3 of 13\n"
    },
    {
      "page_number": 4,
      "text": "(aa)\n\n(bb)\n\n(cc)\n\n(dd)\n\n(ee)\n\n(ff)\n\n(gg)\n\n(hh)\n\n“single grab sample” means a portion of the discharge from or deposit to the sewage\nworks taken at a particular time and place;\n\n“spill” means a direct or indirect discharge or deposit to the sewage works storm sewer or\nthe natural environment which is abnormal in quantity or quality in light of all the\ncircumstances of the discharge;\n\n“Standard Methods” means a procedure set out in Standard Methods for the Examination\nof Water and Wastewater published jointly by the American Public Health Association,\nAmerican Water Works Association and the Water Environment Federation latest\nedition;\n\n“storm sewer” means a sewer for the collection and transmission of uncontaminated\nwater, storm water, drainage from land or from a watercourse or any combination\nthereof;\n\n“storm water” means rainwater runoff, water runoff from roofs, flow from foundation\ndrains, snow melt, and surface runoff;\n\n“uncontaminated water” means potable water as supplied by the municipality or any\nother water to which no matter has been added as a consequence of its use;\n\n“waste disposal site leachate” means the liquid containing dissolved or suspended\ncontaminants which emanates from waste and is produced by water percolating through\nwaste or by liquid in waste;\n\n“waste radioactive prescribed substances” means uranium, thorium, plutonium,\nneptunium, deuterium, their respective derivatives and compounds and such other\nsubstances as the Atomic Energy Control Board may designate as being capable of\nreleasing atomic energy or as being requisite for the production, use or application of\natomic energy.\n\nPART 2\n\nSANITARY & COMBINED SEWER REQUIREMENTS\n\n2.1\n\nNo discharger shall cause or permit the deposit or discharge of sewage into a sanitary or\ncombined sewer in any of the circumstances set out in Sections 2.1.1 to 2.1.4.\n\nSewage which causes or may cause or results or may result in any one or more of the\n\nfollowing conditions:\n\n(a) a health or safety hazard to a sewage works person authorized to operate, maintain,\nrepair or otherwise work on a sewage works;\n\n(b) a breach of the Ontario Water Resources Act or the Environmental Protection Act, as\namended from time to time, or any regulation made there under from time to time;\n\n(c) failure to meet, either directly or indirectly as a result of a sewage discharge, the\nobjectives and criteria as set out in the Ministry of the Environment publication\n\nPage 4 of 13\n"
    },
    {
      "page_number": 5,
      "text": "entitled “Guidelines for the Utilization of Biosolids and Other Wastes on Agricultural\nLand” dated March 1996, as amended from time to time;\n\n(d) an obstruction or restriction to the flow of the sanitary sewer or combined sewer;\n\n(e) an offensive odour to emanate from sewage works, and without limiting the\ngenerality of the foregoing, sewage containing hydrogen sulphide, carbon disulphide,\nother reduced sulphur compounds, amines or ammonia in such quantity as may cause\nan offensive odour;\n\n(f) damage to the sanitary or combined sewer works infrastructure;\n\n(g) interference with the operation or maintenance of the sewage works, or which may\nimpair or interfere with any sewage treatment process;\n\n(h) an obstruction or restriction to the flow in sewage works.\n\nSewage with any one or more of the following characteristics:\n\n(a) a pH less than 6.0 or greater than 10.5;\n\n(b) consisting of two or more Environmental Protection Act rate liquid layers;\n(c) having a temperature greater than 60 degrees Celsius.\n\nSewage containing one or more of the following:\n\n(a) biomedical waste, except where the sewage meets the conditions for discharge as\nlisted in the Ontario Ministry of the Environment Guideline C-4 entitled “The\nManagement of Biomedical Waste in Ontario” dated April 1994, as amended from\ntime to time;\n\n(b) combustible liquid;\n\n(c) fuel;\n\n(d) acute hazardous waste chemicals;\n\n(e) hauled sewage, except where:\n\ni. the carrier of the hauled sewage is a waste management system operating under\na certificate of approval or provisional certificate of approval issued under the\nEnvironmental Protection Act or is exempt from the requirement to have a\ncertificate or provisional certificate of approval;\n\nli. a copy of the most recent certificate or provisional certificate and any\namendment is provided to the municipality; and\n\niii. the carrier meets all conditions for discharge that are or may be required from\ntime to time by the municipality;\n\n(f) hauled waste, except where:\n\ni. the carrier of the hauled waste is a waste management system operating under a\ncertificate of approval or provisional certificate of approval issued under the\nEnvironmental Protection Act or is exempt from the requirement to have a\ncertificate or provisional certificate of approval;\n\nli. a copy of the most recent certificate or provisional certificate and any\namendment is provided to the municipality;\n\niii. hauled waste meets the conditions set out in sections 23(3)(c) and 25(5)(b) of\nO.Reg. 347, R.R.O. 1990 made under the Environmental Protection Act, as\namended from time to time; and\n\niv. the carrier meets all conditions for discharge that are or may be required from\ntime to time by the municipality;\n\nPage 5 of 13\n"
    },
    {
      "page_number": 6,
      "text": "2.2\n\n(g) ignitable waste;\n\n(h) PCB waste, except where:\n\ni. the discharger has a certificate of approval for a mobile site or PCB mobile\nwaste disposal system issued under the Environmental Protection Act or where\nthe discharger is claiming an exemption, the discharger has demonstrated to the\nmunicipality that the conditions of the exemption are met;\n\nli. a copy of the most recent certificate or provisional certificate and any\namendment is provided to the municipality;\n\niii. the discharger has written approval from the municipality for the discharge of\nthe PCB waste to the sewage works; and\n\niv. all requirements of O.Reg. 352 made under the Environmental Protection Act\nare met;\n\n(i) pesticides;\n\n(j) reactive waste;\n\n(k) waste radioactive prescribed substances, except where:\n\ni. the waste radioactive prescribed substances are being discharged under a valid\nand current licence issued by the Atomic Energy Control Board or its\nsuccessor;\nand\n\nli. acopy of the licence has been provided to the municipality.\n\n(1) waste disposal site leachate, except where:\n\ni. the discharger has written approval from the municipality which authorizes the\ndischarge or deposit of the waste disposal site leachate to the sewage works;\nand\n\nli. where a certificate of approval or order has been issued which includes a\nprovision for the disposal of waste disposal site leachate to the sewage works, a\ncopy of the certificate of approval or order is provided to the municipality or\nwhere the discharger is claiming an exemption, the discharger has demonstrated\nto the municipality that the conditions of the exemption are being met and has\nreceived notice in writing from the municipality approving such discharge to\nthe sewage works.\n\n(m) solid or viscous substances in quantities or of such size to be capable of causing\nobstruction to the flow in a sewer, including but not limited to ashes, bones, cinders,\nsand, mud, soil, straw, shavings, metal, glass, rags, feathers, tar, plastics, wood,\nunground garbage, animal parts or tissues, and paunch manure;\n\nSewage containing a concentration, expressed in milligrams per litre, in excess of any\none or more of the limits in Table 1 of this by-law entitled “Limits for Sanitary and\nCombined Sewers Discharge”.\n\nDischarge of cooling water, ground water, storm water and uncontaminated water is\n\nprohibited to a sanitary sewer except where:\n\n(a) discharges which have been permitted by the municipality or its predecessor prior to\nthe enactment of this by-law or discharges which have been regularly made since the\nenactment date of this by-law are identified to the municipality by the discharger by\n(month day year) and the municipality has provided exemption in writing to the\ndischarger; or\n\nPage 6 of 13\n"
    },
    {
      "page_number": 7,
      "text": "2.3\n\n(b) the discharger has entered into an agreement with the municipality regarding the\ndischarge prior to any discharge and the discharger is complying with the agreement.\n\nDischarge of water which originates from a source separate from the potable water\nsupplied by the municipality is prohibited to a combined sewer or sanitary sewer except\nwhere the following is met:\n\n(a) the amount of water, location of the water source, and address of discharger where the\nwater is being used is provided to the municipality;\n\n(b) in the case where the amount of water taken is greater than 50,000 litres per day and a\ncopy of the Permit to Take Water issued under the ONTARIO WATER\nRESOURCES ACT is required, a copy of the Permit to Take Water is provided to\nthe municipality;\n\n(c) in the case where the discharger is claiming exemption from the requirement to have\na certificate of approval, the discharger has demonstrated to the municipality that the\nconditions are met; and\n\n(d) the discharger has entered into an agreement with the municipality regarding the\ndischarge prior to any discharge and the discharger is complying with the agreement.\n\nPage 7 of 13\n"
    },
    {
      "page_number": 8,
      "text": "LIMITS FOR SANITARY & COMBINED SEWERS DISCHARGE\n\nLIMIT LIMIT\n\nPARAMETER mg/L PARAMETER mg/L\nMercury (total) 0.05 Benzene 0.01\nCadmium (total) 0.7 Ethylbenzene 0.16\nArsenic 1 (Chloroform 0.04\nPhenolics 1 1,4 Dichlorobenzene 0.47\nLead (total) 2 Methylene Chloride 0.21\nCyanide (total) 2 1,1,2,2 Tetrachloroethane 0.04\n(Copper (total) 3 Tetrachloroethylene 0.05\nNickel (total) 3 Trichloroethylene 0.07\nZinc (total) 3 Toluene 0.27\nChromium (total) 5 |O-Xylene 0.52\nCobalt (total) 5\nMolybdenum (total) 5\nSilver (total) 5\n[Antimony (total) 5\nSelenium (total) 5\nBismuth 5\nManganese (total) 5\nTin (total) 5\nTitanium (total) 5\nVanadium (total) 5\nPhosphorus (total) 10\nFluoride 10\nOil & Grease - mineral or synthetic in origin 15\n[Aluminum (total) 50\nlron 50\nKjeldahl Nitrogen (total) 100\nOil & Grease - animal or vegetable in origin 150\nBiochemical Oxygen Demand 300\nSuspended Solids (total) 350\n(Chlorides 1500\nSulphates 1500\n\nPage 8 of 13\n\n"
    },
    {
      "page_number": 9,
      "text": "PART 3\n\nPROHIBITION OF DILUTION\n\n3.1\n\nThe addition of water or any other material from any source which is added to sewage for\nthe purposes of dilution to achieve compliance with Part 2 is prohibited.\n\nPART 4\n\nSTORM SEWER REQUIREMENTS\n\n4.1\n\nDischarge to a storm sewer is prohibited unless all of the following are met:\n\n(a) the discharge is cooling water or storm water or uncontaminated water;\n\n(b) the discharge does not interfere with the proper operation of a storm sewer;\n\n(c) the discharge does not obstruct or restrict a storm sewer or the flow therein;\n\n(d) the discharge does not damage a storm sewer;\n\n(e) the discharge does not result in any hazard or other adverse impact, to any person,\n\nanimal, property, or vegetation;\n\n(f) the discharge does not impair the quality of the water in any well, lake, river, pond,\n\nspring, stream, reservoir or other water or watercourse;\n\n(g) the discharge does not contravene or result in the contravention of a certificate or\n\nprovisional certificate issued under the Ontario Water Resources Act or the\nEnvironmental Protection Act;\n\n(h) the discharge does not have one or more of the following characteristics:\n\n(i)\n\n1, two or more separate layers;\nli. apH less than 6.5 or greater than 8.5;\niii. a temperature greater than 40 degrees Celsius;\niv. visible film, sheen or discolouration;\nv. biochemical oxygen demand greater than 15 mg./L;\nvi. suspended solids (total) greater than 15 mg/L;\nthe discharge does not contain one or more of the following:\n\ni. biomedical waste as defined in the Ontario Ministry of the Environment\nGuideline C-4 entitled “The Management of Biomedical Waste in Ontario”\ndated April 1994, as amended from time to time;\n\nii. combustible liquids;\nili. fuels;\niv. hauled sewage;\nv. hauled waste;\nvi. ignitable waste;\nvii. PCB waste;\n\nvill. pesticides;\n\nix. reactive waste;\n\nx. waste radioactive prescribed substances;\nx1. waste disposal site leachate;\nxii. floating debris;\n\nxiii.\nxiv.\n\nhazardous industrial waste;\nhazardous waste chemicals;\n\nPage 9 of 13\n"
    },
    {
      "page_number": 10,
      "text": "4.2\n\nXv. sewage;\nxvi. severely toxic waste;\nxvii. pathological waste;\nXviii. a substance used in the operation or maintenance of an industrial site;\nxix. blowdown water;\nxx. acute hazardous waste chemicals;\nxxi. E.coli colonies in excess of 200 per 100 ml.\n(j) the discharge does not contain contaminants from raw materials, intermediate or final\nproducts or wastewater from an industrial operation.\n\nA discharger may be required, upon receipt of notice from the municipality, to complete\none or more of the following activities as stated in the notice addressing storm water from\nthe discharger’s site:\n\n(a) a study on storm water quality and/or quantity;\n\n(b) modification and/or construction of storm water facilities;\n\n(c) development and implementation of a best management plan;\n\n(d) adoption and implementation of pollution prevention techniques and measures;\n\n(e) development and adoption of an environmental management system; or\n\n(f) any other requirement as specified by the municipality.\n\nPART5\n\nDISCHARGER SELF-MONITORING\n\n5.1\n\n5.2\n\nThe discharger shall complete, any monitoring or sampling of any discharge to a sewage\nworks, as required by the municipality, and provide the results to the municipality in\naccordance with written notification from the municipality.\n\nThe obligations set out in or arising out of Section 5.1 shall be completed at the expense\nof the discharger unless the municipality has agreed in writing to share the expense with\nthe discharger.\n\nPART 6\n\nEXTRA STRENGTH SURCHARGE AGREEMENT\n\n6.1\n\nThe municipality may authorize an extra strength surcharge agreement with a discharger\nto permit exceedances for any one or more of the following parameters set out in Table 1,\nreferred to in Section 2.1.4, for the following, where sewage is discharged to a sanitary\nsewer or combined sewer:\n\n(a) Biochemical Oxygen Demand;\n\n(b) Phenolics (4AAP);\n\n(c) Solvent Extractables — animal or vegetable in origin;\n(d) Kjeldahl Nitrogen, Total;\n\n(e) Phosphorus, Total; or\n\n(f) Suspended Solids, Total.\n\nPage 10 of 13\n"
    },
    {
      "page_number": 11,
      "text": "6.2\n\n6.3\n\n6.4\n\nThe agreement may contain terms and conditions including terms and conditions related\nto the calculation and payment for the discharge to the sanitary sewer or combined sewer.\n\nDuring the term of the agreement, the discharger is exempt from meeting the limits set\nout in the Table referred to in Section 2.1.4 for the parameter(s) included in the\nagreement, if all conditions stipulated by the municipality in the agreement are met.\n\nThe municipality may terminate the agreement at any time and the termination will be\neffective within seven (7) days of the delivery of a written notice to the discharger’s site\nor head office.\n\nPART 7\n\nSAMPLING AND ANALYSIS\n\n7A\n\n7.2\n\n7.3\n\n7.4\n\nOne sample alone is sufficient and, without limiting the generality of the foregoing the\nsample may be a grab sample or a composite sample, may contain additives for its\npreservation and may be collected manually or by using an automatic sampling device.\n\nExcept as otherwise specifically provided in this by-law, all tests, measurements,\nanalyses and examinations of sewage, uncontaminated water and storm water, shall be\ncarried out in accordance with Standard Methods and at a laboratory accredited by the\nCanadian Association of Environmental Analytical Laboratories (CAEAL).\n\nIn the case of sampling a discharge to a combined sewer, any storm water or\nuncontaminated water which is discharged at the time of sampling, is not to be\nconsidered a component of the sample for determining compliance with Section 2.1.2 or\nSection 2.1.4 of this by-law.\n\nA discharger is responsible for any requirements set out in this by-law in respect of\ndischarges or deposits of sewage, storm water or uncontaminated water into that part of a\nsewage works over which the discharger has or could have control.\n\nPART 8\n\nMAINTENANCE ACCESS POINTS\n\n8.1\n\n8.2\n\nThe municipality may require in written notification, the installation of maintenance\naccess points or the upgrading of existing maintenance access points, for each connection\nto the sewage works at the site of a discharger, for the purpose of monitoring or sampling\ndischarges as set out in Section 7.4.\n\nMaintenance access points required under Section 8.1 shall be:\n\n(a) located on the property of the discharger unless the municipality permits an\nalternative location;\n\n(b) accessible at all times by the municipality;\n\nPage 11 of 13\n"
    },
    {
      "page_number": 12,
      "text": "(c) constructed in a manner which meets the standards of the municipality;\n(d) maintained to ensure access and structural integrity; and\n(e) maintained and constructed at the expense of the discharger.\n\nPART 9\n\nSPILLS\n\n9.1\n\nIn the event of a spill to a sewage works, the discharger shall immediately notify the\nmunicipality, provide any information with respect to the spill which the municipality\nadvises it requires and complete any work the municipality requires to mitigate the spill.\n\n9.2 The discharger shall provide a report on the spill to the municipality, within seven (7)\n\ndays after the spill, containing the following information:\n\n(a) location where spill occurred;\n\n(b) name and phone number of person who reported the spill and location where they\ncan be contacted;\n\n(c) date and time of spill;\n\n(d) material spilled;\n\n(e) characteristics of material spilled;\n\n(f) volume of material spilled;\n\n(g) duration of spill event;\n\n(h) work completed and/or still in progress in the mitigation of the spill; and\n\n(i) preventative actions being taken to ensure the situation does not occur again.\n\nPART 10\n\nOFFENCES\n\n10.1 Any person who contravenes any provision of this By-Law is guilty of an offence and\nupon conviction is liable to a fine of $10,000.00 for a first offence and upon subsequent\nconvictions under this By-Law to a fine of $25,000.00 for any subsequent offence.\n\n10.2 Despite section 10.1 where a corporation is convicted of an offence under this By-Law,\nthe maximum penalty that may be imposed upon such corporation is $50,000.00 for the\nfirst office and $100,000.00 for any subsequent offence.\n\nPART 11\n\nGENERAL PROVISIONS\n\n11.1. THAT By-Law Number 8420 and all other by-laws related hereto be and the same are\n\nhereby rescinded.\n\nPage 12 of 13\n"
    },
    {
      "page_number": 13,
      "text": "THIS BY-LAW SHALL COME INTO FORCE AND TAKE EFFECT IMMEDIATELY\nON AND AFTER THE PASSING THEREOF.\n\nREAD A FIRST TIME THIS 28™ _ DAY OF JANUARY, 2002.\n\nREAD A SECOND TIME THIS _ 28\" __ DAY OF JANUARY, 2002.\n\nREAD A THIRD TIME AND FINALLY PASSED THIS 28' DAY OF JANUARY , 2002.\n\nGEORGE A. ZEGOURAS MAYOR\n\nJARY PLAMONDON CITY CLERK\n\nPage 13 of 13\n"
    }
  ]
}