{
  "file_name": "BL 2012-41 A Bylaw for the Prohibition and Abatement of Certain Public Nuisances.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\nBY-LAW NUMBER 2012-41\n\nBEING A BY-LAW FOR THE PROHIBITION AND ABATEMENT OF CERTAIN\nPUBLIC NUISANCES IN THE CITY OF BELLEVILLE\n\nWHEREAS Section 8 of the Municipal Act, .S.O. 2001, c. 25, provides that\na council may pass by-laws for governing their affairs as they consider\nappropriate;\n\nAND WHEREAS Section 128 of the Municipal Act, S.O. 2001, c.25,\nprovides that a municipality may prohibit and regulate public nuisances, including\nmatters that, in the opinion of council are or could become or cause public\nnuisances;\n\nAND WHEREAS the Council of the Corporation of the City of Belleville\ndeems it expedient to pass a by-law for this purpose;\n\nNOW THEREFORE BE IT ENACTED BY THE COUNCIL FOR THE\nCORPORATION OF THE CITY OF BELLEVILLE AS FOLLOWS:\n\n1. ‘TITLE\nThis By-law may be cited as the “Nuisances By-law”.\n2. DEFINITIONS\n\nIn this By-law, the terms in the following lettered paragraphs shall have\nmeanings as indicated in this section. Words printed in capital letters are\nused as defined in this section. Words printed in upper and lower case\nletters should be read in the context of their ordinary, everyday meanings:\n\n(a) To “SOLICIT” means to request, in person, immediate provision of\nmoney or another thing of value, regardless of whether consideration is\noffered or provided in return, using the spoken, written or printed word,\na gesture or other means.\n\n(b) The “CITY” means The Corporation of the City of Belleville and, where\nthe context so implies, members of its staff and council.\n\n(c) “FIGHT” means any confrontation involving violent physical contact\nbetween two or more people.\n"
    },
    {
      "page_number": 2,
      "text": "By-law Number 2012-41 Page 2\n\n(d) “LOITER” means to remain or linger in an area aimlessly and for no\nobvious reason,\n\n(e) “OFFICER” means a police OFFICER or a municipal by-law\nenforcement officer assigned the responsibility of enforcing this by-law.\n\n(f) “PERSON” includes an individual, sole proprietorship, partnership,\nunincorporated association, trust, or a body corporate.\n\n(g) “PEDESTRIAN” means a person on any part of a STREET who is on\nfoot, or a person in a wheelchair, baby carriage, or any similar, legally\noperated, ambulatory device.\n\n(h) “PUBLIC NUISANCE” means an activity or activities, intentional or\notherwise, which have a detrimental impact on the use and enjoyment\nof property in the vicinity of the premises.\n\n(i) “PUBLIC PLACE” includes a sidewalk, pedestrian walkway or trail, and\nany place to which the public have access as of right or by invitation,\nexpress or implied and private property that is exposed to public view\nbut does not include a washroom facility.\n\n(j\n\n=\n\n“SIDEWALK” means any municipal walkway or any road works for the\naccommodation of pedestrians on that portion of a STREET between\nthe curb line and the adjacent abutting property.\n\n(k) “STREET” means a common and public highway, street, avenue,\nparkway, driveway, square, place, bridge, viaduct or trestle, designed\nand intended for, or used by, the general public for the passage of\nvehicles or PERSONS, , and includes any surface, grassed area,\nboulevard, ditch, curb, gutter, and sidewalk within the lateral property\nlines of the STREET.\n\n3. PROHIBITION AGAINST CERTAIN PUBLIC NUISANCES\n\n(a) No PERSON shall SOLICIT, either from door to door, or on any\nSTREET or in any other PUBLIC PLACE, except as provided for in any\nother By-law passed by the CITY.\n"
    },
    {
      "page_number": 3,
      "text": "By-law Number 2012-41 Page 3\n\n(b) No PERSON shall on any STREET or in any PUBLIC PLACE solicit\nany other PERSON for any commercial purpose, except as provided\nfor in any other By-law passed by the CITY.\n\n(c) No PERSON shall form part of a group of persons congregated on a\nSTREET in such a manner as to obstruct the free passage of\nPEDESTRIANS or vehicles.\n\n(d)No PERSON shall on any STREET, or on any PEDESTRIAN\nwalkways, or in any other PUBLIC PLACE, crowd or jostle\nPEDESTRIANS or create discomfort, disturbance or confusion for\nPEDESTRIANS.\n\n(e) No PERSON shall conduct any activity which interferes with travel or\nother lawful use of a STREET or PUBLIC PLACE.\n\n(f) No PERSON shall loiter on any STREET or in any PUBLIC PLACE.\n\n(g) No PERSON shall deface or damage any property owned by the CITY.\n(h) No PERSON shall cause or permit any PUBLIC NUISANCE.\n\n(i) No PERSON shall mark or apply graffiti on any STREET, PUBLIC\nPLACE or CITY property.\n\n(j) No owner or occupant of property shall fail to maintain the property\nfree of graffiti.\n\n(k) No PERSON shall obstruct an OFFICER by refusing to identify\nthemselves when requested to do so by an OFFICER in the\nperformance of his/her duties in the enforcement of this By-law.\n\n(1) No PERSON shall urinate, defecate, vomit or spit ina PUBLIC PLACE\norona STREET.\n\n(m)No PERSON shall knock over or attempt to knock over a Canada Post\nmailbox, newspaper box, bench, fence, blue box or garbage container,\nor any other structure or object located in a PUBLIC PLACE. This\nsection shall not apply to City employees or persons under contract\nwith the City, acting under the jurisdiction of the City.\n\n(n) No PERSON shall participate in a FIGHT in any Public Place or\nSTREET.\n\n(0) No PERSON shall operate, or permit others to operate, a motor vehicle\nor bicycle on a sidewalk. This section shall not apply to a person who,\n"
    },
    {
      "page_number": 4,
      "text": "By-law Number 2012-41 Page 4\n\ni) operates a wheelchair, scooter or other device power by an electric\npropulsion system designed to transport a person with a disability;\n\nii) Operates a motor vehicle or bicycle across a portion of a sidewalk\nwhich intersects with a lawful private entrance; or\n\niii) operates a bicycle on that portion of a sidewalk which connects a\nbicycle path with a roadway.\n\n4, EXCEPTIONS\nSections 3(a) and 3(b) of this by-law shall not apply to:\n\n(a) _ the authorized solicitation of donations on behalf of registered\ncharities, or\n\n(b) solicitation performed in accordance with a licence issued under\nany other By-law passed by the City.\n\n5. PROSECUTION\n\nProsecution under this by-law with respect to these offences shall not\npreclude any other legal actions required to recover damages required to\nrepair, replace or restore damaged real or personal property, as the case\nmay be.\n\n6. ENFORCEMENT\n\nThe provisions of this By-law may be enforced by a municipal law\nenforcement officer, police officer or other individual duly appointed for the\npurpose of enforcing this by-law.\n\n7. PENALTIES\n\nAny person who contravenes any provision of this by-law is guilty of an\noffence and upon conviction shall be liable to such fines and penalties as\nare prescribed by the Provincial Offences Act, R.S.O. 1990, c.P.33 as\namended.\n"
    },
    {
      "page_number": 5,
      "text": "By-law Number 2012-41 Page 5\n\n10.\n\nINTERPRETATION\n\nAll words and personal pronouns relating to words contained in this by-law\nshall be read and construed with the number and gender of the person or\n\npersons referred to in each case. Paragraph headings are inserted solely\nfor ease of reference.\n\nSEVERABILITY\n\nIf any section, clause or provision of this By-law is for any reason declared\nby a court of competent jurisdiction to be invalid, the same shall not affect\nthe validity of this By-law as a whole or any part thereof other than the\nsection, clause or provision so declared to be invalid and it is hereby\ndeclared to be the intention of Council for the City that all remaining\nsections, clauses or provisions of this By-law shall remain in full force and\neffect until repealed, notwithstanding that one or more provisions thereof\nmay have been declared invalid.\n\nREPEAL\n\nBy-law Number 13858 is hereby repealed.\n\nTHIS BY-LAW SHALL COME INTO FORCE AND TAKE EFFECT IMMEDIATELY ON\nAND AFTER THE PASSING THEREOF.\n\nRead a first time this 26\" day of March 2012.\n\nRead a second time this 26\" day of March 2012.\n\nRead a third time and finally passed this 26\n\n2012.\n\n"
    },
    {
      "page_number": 6,
      "text": "PROVINCIAL OFFENCES ACT\n\nPart |\n\nIT IS ORDERED pursuant to the provisions of the Provincial Offences Act and\nthe rules for the Ontario Court of Justice, that the amount set opposite each of\nthe offences in the schedule of offences under the Provincial Statutes and\nRegulations thereunder and Municipal By-law No. 2012-41 of the Corporation\nof the City of Belleville, attached hereto is the set fine for that offence. This\n\nOrder is to take effect on May 30\", 2012\n\nDated at Ottawa this 30\" day of May 2012.\n\nALT ee\n\nise T. Maisonneuve, Regional Senior Justice\nOntario Court of Justice\nEast Region\n"
    },
    {
      "page_number": 7,
      "text": "“pally ueeq\nsey Yoiym jo Adod payiad e ‘L-ZLOZ ME|-Ag JO £ UO!]Dag Ul PaU!e}UOD si BAOGe payesipul saduayo 404 (s)UO!sIAOId Ayjeuad ay] zaJON\n\nOOL $ (0)€°S JEMAPIS UO a]IIYaA JOJO aye1adO ZL\n0s $ (VES JEMapIs UO ajDADIq ayesadQ OL\n001 $ (ues yaaisyece|d Syqnd ul yyy ul ayediomeg SL\nOOL $ (W)ES aoe}d S1jqnd ul payeso] ainyonsj}s AO DOU 0} JdWaRYy al\n001 $ (DES years 10 adejd d1/qQnd ul ydsAlWOA/eyedajap/a]eUul €L\nOSL $ ONE'S pajsonbeal uaym jjes Ayjuap! 0} Sulsnjed Aq 4951430 ON.ASGOC, ZL\nho JOT 67 | (he's yJeIS JO aa1y Apodoud uyejuleur 0} [ey JUeMNID0/F9UME LL\naa 0% oe $ OES Auadosd AyD/e0e|d o1jqndjaens uo HyyeIs Ajddy OL\n- OSL $ (Wes souesinu 31|\\Gnd Wuuedsasne> 6\ni990 OOZ one $ (BES Aula Aq paumo Apdoid asewepsesejaq 8\nos $ es aorjd dNqndjsaiys uo WO]! Z\nOOL $ (ES aoe|d S1jqndjsaujs Jo asn jnyme; YIM BuLEpoul AYIANOe jONpuOD 9\nos $ (P)ES Aemyjem uelysopedjea.is UO sUuRLSEpad GINjsIp/e[Isol/pPMolD S\nOSL $ Nes SO[DIYaA JO SUBLSOpad JO aBessed 9aij DNISGO y\n00c $ (e's asodind jelsuauwdd 104 ade}d S1jqndjseis UO HOI|0S €\n00z $ es goed a1Qndfjeas UO YID1]0S Z\nL 00z $ ES = JOOP 0} 100p WO UDI}OS L\nauaTO Suiuyjeqg rT\noUuly Jes 40 suneasy UOISIAOA SUIPsOM wW404 140Ys Will\n€ NWN109 ¢ NWNTOD L NWONT09\n\n9|JAQ]}9g JO APD ay} UI saduURsINU d1;qnd\nule}ed JO JuBWAa}ege pue UOIIqiyoid ay} 10J me|-Ag B Bulag ‘Lp-ZLOTH MPI-Ag\n\nIOV SADN44d4dO TVIDNIAOUd ‘L LYWd\nATMAII11499 JO ALID AHL JO NOLLVYOdUOD JHL\n\nFINGIHDS ANIA 14s\n\n"
    }
  ]
}