{
  "file_name": "BL 2025-122 Noise By-law - Repeals 2011-180.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "The Corporation of the City of Belleville\nBy-law Number 2025-122\n\nA By-law to Regulate Noise Within the City of Belleville\nAnd Repeal By-law Number 2011-180\n\n(Noise By-law)\n\nWhereas Section 128 of the Municipal Act, 2001, provides that a municipality may\nprohibit and regulate with respect to public nuisances, including matters that in the\nopinion of Council are or could become public nuisances;\n\nAnd Whereas Section 129 of the Municipal Act, 2001, provides that a municipality may\npass bylaws to prohibit and regulate with respect to noise;\n\nAnd Whereas Section 10 (2) of the Municipal Act, 2001, S.O. 2001, c.25, as amended,\nprovides that a municipality may pass by-laws respecting health, safety, and the well\nbeing of Persons;\n\nAnd Whereas Section 425 (1) of the Municipal Act, 2001, S.O. 2001, c.25, as\namended, provides that a municipality may pass by-laws providing that a Person who\ncontravenes a by-law of the municipality passed under the Municipal Act is guilty of an\noffence;\n\nAnd Whereas the Council for The Corporation of the City of Belleville deem it\nappropriate to regulate noise;\n\nNow Therefore the Council of The Corporation of the City of Belleville hereby enacts as\nfollows:\n\n1. Definitions\n1.1. City shall mean The Corporation of the City of Belleville;\n\n1.2. Clerk shall mean the City Clerk appointed pursuant to Section 228 of the\nMunicipal Act, 2001, by the Council of The Corporation of the City of Belleville or\ntheir designate;\n\n1.3. Construction includes erection, alteration, repair, dismantling, demolition,\nstructural maintenance, painting, moving, land clearing, earth moving, grading,\nexcavating, the laying of pipe and conduit whether above or below ground level,\nstreet and highway building, concreting, equipment installation and alteration and\nthe structural installation of construction components and materials in any form or\nfor any purpose, and includes any work in connection therewith.\n\n1.4. Construction Equipment means any equipment or device designed and\nintended for use in Construction, or material handling, including but not limited to,\nair compressors, pile drivers, power tools, pneumatic or hydraulic tools,\nbulldozers, tractors, excavators, trenchers, cranes, derricks, loaders, scrapers,\npavers, generators, off-highway haulers or trucks, ditchers, compactors and\n\nPage 1 of 8\n\n"
    },
    {
      "page_number": 2,
      "text": "rollers, pumps, concrete mixers, graders, or other material handling equipment;\n1.5. Council shall mean the Council of The Corporation of the City of Belleville;\n\n1.6. Dwelling Unit shall mean a residential unit that is used or intended for use as a\nresidence by an individual or household in which a bathroom and some culinary\nconveniences are provided for the exclusive use of such individual or household\nand with a private entrance from outside the building or from a common hallway or\nstairway inside, but does not include a hotel or recreational! vehicle;\n\n1.7. Motor Vehicle shall mean an automobile, truck, motorcycle, and any other\nvehicle propelled or driven otherwise than by muscular power, but does not\ninclude a motorized snow vehicle, traction engine, self-propelled implement of\nhusbandry or road building machine within the meaning of the Highway Traffic\nAct, R.S.O 1990, c. H.8, as amended.\n\n1.8. Officer shall mean a By-Law Enforcement Officer appointed by the City of\nBelleville, a Police Officer in the Province of Ontario or any Person as authorized\nby the Council of the Corporation of The City of Belleville for the enforcement of\nmunicipal by-law;\n\n1.1. Person shall mean any individual, association, firm, partnership, or incorporated\ncompany.\n\n1.9. Point of Reception shall mean any geographic location at which noise can be\nheard other than the premises from which the noise originates;\n\n1.10.Special Event includes a demonstration, parade, sports event, festival, carnival\nand other similar events.\n\n2. General Prohibition\n\n2.1. No Person shall cause or permit the emission of any noise resulting from any of\nthe activities listed in Schedule “A” of this By-law if the noise is audible at the\nPoint of Reception.\n\n2.2. No Person shall cause or permit the emission of any noise resulting from any of\nthe activities listed in Schedule “B” of this By-law during the listed prohibited\nperiod of time if the noise is audible at the Point of Reception.\n\n3. Exemption :\n\n3.1. This By-law shall not apply to a Person who causes or permits the emission of\nnoise in connection with any of the activities listed in Schedule “C” of this By-law.\n\ni\n\nH\n\n3.2. The Clerk may require mitigation measures as necessary to give force and effect\nto this By-law.\n\n4. Temporary Noise Exemption Permits\n\n4.1. Any Person may make application to the Clerk to be granted an exemption by the\nissuance of a temporary noise exemption permit from any of the provisions of this\n\nPage 2 of 8\n"
    },
    {
      "page_number": 3,
      "text": "42.\n\n423.\n\n44.\n\nBy-law. The application for the issuance of a temporary noise exemption permit\nshall be made in writing at least 45 days prior to the commencement of the\nrequested exemption and shall contain:\n\na. The name of the applicant;\n\nb. Adescription of the source of the sound in respect of which exemption is\nsought;\n\nc. Astatement of the particular provision(s) of the By-law from which exemption\nis sought;\n\nd. A period of time for which the exemption is sought;\n\ne. Rationale for the request;\n\nf. Proof of circulation of a notice of intention to apply for any exemption to this\nBy-law, in the form of a document as prescribed by the City, to all residences\nwithin a 120 metre radius of the subject property containing the information\nrequired by Section 4.4.a through Section 4.4.e.;\n\ng. The non-refundable permit fee as prescribed by the City’s current Fees and\nCharges By-law;\n\nh. The name, address, and phone number of a Person responsible for\nsupervising the event for which the exemption is requested; and\n\ni. A declaration from the applicant that the Person named as the supervisor of\nthe event for which the exemption is being sought will be on site for the\nduration of the exemption period.\n\nThe Clerk maintains the discretion to waive the permit fee for a temporary noise\nexemption permit.\n\nIn determining whether to grant a temporary noise exemption permit and/or to\nwaive any fees, the Clerk shall:\n\na. Determine whether the applicant has complied with all terms and conditions\nof any previously issued temporary noise exemption permits, if any;\n\nb. Consider any mitigating or aggravating effects the issuance of the temporary\nnoise exemption permit may have on neighbouring properties or the City.\n\nThe Clerk may impose conditions on a temporary noise exemption permit,\nincluding but not limited to:\n\na. The type and volume of sounds that may be made;\nb. The times during which the sounds may be made;\n\nc. The date of expiry of the temporary noise permit;\n\nPage 3 of 8\n\n"
    },
    {
      "page_number": 4,
      "text": "d. Requiring the posting of security prior to the activity; and\n\ne. Requiring that the applicant, City staff or a professional engineer monitor the\nsound levels resulting from the event or activity and requiring a report of the\nfindings of the engineer to be filed with the City within 30 days of the event or\nactivity, at the applicants expense.\n\n4.5. Any temporary noise exemption permit issued under this By-law shall expire on\nthe date set out on the temporary noise exemption permit, or if no date is set out\non the temporary noise exemption permit, the permit shall expire forty-eight hours\nafter its issuance.\n\n4.6. Any breach by the holder of the temporary noise exemption permit of any of its\nterms or conditions may render the temporary noise exemption permit null and\nvoid.\n\n4.7. No holder of a temporary noise exemption permit shall fail to comply with the\nterms and conditions of the temporary noise exemption permit.\n\n4.8. The Clerk shall notify Council of the issuance of any temporary noise exemption\npermit.\n\n5. Order to Comply\n\n5.1. An Officer may order any and all Persons to cease causing noise. This includes\nthe ability to require any or all Persons involved in causing noise to leave a public\nplace.\n\n5.2. No Person shall fail to comply with an order given under the authority of the By-\nlaw.\n\n6. Enforcement and Penalties\n\n6.1. This By-law may be enforced by an Officer or other individual authorized by\nCouncil.\n\n6.2. An Officer may, at all reasonable times, enter upon any property for the purpose\nof carrying out an inspection to determine whether or not the provisions of this By-\nlaw have been complied with.\n\n6.3. No Person shall:\n\na. Prevent, hinder or interfere or attempt to interfere with an inspection\nundertaken by an Officer.\n\nb. Fail to provide identification or a required document upon request from an\nOfficer.\n\n6.4. Every Person who contravenes any provision of this By-law is guilty of an offence\n\nand upon conviction is liable to a fine as provided for in the Provincial Offences\nAct, R.S.O. 1990, c. P.33, as amended.\n\nPage 4 of 8\n\n"
    },
    {
      "page_number": 5,
      "text": "7. Validity\n\n7.1. Notwithstanding any section, subsections, clause, paragraph or provision of this\nBy-law, or parts thereof may be declared by a court of competent jurisdiction to be\ninvalid, unenforceable, illegal or beyond the powers of Council to enact, such\nsection or sections or parts thereof shall be deemed to be severable and that all\nother sections or parts of this Bylaw are separate and independent therefrom and\nenacted as such as a whole. Same shall not affect the validity or enforceability of\nany other provisions of this By-law or of the By-law as a whole.\n\n7.2. Where a provision of this By-law conflicts with the provision of another By-law,\nAct, or Regulation in force within the City of Belleville, the provisions that establish\nthe higher standards to protect the health and safety of the Persons shall prevail.\n\n8. Transition\n\n8.1. After the date of passing of this By-law, By-law Number 2011-180 shall apply only\nto those properties in which an Order has been issued prior to the date of passing\nof this By-law, and then only to such properties until such time as the work\nrequired by such Order has been completed or any enforcement proceedings with\nrespect to such Order including any demolition, clearance, or repair carried out by\nthe City shall have been concluded.\n\n9. Short Title\n9.1. This By-law may be cited as the “Noise By-law’.\n\n10.Repeal and Enactment\n\n10.1.By-law 2025-122 will take effect on August 1, 2025 and, except for the purposes\n\nset out in Section 8.1 of this By-law, By-law Number 2011-180 is hereby repealed. i\n\nBy-law read and passed this 14 day of July 2025. | | | iN\n\nNeil R. Ellis, Mayor\n\nguglas Irwin, Clerk\n\nPage 5 of 8\n"
    },
    {
      "page_number": 6,
      "text": "Item\n\nSchedule “A”\nto By-law Number 2025-122 for\nThe Corporation of the City of Belleville\n\nProhibited Noise — Any Time\n\nParticulars of Noise\n\nOperation of any electronic device or group of connected electronic devices\nincorporating one or more speakers and intended for the production,\nreproduction or amplification of sound (including car stereos) at such a volume\nthat it is audible from the interior of a residence or business whose occupant\nhas made every reasonable attempt to mitigate the reception of the noise.\n\nOperation of any electronic device or group of connected electronic devices\nincorporating one or more speakers and intended for the production,\nreproduction or amplification of sound (including car stereos) in a park area at\na volume that a reasonable Person would, in all of the circumstances, consider\nto be excessive, intrusive or disturbing.\n\nExcessive and unnecessary revving of a motor vehicle engine.\n\nOperation of a motor vehicle is such a manner that the tires squeal.\n\nThe operation of any auditory signaling device, including but not limited to the\nringing of bells or gongs and the blowing of horns or sirens or whistles, or the\nproduction, reproduction of or amplification of any similar sounds except where\nrequired or authorized in accordance with good safety practices or for\naccessibility purposes.\n\nAll selling or advertising by shouting or amplified sound, not including auctions.\n\nThe operation of any combustion engine, including any construction\nequipment, without an effective exhaust muffling device in good working order\nand in constant operation.\n\nPage 6 of 8\n\n5\ni\n\n"
    },
    {
      "page_number": 7,
      "text": "Schedule “B”\n\nto By-law Number 2025-122 for\nThe Corporation of the City of Belleville\n\nNoise Prohibited by Specified Times\n\nItem\n\nParticulars of Noise\n\nProhibited Period\n——_|\n\nThe operation of any construction equipment in\nconnection with construction, unless otherwise\nexempt under the provisions of this By-law.\n\n7:00p.m. of one day to\n7:00a.m. of the next day.\n\nThe operation of a combustion engine which is, or\nis used in, or is intended for use in, a toy or a\nmodel or replica of a larger device, which model\nor replica has no function other than amusement\nand which is not a conveyance.\n\nThe operation of any motorized conveyance other\nthan on a highway or other place intended for its\noperation.\n\nThe operation of any powered or non-powered\ntool for domestic purposes other than snow\nremoval.\n\n9:00p.m. of one day to\n6:00a.m. of the next day.\n\n9:00p.m. of one day to\n6:00a.m. of the next day.\n\n9:00p.m. of one day to\n7:00a.m. of the next day\n(9:00a.m. Sundays).\n\nThe operation of solid waste bulk lift or refuse\ncompacting equipment.\n\n11:00p.m. of one day to\n7:00a.m. of the next day.\n\nThe operation of a sound emitting pest control\ndevice.\n\n11:00p.m. of one day to\n7:00a.m. of the next day.\n\nLoading, unloading, delivering, packing,\nunpacking, or otherwise handling any containers,\nproduce, materials, or refuse unless necessary for\nthe maintenance of essential services or the\npreservation of perishable goods on residential\nzoned properties as defined by the City Zoning\nBy-law, as amended.\n\nYelling, shouting, hooting, whistling or singing-at\nsuch a volume that it is audible from the interior of\na residence or business whose occupant has\nmade every reasonable attempt to mitigate the\nreception of the noise.\n\n11:00p.m. of one day to\n7:00a.m. of the next day.\n\n11:00.pm. of one day to\n7:00a.m. of the next day.\n\nPage 7 of 8\n\n"
    },
    {
      "page_number": 8,
      "text": "Schedule “C”\nto By-law Number 2025-122 for\nThe Corporation of the City of Belleville\n\nNoise Exemptions\n\nItem\n\n|\n\nParticulars of Noise\n\nThe sounding of bells or chimes, clocks or other announcements in relation to\na property operated as a church, synagogue, temple, mosque, monastery or a\nplace of worship, or on any property owned or operated by the City.\n\nThe ringing of school bells or the sounding of a public address system on a\n\nproperty owned by the Hastings Prince Edward District Board, the Algonquin &\nLakeshore Catholic District School Board or a recognized educational\ninstitution.\n\nThe sounding of bells or horns for traffic control. Including a traffic signal or\nassociated with the operation of a railroad.\n\nNoise transferred from a dwelling unit such as walking, cleaning, talking at a\nnormal level, children playing indoors, pet, the moving of items and other usual\nbut not excessive noise generated by a permitted use of the property.\n\nMunicipal operations including but not limited to snow clearing, street cleaning\nand garbage collection, undertaken by or on behalf of the City.\n\nNoise caused by the erection, demolition, alteration or repair of a building or by\nconstruction or earth-moving equipment working upon a site or highway when\nsuch work is undertaken by forces of the City of Belleville, any other public\nutility, public agency and/or their agents.\n\nNoise caused by generators used for the curing of concrete during active\nconstruction with all applicable permits by the City from October — May.\n\n8. | Noise caused by generators used during an electric power outage.\n\n9. | Any emergency work undertaken for the immediate health, safety or welfare of\nthe inhabitants of the City or for the preservation, protection or restoration of\nproperty.\n\n10. | Any sound originating from, or caused by, the operation of farm equipment or\nmachinery for cultivating, seeding, crop maintenance or harvesting purposes\non any land designated as an agricultural area.\n\n11. | Any special event provided that the necessary permissions or approvals have\nbeen obtained from the City and/or the Belleville Police Service.\n\n12. | Noise caused by a filming event that has any required approvals by the City.\n\nPage 8 of 8\n\n"
    },
    {
      "page_number": 9,
      "text": "PROVINCIAL OFFENCES ACT\nPart I\n\nIT IS ORDERED pursuant to the provisions of the Provincial Offences Act and the\nrules for the Ontario Court of Justice, that the amount set opposite each of the\noffences in the schedule of offences under the Provincial Statutes and Regulations\nthereunder and Municipal By-law No. 2025-122, of the City of Belleville attached\nhereto is the set fine for that offence. This Order is to take effect on August 15,\n\n2025.\n\nDated at Ottawa, this 15'\" day of August 2025.\n\nElectronic Signature:\n\nW. Vincent Clifford\nRegional Senior Justice\nOntario Court of Justice\nEast Region\n"
    },
    {
      "page_number": 10,
      "text": "City of Belleville\n\nPart | Provincial Offences Act\nBy-law Number 2025-122: Noise By-law\n\nProvisions\nItem Short Form Wording Creating or Set Fine\nDefining Offence\n\n1 Cause or Permit Noise From Amplified Sound Schedule A’, Item $250\n\n2 Cause or Permit Noise From Amplified Sound | Schedule “A”, Item $250\nin Park 2\n\n3 Cause or Permit Noise From Rewving of Schedule “A”, Item $250\nEngine 3\n\n4 Cause or Permit Noise from Operation of Schedule “A”, Item $250\nVehicle Causing Tire Squeal 4\n\n5 Cause or Permit Noise From Auditory Schedule “A”, Item $250\nSignaling Device 5\n\n6 Cause or Permit Noise From Selling or Schedule “A”, Item $250\nAdvertising 6\nCause or Permit Noise From Combustion Schedule “A”, Item $250\n\n7 :\nEngine— No Muffler 7\n\n8 Cause or Permit Noise From Construction Schedule “B”, Item $250\nEquipment When Prohibited 1\n\n9 Cause or Permit Noise From Toy, Model, or Schedule “B”, Item $250\nReplica When Prohibited 2\n\n10 Cause or Permit Noise From Motorized Schedule “B”, Item $250\nConveyance When Prohibited 3\n\n11 Cause or Permit Noise From Powered/Non- Schedule “B”, Item $250\nPowered Tool When Prohibited 4\nCause or Permit Noise From Bulk Lift or Schedule “B”, Item $250\n\n12 | Refuse Compacting Equipment When 5\nProhibited\n\n13 Cause or Permit Noise From Pest Control Schedule “B”, Item $250\nDevice When Prohibited 6\n\n14 Cause or Permit Noise From Loading or Schedule “B”, Item $250\nUnloading Material When Prohibited 7\n\n15 Cause or Permit Noise From Yelling or Schedule “B”, Item $250\nShouting When Prohibited 8\n\n16 | Obstruct an Officer Section 6.3 $500\n\nNOTE: The penalty provision for the offences indicated above is Section 6.4 of By-law\n2025-122, a certified copy of which has been filed.\n\nThe fine amounts listede above have been approved by the Regional Senior Justice.\n\nDated: August 15, 2025\n\nElectronic Signature:\nW. Vincent Clifford\n\nRegional Senior Justice\nOntario Court of Justice - East Region\n\n"
    },
    {
      "page_number": 11,
      "text": "THE HONOURABLE\nW. VINCENT CLIFFORD\nREGIONAL SENIOR JUSTICE\nONTARIO COURT OF JUSTICE\nEAST REGION\n\nCOURTHOUSE\n161 ELGIN STREET, 6™ FLOOR\nOTTAWA, ONTARIO\n\nAugust 15, 2025\n\nThe Corporation of the City of Belleville\nCity Hall - 169 Front Street\nBelleville ON K8N 2Y8\n\nAttention: Aggie Hill, Manager, By-law Enforcement\n\nDear Aggie Hill:\n\nRe: Set Fines — Provincial Offences Act — Part!\nBy-Law No. 2025-122: Noise\n\nL'HONORABLE\nW. VINCENT CLIFFORD\nJUGE PRINCIPAL REGIONAL\nCOUR DE JUSTICE DE L'ONTARIO\nREGION DE L’EST\n\nPALAIS DE JUSTICE\n161, RUE ELGIN, 6° ETAGE\nOTTAWA (ONTARIO)\nK2P 2L1\n\nTELEPHONE/TELEPHONE (613) 239-1520\n\nalhill@belleville.ca\n\nEnclosed herewith is the original Order (Part |) dated August 15, 2025, and original schedule of\nset fines for By-Law No. 2025-122, the By-Law indicated in the schedule.\n\nThe setting of the fines does not constitute my approval of the short form of wording used to\n\ndescribe the offences.\n\nPlease ensure that a copy of the said documents is forwarded to the Provincial Offences Office,\n\nwhich has jurisdiction for the City of Belleville.\n\nYours truly,\n\nW. Vincent Clifford\nRegional Senior Justice\nOntario Court of Justice\nEast Region\n\n/nl\nEnclosures\nc.c.:_ Benjamin Hedley\n\nLaw Clerk, Crown Law Office - Criminal\nMinistry of the Attorney General, Ontario Public Service\n"
    }
  ]
}