{
  "file_name": "BL 2025-143 Fire Safety Plan _ Lock Boxes - Repeal 2022-90.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "The Corporation of the City of Belleville\nBy-law Number 2025-143\n\nA By-law with respect to the Installation and Maintenance of a Fire Safety Plan\nand Lock Boxes and to Repeal By-law Number 2022-90\n\n(Fire Safety Plan & Lock Boxes By-law)\n\nWhereas Section 10(2) of the Municipal Act, 2001, S.O. 2001, c. 25, as amended,\nprovides that a municipality has the authority to enact by-laws for the safety and well-\nbeing of persons and the protection of persons and property;\n\nAnd Whereas Section 5(3) of the Municipal Act, 2001, S.O. 2001, c. 25, as amended,\nprovides that a municipal power shall be exercised by by-law;\n\nAnd Whereas Section 9 of the Municipal Act, 2001, S.O. 2001, c. 25, as amended,\nprovides that a municipality has the capacity, rights, powers and privileges of a natural\nperson for the purpose of exercising its authority under this or any other Act;\n\nAnd Whereas Section 8 of the Municipal Act, 2001, S.O. 2001, c. 25, as amended,\nprovides that municipal powers shall be interpreted broadly so as to confer broad\nauthority on the municipality to enable it to govern its affairs as they consider\nappropriate, and to enhance its ability to respond to municipal issues;\n\nAnd Whereas Section 7.1(1)(a) of the Fire Protection and Prevention Act, 1997, S.O.\n1997, c.4, as amended, permits the council of a municipality to pass by-laws regulating\nfire prevention, including the prevention of the spreading of fires;\n\nAnd Whereas the Fire Code established under Part IV of the Fire Protection and\nPrevention Act, 1997, S.O. 1997, c.4, as amended, sets out requirements for the\npreparation, approval and implementation of fire safety plans;\n\nAnd Whereas under the Fire Code, fire safety plans are to be kept in a location\napproved by the Chief Fire Official;\n\nAnd Whereas this by-law shall not fetter the discretion of the Chief Fire Official with\nrespect to approved locations of fire safety plans;\n\nAnd Whereas Section 7.1(4) of the Fire Protection and Prevention Act, 1997, S.O.\n1997, c.4, as amended, provides that a municipality may appoint an officer to enter\nupon land and into structures at any reasonable time to inspect the land and structures\nto determine whether by-laws enacted in accordance with this section 7.1 are being\ncomplied with;\n\nAnd Whereas Section 6(3) of the Fire Protection and Prevention Act, 1997, S.O. 1997,\nc.4, as amended, provides that a Fire Chief is the person who is ultimately responsible\nto the council of a municipality that appointed them for the delivery of fire protection\nservices;\n\nPage 1 of 6\n"
    },
    {
      "page_number": 2,
      "text": "And Whereas Part XIV — Enforcement of the Municipal Act, 2001, S.O. 2001, c. 25, as\namended, applies with necessary modifications to by-laws passed by the council of a\nmunicipality under any other general or special Act except as otherwise provided in that\nAct;\n\nAnd Whereas Section 425 of the Municipal Act, 2001, S.O. 2001, c. 25, as amended,\nprovides that a municipality may pass by-laws providing that a person who contravenes\na by-law pass under the Act is guilty of an office;\n\nAnd Whereas it is the opinion of the Council for The Corporation of the City of Belleville\nthat the health and safety of persons and property within Belleville would be enhanced\nby the mandatory installation of fire safety plan boxes;\n\nNow Therefore the Council of The Corporation of the City of Belleville hereby enacts as\nfollows:\n\nInterpretation\n\n1. Definitions:\n\n1.1 Unless the context otherwise requires, the following terms have the meanings\nindicated:\n\n\"Chief Fire Official\" has the same meaning as in the Fire Code;\n\n“existing lock box\" means a cabinet or box used for the storage of keys to the front\nentrance, service rooms, and any other rooms that were in place prior to the effective\ndate of this by-law;\n\n\"Fire Chief’ means the Fire Chief appointed by the Council of the City under the Fire\nProtection and Prevention Act, 1997, S.O. 1997, c.4, as amended, for the Fire\nDepartment of the City and includes, in the absence of the Fire Chief, a Deputy Fire\nChief,\n\n\"Fire Department\" means the Fire Department of the City and includes its officers and\nmembers;\n\n\"Fire Protection Services\" has the same meaning as in the Fire Protection and\nPrevention Act, 1997, S.O. 1997, c.4, as amended;\n\n“fire safety plan box\" means a metal cabinet or box that is locked with a padlock for\nthe storage of the items identified in section 6 of this by-law;\n\n“fire safety plan\" means a fire safety plan as described in the Fire Code;\n“lock box\" means a metal storage box approved by Belleville Fire & Emergency\nServices which is locked with a specific key, for the storage of keys to front entrance,\n\nservice rooms, fire alarm control and annunciator panel(s), firefighter elevator, fire\nsafety plan box and any other rooms that are special interest to emergency responders.\n\nPage 2 of 6\n"
    },
    {
      "page_number": 3,
      "text": "“owner\" shall have the same meaning as set out in the regulations to the Fire\nProtection and Prevention Act, 1997, S.O. 1997, c.4, as amended;\n\n\"padlock\" means a padlock that is non-reinforced and is capable of being cut by a bolt\ncutter; and\n\n\"service room\" means a room in a building used to contain equipment associated with\nbuilding services.\n\n1.2 In this by-law, a reference to an Act, regulation or by-law is to that Act, regulation or\nby-law as it is amended or re-enacted from time to time.\n\nAdministration of By-Law\n\n2. Administration:\n\n2.1 The Fire Chief shall be responsible for the administration of this by-law.\n\n2.2 The Fire Chief, the Chief Fire Official and any person employed by the City as a fire\nprevention officer in the Fire Department are appointed as officers for the purpose of\n\nentering upon the premises to which this by-law applies at any reasonable time to\ninspect the premises to determine whether this by-law is being complied with.\n\n2.3 Any person who has been appointed by the City for the purpose of determining\nwhether any other by-law of the City or other law regulating fire prevention or fire safety\n\nhas been complied with and whose appointment has not been suspended or revoked is\nalso appointed as an officer for the purpose of exercising the power given under section\n\nRequirements and Prohibitions\n3. Fire Safety Plan Box and Lock Box:\n\n3.1 Every person who is required under the Fire Code to prepare and implement a fire\nsafety plan approved by the Chief Fire Official shall install and maintain on their\npremises one of the following:\n\na) a fire safety plan box and a lock box; or\nb) a fire safety plan box and an existing lock box.\n\n3.2 Every person to whom section 3.1 applies shall ensure that the fire safety plan box,\nlock box, and existing lock box comply with the requirements set out in Sections 4, 5, 6,\nand 8 of this by-law.\n\n4. There must be a minimum of one fire safety plan box and one lock box per building\nthat is required to implement a fire safety plan.\n\nPage 3 of 6\n"
    },
    {
      "page_number": 4,
      "text": "5. Location and Fire Safety Plan Box specifications:\n5.1 Every fire safety plan box required under this by-law shall be:\n\na) surface mounted within three metres of the principal entrance of the premises at a\nheight between 1.5 metres to 1.8 metres above the floor, measured to the top of the fire\nsafety plan box;\n\nb) securely mounted inside the building to an interior wall of the premises; and\n\nc) of sufficient size to hold all the contents prescribed for a fire safety box by this bylaw,\nincluding an unfolded fire safety plan.\n\nd) Fire Safety Plan box shall be constructed with 18 gauge steel, powder coated white\nin colour with white or black lettering reading “FIRE SAFETY PLAN’. Box shall be\nlocked only by means of a padlock. Size should be no less than 13”x13”x4” to allow for\nan 8 %\" x 11” document.\n\n5.2 Every lock box required under this by-law shall be:\n\na) surface mounted within three metres of the main entrance of the premises at a height\nbetween 1.5 metres to 1.8 metres above the floor, measured to the top of the box;\n\nb) securely mounted to the exterior of the premises; and\nc) of sufficient size to hold the keys to service rooms required by Section 7.\n\n5.3 Despite sections 5.1(a) and 5.2(a), the fire safety plan box and/or the lock box may\nbe located in a place on the premises other than within three metres of the main\nentrance of the premises, but only with the prior written approval of the Chief Fire\nOfficial.\n\n5.4 Where prior written approval of the Chief Fire Official as referred to in section 5.3 is\nprovided, the fire safety plan box and the lock box shall be located in the place so\napproved.\n\n5.5 An existing lock box is not required to meet the requirements of sections 5.2(a) and\n\n(b).\n\n6. Contents:\n\n6.1 Every fire safety plan box required under this by-law shall at all times contain:\na) a true copy of the approved fire safety plan for the premises;\n\nb) an unlocked replacement padlock capable of locking the fire safety plan box.\n\n6.2 Every lock box or existing lock box required under this by-law shall at all times\ncontain the keys required by Section 7.\n\nPage 4 of 6\n"
    },
    {
      "page_number": 5,
      "text": "7. Lock Box Key Access:\n\n7.1 Every person who is the owner of premises shall supply to the Fire Department, a\nfull working set of keys to open the front entrance, service rooms, fire alarm control and\nannunciator panel(s), firefighter elevator, fire safety plan box and any other rooms that\nare special interest to emergency responders. The Fire Department shall place these\nkeys in the lock box or existing lock box required under this by-law. Keys to dwelling\nunits are not required under this by-law, but the owner may choose to have them added\nupon request.\n\n7.2 The keys referred to in section 7.1 must at all times be equipped with metal or\nplastic tags that contain complete, up-to-date information clearly identifying what lock\nthe keys open.\n\n7.3 No person, other than an officer or member of the Fire Department acting in the\ncourse of their duties, or the owner of the premises or their authorized agent, for the\npurposes of updating identification information or replacing defective keys, shall remove\nthe keys from the lock box or existing lock box, as the case may be, or remove or\nchange the identification tags for the keys.\n\n7.4 When updating identification information or replacing defective keys, the owner of\nthe premises or their authorized agent shall act promptly so as to ensure that at all\n\ntimes the Fire Department has immediately available to it, a full working set of keys with\ncomplete, up-to-date identification information.\n\n8. Locked Box:\n\n8.1 The fire safety plan box, lock box and existing lock box shall be locked at all times:\na) except where the Fire Department requires access; and/or\n\nb) except for the purposes of having their contents updated.\n\nEnforcement\n\n9. Fire Department Access:\n\n9.1 The Fire Department shall, at all times, be permitted to have access, and shall have\naccess, to any fire safety plan box, lock box and existing lock box required under this\nby-law, including the contents prescribed in this by-law and for these purposes may use\nany means available to obtain access to or open the fire safety plan box, lock box or\nexisting lock box.\n\n10. Interference with Installation:\n\n10.1 No owner of any premises to which this by-law applies shall refuse to allow, or\n\nshall prevent or interfere with, the installation and maintenance of a fire safety plan box,\nlock box or existing lock box required by this by-law.\n\nPage 5 of 6\n"
    },
    {
      "page_number": 6,
      "text": "11. Interference with Enforcement:\n\n11.1 No person shall hinder, obstruct or interfere with a person duly appointed to\nenforce this bylaw in the exercise of their powers and duties.\n\nOffence and Penalty\n\n12. Offence and Penalty:\n\n12.1 Any person who contravenes any provision of this by-law is guilty of an offence\nand upon conviction is liable to a fine of up to Twenty Five Thousand Dollars\n($25,000.00).\n\nGeneral\n\n13. Severability:\n\n13.1 If any section or sections of this by-law or parts thereof are found in any court of\nlaw to be illegal or beyond the power of Council to enact, such section or sections or\nparts thereof shall be deemed to be severable and all other sections or parts of this by-\n\nlaw shall be deemed to be separate and independent there from and to be enacted as\nsuch.\n\n14. Short Title:\n\n14 .1 This by-law may be referred to as \"Fire Safety Plan & Lock Boxes By-law\".\n\n15. General:\n\n15.1 Nothing in this by-law relieves a person from complying with any provision of any\nfederal or provincial law or regulation, other by-law, or any requirement of any lawful\npermit order or license.\n\n15.2 By-law Number 2022-90 is hereby repealed.\n\n15.3 This by-law shall come into force and effect on the final passing thereof.\n\nVa\n\n. Ellis, Mayor\n\nMEE\n\nJ. Douglas Irwin, Clerk\n\nBy-law read and passed this 25\" day of August 2025.\n\nPage 6 of 6\n"
    }
  ]
}