{
  "file_name": "BL 2020-09 Purchasing Bylaw.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\nBY-LAW NUMBER 2020-09\n\nBEING A BY-LAW TO DEFINE THE PURCHASING POLICIES FOR THE PROCUREMENT\nOF GOODS AND/OR SERVICES FOR THE CITY OF BELLEVILLE\n\nWHEREAS this By-law established the authority and sets out the methods by which the City of\nBelleville will procure Goods and/or Services subject to certain exceptions set out herein;\n\nNOW THEREFORE THE COUNCIL OF THE CORPORATION OF THE CITY OF BELLEVILLE\nENACTS AS FOLLOWS:\n\nIn this By-law and in Appendix A — By-law Exemptions and Appendix B — Bid Irregularities and\nAppendix C — Levels of Approval authority, attached to this By-law:\n\n1. DEFINITIONS:\n\n“Award” means the selection of a Bidder and their Goods and/or Services as accepted by the\nCity;\n\n“Agreement to Bond” means a letter or other form issued by a bonding agency licensed to\noperate by the Government of Canada or the Province of Ontario advising that, if the Bidder is\nsuccessful, the bonding agency will issue the required bonds;\n\n“Addenda or Addendum” means such further additions, clarifications, deletions,\nmodifications or other changes to any Bid Document;\n\n“Bid” means the Bidder’s offer to sell to the City;\n\n“Bidder” or “Proponent” means a person, Supplier, Vendor, contractor, developer or\nprofessional, who submits a Bid to the City;\n\n“Bid Deposit” means currency, certified cheque, bank draft, bond surety issued by a surety\ncompany, Irrevocable Letter of Credit, or other form of negotiable instrument submitted by a\nBidder as evidence of their commitment to enter into an Agreement to do the work outlined in\nthe Bid Solicitation;\n\n“Bid Document” means a Request for Tender, Request for Quotation, Request for Proposal or\nother document that states the City’s desire to buy or to consider buying and\nBidders/Proponents offer to sell to the City, the Goods and/or Services defined in the\nSpecification and/or Scope of Work;\n\n“Bid Irregularity” means a deviation between the requirements of a Bid Document request and\nthe information provided in the Bid response;\n\n“Bidding System” means an electronic bidding system for the secure transmission of bidding\ndocuments, Bid data and related documents in connection with the procurement of Goods\nand/or Services;\n\n“Blanket Purchase Order” is a term Contract or Agreement between the City and a Supplier\nand is used to address estimated recurring Purchases of Goods and/or Services required over a\nspecific period;\n\n1\n"
    },
    {
      "page_number": 2,
      "text": "“Certificate of Clearance” means a certificate issued by an authorized official of the WSIB in\ncompliance with the Workplace Safety and Insurance Act, 1997, specifically Part XII, section\n141, 141.1 and 141.2, as applicable and as amended;\n\n“Certificate of Insurance” means official original documents issued by an insurance company\nacceptable to the City and licensed to operate by the Government of Canada or the Province of\nOntario certifying that the Bidder is insured in accordance with the City’s insurance\nrequirements as noted in the Bid Document;\n\n\"City\" means The Corporation of the City of Belleville;\n“Committee” means a committee duly appointed by Council;\n\n“Contract” or “Agreement” means a binding agreement between two or more parties that\ncreates an obligation to provide a particular Goods and/or Services;\n\n\"Council\" means the Council of The Corporation of the City;\n\n\"Designate\" means a person provided with the written authority to act on another person's\nbehalf, notice of which shall be filed with the City Treasurer;\n\n“Department” means any City Department;\n\"Department Head” means the head of any City Department;\n\n“Electronic Bidding (Facsimile, Email or Internet)” means a method of issuing Solicitations\nand/or receiving Bids where the process of issuing and/or receiving Bids by facsimile, email or\ninternet is considered appropriate;\n\n“EOI” means Expression of Interest, a process whereby the City uses a focused market\nresearch tool to determine Bidder interest in a proposed procurement;\n\n“Evaluation Committee” means a committee of staff, which may include the Purchasing\nSupervisor, and/or outside consultant(s), established by the Department Head, to evaluate\nSubmission(s) according to the evaluation criteria in the Bid Document;\n\n\"Goods and/or Services\" includes supplies, equipment, furniture, fixtures, construction,\nmaintenance and service Contracts and professional and consulting services but does not\ninclude Real Property;\n\n“Irrevocable Letter of Credit” means an irrevocable letter on the financial institution’s standard\nform containing a request that the party, to whom it is addressed, pay the bearer or a person\nnamed therein money as a result of failure to perform or fulfill all the covenants, undertakings,\nterms, conditions and agreements contained in the Contract;\n\n“Improvements” has the meaning given to it in the Construction Act.\n\n“Labour and Material Bond” means a bond issued by a surety company on the City standard\nForm of Bond to ensure that the contractor will fulfill its obligations to its employees,\nsubcontractors and Suppliers and thereby protects the City. Any changes to the standard Form\nshall require approval of the Purchasing Supervisor;\n\n“MFIPPA” means Municipal Freedom of Information and Protection of Privacy Act;\n\n2\n"
    },
    {
      "page_number": 3,
      "text": "“Official Documents” means the mandatory documents required by the City from the Vendor\nbefore execution of a Contract i.e. Certificate of Insurance, WSIB Certificate, Health & Safety\nDeclaration, Bonding, etc.;\n\n“Ontario Construction Act” means the legislation as enacted by the government of Ontario as\nthe Construction Act RSO 1990 c. C.30 and any amendments thereto.\n\n“Performance Bond” means a bond issued by a surety company on the City standard Form of\nBond executed in connection with a Contract and which secures the performance and fulfillment\nof the undertakings, covenants, terms, conditions and agreements contained in the Contract.\nThe City, at its option, may accept renewable bonds. Any changes to the standard Form shall\nrequire the approval of the Purchasing Supervisor;\n\n“PO Amendment” means any change to the original approved scope and/or value of a\nContract and/or Purchase where the total cost of goods, services, or construction exceeds\n$50,000;\n\n“PO Amendment Form” means an approved document authorizing a PO Amendment where\nthe total cost of Goods and/or Services exceeds $50,000;\n\n\"Proposal\" or “Submission” means an offer submitted in response to an invitation to a\nSupplier to provide Goods and/or Services, on certain terms and conditions;\n\n“Proponent” means a party submitting a Proposal;\n\"Purchase\" means the acquisition of Goods and/or Services;\n\n\"Purchase Order” or “PO” means a document issued to a Vendor formalizing the terms and\nconditions to Purchase Goods and/or Services;\n\n“Purchasing Card (P-Card)” means a type of credit card issued at a corporate level by an\nauthorized lending institution. The cards are issued in an individual's name, but the charges\nincurred are the liability of the City;\n\n\"Purchasing Supervisor\" means the Purchasing Supervisor of the City ;\n\n“Purchasing Services” means the Purchasing Services Department within the City of Belleville\nFinance Department;\n\n\"Quotation\" means an offer from a Supplier to provide to or Purchase from the City Goods\nand/or Services;\n\n\"Real Property\" includes lands, buildings, tenements and any interest, estate, right or\neasement in lands;\n\n\"Request for Proposal or RFP\" is a Bid solicitation method used when it is expected that\nnegotiations with one or more Bidders may be required with respect to any aspect of the\nrequirements, or that other factors will be considered in the selection of the Contract in addition\nto price;\n"
    },
    {
      "page_number": 4,
      "text": "“Request for Quotations or RFQ” means a form of Bid solicitation whereby the City publishes\nthe specifications, terms, conditions and details concerning the proposed Agreement, to submit\nsealed Bids in response to detailed specifications;\n\n“Request for Tender or RFT” is a process whereby the City publishes the specifications,\nterms, conditions and details concerning the proposed Agreement;\n\n“Request for Information or “RFI” means a non-binding solicitation of input from interested\nparties with respect to a possible future procurement process. This is a common procurement\npractice used to obtain product/service details, comments, feedback or reactions from potential\nSuppliers/contractors prior to the issuing of a call for Bid. A firm price or cost information is not\nrequired. Feedback may include best practices, industry standards, technology issues, etc;\n\n“Request for Prequalification or “RFPQ” means a request for the detailed submission of the\nexperience, financial strength, education, background and personnel from individuals, firms or\ncorporations who may, from time to time, qualify to supply Goods and/or Services to the City,\nbut which does not create any contractual obligation between the respondent submitting the\npre-qualification submission and the City, but which may be a pre-condition to submitting a\nfurther Bid or Proposal to the City;\n\n\"Submission\" means a Bid document received from a Supplier of Goods and/or Services in\nresponse to an advertisement requesting Bids;\n\n“Supplier” means a person or company from whom the City may Purchase or lease Goods\nand/or Services;\n\n“Single Sourcing” means the procurement of goods and/or services from a particular Vendor\nrather than through the solicitation of Bids from multiple Vendors who can also provide the\nsame/similar Goods and/or Services;\n\n“Sole Sourcing” means the procurement of goods and/or services that are unique to a\nparticular Vendor and cannot be obtained from other sources;\n\n“Tender” means an offer from a Bidder to provide Goods and/or Services in response to an\nRFT, the acceptance of which will result in the formation of a binding Contract between the City\nand the Bidder submitting the Tender;\n\n“Trade Agreement” means an interprovincial or international trade agreement to which Ontario\nis a party and which contains obligations related to the procurement of goods Contracts and\nservice and construction Contracts.\n\n\"Total Cost\" or “Total Dollar Value” means the sum of all costs excluding any non-refundable\ntaxes.\n\n\"Treasurer\" means the City Treasurer;\n\n“User Department” means the Department within the City that requires the Goods and/or\nServices and for which the Department Head or their Designate is the contact for the purposes\nof the procurement process;\n\n“Vendor” means a party that supplies Goods and/or Services to the City.\n\n“WSIB” means the Ontario Workplace Safety and Insurance Board.\n\n4\n"
    },
    {
      "page_number": 5,
      "text": "2. OBJECTIVES:\n\nTo Purchase and supply the proper equipment, materials, supplies and services when needed,\nwith the best quality, the best quantity, at the best price, from the best source and at the best\ntime using a competitive process that is open, transparent and fair to all.\n\nTo improve service and support to all Departments.\n\nTo maximize value of dollars spent.\n\nTo promote sound inventory management.\n\nTo reduce operating cost by the effective use of available time.\n\nTo maintain effective purchasing controls.\n\nTo strengthen public relations through proper communications with contractors and Suppliers.\nTo comply with legal and legislative requirements including Trade Agreements.\n\n3. AUTHORIZATIONS:\n\nCouncil has ultimate authority to approve all expenditures. Council provides the authority to staff\nfor the initiation and completion of procurement processes as per Appendix “C” — Levels of\nApproval Authority attached to and forming part of this policy.\n\n4. CODE OF ETHICS:\nGoal: To ensure ethical, professional and accountable procurement.\n\nMembers of Council or of a Committee, appointed officers and employees of the City, directly or\nindirectly involved at any stage of any Purchase of Goods and/or Services on behalf of the City\nshall, at minimum, adhere to the following principles:\n\na) Open and honest dealings with everyone who is involved in the procurement\nprocess. Procurement activities should be open and accountable to the greatest\nextent possible.\n\nThis includes all businesses with which this City Contracts or from which it Purchases\ngoods, services, and construction, as well as all members of City staff and of the public\nwho utilize the services of purchasing services.\n\nb) Fair and impartial Award recommendations for all Contracts and Tenders.\nContracting procurement activities must be fair, transparent and conducted with a\nview to obtaining the best value for public money.\n\nThis means that the City does not extend preferential treatment to any Prospective\nVendor, including local companies.\n\nc) A high standard of personal integrity on the part of all those designated as\nprocurement representatives for this Corporation.\n\nEmployees involved with procurement activities must act, and be seen to act, with\nintegrity and professionalism. Honesty, care and due diligence must be integral to all\nprocurement activities within and between the organization, Suppliers and other\nstakeholders. Respect must be demonstrated for each other and for the environment.\nConfidential information must be safeguarded. Participants must not engage in any\nactivity that may create, or appear to create, a conflict of interest, such as accepting gifts\nor favours, providing preferential treatment, or publicly endorsing Suppliers or products.\n"
    },
    {
      "page_number": 6,
      "text": "Members of Council or of a Committee, appointed officers and employees of the City\nare expressly prohibited from accepting, directly or indirectly, from any person,\ncompany or corporation to which any Purchase Order or Contract is, or might be\nawarded, any rebate, award points, gift, money or anything of value whatsoever, except\nwhere given for the sole use and benefit of the City.\n\nLobbying by Bidders to Council members will be prohibited. This provides a fair process\nto all Bidders during the review process and protects staff and politicians from\nallegations of attempting to influence decisions when making Awards. If a staff member\nor Council member is aware of lobbying by a Vendor, they should notify their immediate\nsupervisor, or in the case of Council, the CAO, as well as advising the Purchasing\nSupervisor.\n\n5. RESPONSIBILITIES OF PURCHASING SUPERVISOR/TREASURER:\n\nThe Purchasing Supervisor, under the direction of the City Treasurer, is responsible for the\nmanagement, organization and administration of the purchasing function, including ensuring\ncompliance with the purchasing policies and procedures. The Purchasing Supervisor shall have\nthe authority to develop and maintain procedures to implement this policy. The Purchasing\nSupervisor is responsible for issuing requests for quotations, requests for proposals and Tenders\nfor all Goods and/or Services, etc., and for arranging the disposal of surplus goods.\n\n6. DELEGATION OF RESPONSIBILITIES:\n\nThe Chief Administrative Officer of the City and/or the City Treasurer may designate a person to\nact in their place in the event that they are unavailable to perform their duties under this\nPurchasing Policy.\n\n7. EXCEPTIONS:\n\nIn exceptional circumstances, this Purchasing Policy may be overridden by Council in the event\nthat Council determines it is appropriate and in the best interest of the City to do so.\n\n8. EXEMPTIONS:\n\n1.\n\nCompetitive Bid solicitation is not required for items set out in Appendix \"A\" - Purchasing\nPolicies Exemptions. However, Items 17. Insurance and 18. WSIB will apply to these\nexemptions, if applicable.\n\nAll service, professional, and consulting services that are not directly related to\nImprovements to Real Property owned by the City are exempt from the provisions of the\nConstruction Act.\n\n9. BLANKET PURCHASE ORDERS:\n\n1.\n\nA Blanket Purchase Order is a term Contract or Agreement between the City and a\nSupplier and must be initiated in compliance with the Purchasing Policy and awarded as\nper Appendix “C” — Levels of Approval Authority.\n\nStaff are required to determine if a Blanket Purchase Order is available for any supply or\nservice they require prior to making the Purchase.\n"
    },
    {
      "page_number": 7,
      "text": "3. A Blanket Purchase Order is issued to a Supplier to address recurring Purchases of\nGoods and/or Services for a specific period where the exact quantity or required dates\nmay not be precisely known.\n\n4. The value of the Blanket Purchase Order will be as accurate an estimate as practical\nand based, to the extent possible, on previous usage, adjusted where appropriate for\nany known factors.\n\n5. A Blanket Purchase Order may only be issued for a period which does not extend\nbeyond the calendar year. For multi-year Contracts a new PO shall be issued for each\ncalendar year of the term.\n\n6. More than one Supplier may be selected where it is in the City’s best interest and the Bid\nsolicitation process allows for more than one Supplier.\n\n10. PURCHASING PROCEDURES:\n\na. The Purchasing Supervisor shall have the authority to develop and maintain procedures\nto implement to this policy.\n\nb. The purchasing procedures shall be approved by the Treasurer and used as direction to\nstaff when purchasing goods, services or construction in compliance with this policy.\n\n11. LOW VALUE PURCHASE (LVP):\n\nWhere the Total Cost does not exceed $5,000 for the Purchase of Goods and/or Services\nand construction, the Purchase must be approved by the Department Head using one of the\nfollowing methods and in accordance with the policies and procedures associated with each\nand in accordance with the Purchasing By-law, Appendix “C” — Levels of Approval Authority\nand Purchasing Procedures. Note: If applicable, City staff must obtain and retain\nevidence of WSIB & Insurance prior to allowing work to commence on City property.\n\na) Petty Cash\n\nThe maximum petty cash dollar reimbursement for Purchases of Goods and/or Services\nand construction is up to the amount of $50 and in compliance with the City’s Petty Cash\nPolicy & Procedures.\n\nb) Purchase Orders\n\nWhere the Total Cost is greater than $50 but does not exceed $5,000 for the Purchase of\nGoods and/or Services and construction, the Department Head may authorize such Purchase\nby the issuance of a Purchase Order.\n\nc) Corporate Purchasing Cards\n\nWhere the Total Cost does not exceed $5,000 for the Purchase of Goods and/or Services and\nconstruction, the Purchase may also be completed using a Purchasing Card in compliance\nwith the Purchasing Card Procedures. All Purchasing Cards are issued through and with the\nconcurrence of the Purchasing Supervisor, Finance Department and approved by the\nTreasurer and the Cardholder’s Department Head. A Purchasing Card may be revoked at any\n\n7\n"
    },
    {
      "page_number": 8,
      "text": "time, for any reason, by the Treasurer, Purchasing Cardholder’s Department Head or the\nPurchasing Supervisor.\n\n12. REQUEST FOR QUOTATION (INFORMAL):\n\na) Request for Quotation (Informal) procedures will be used for Purchases greater than\n$5,000, but equal to or less than $20,000. The Department Head may authorize such\npurchase, by the issuance of a Purchase Order, provided that three written (includes\nfacsimile or email) Quotations are solicited and retained on file and to be provided to\nPurchasing Services if requested. Telephone solicitations may be used if required due to\ntime constraints or other contingencies. If three written quotes are not obtained, a written\nexplanation shall accompany the Purchase Order as to why three Quotations were not\nobtained. It is intended that provided all of the other requirements of the City are met, price\nwill be the most important criteria in selecting the winning Quotation.\n\nb) Execution and custody of documents: Since the informal Bid process does not go\nthrough Purchasing Services, the Department Head is responsible for obtaining and\nmaintaining the following documents, including any renewals (if applicable):\n\ne Acopy of the required current Certificate of Insurance from the Vendor;\ne Acopy of the Vendors current WSIB Certificate of Clearance;\ne Acopy of the City’s Health & Safety Declaration Form signed by the Vendor;\n\nThe Department will issue the PO.\nPeriodic reviews to ensure compliance may be performed by Purchasing Services and all\ncompliance issues will be reported to the City Treasurer.\n\n13. REQUESTS FOR QUOTATIONS (FORMAL):\n\nRequest for Quotation (formal) procedures may be used where Purchases are greater than\n$20,000 but equal to or less than $50,000 and shall be authorized as follows:\n\n(a) The Department Head shall prepare specifications.\n\n(b) Formal Quotations must be solicited through Purchasing Services. Telephone\nsolicitations may be used if required due to time constraints or other contingencies.\n\n(c) The Purchasing Supervisor shall receive Quotation Submissions until the deadline\nspecified in the Bid document.\n\n(d) The City may elect to receive Bids electronically and the procurement process will be\nstated in the Bid Document.\n\n(e) After closing, Quotations shall be opened by the Purchasing Supervisor or a Designate\non the following work day or as soon thereafter as possible.\n\n(f) |The Purchasing Supervisor prepares a summary of all Bids received.\n\n(g) The Department Head and/or the Purchasing Supervisor shall evaluate all Bids\nsubmitted and award to the lowest Quotation meeting the requirements of the City.\n\n(h) _ It is intended that provided all of the other requirements of the City are met, price will be\nthe most important criteria in selecting the winning Quotation. However, the City\nreserves the right to take into account other criteria, if appropriate.\n\n(i) | After receipt and approval of the Official Documents, Purchasing Services shall issue a\nPurchase Order to the successful Vendor stating directly on the PO, “the City’s Bid\nDocument, any Addenda and the successful Vendor’s Submission will be appended to\nthe Purchase Order issued for this work and shall form the Agreement’.\n\n14. PREQUALIFICATION (RFPQ):\n\nRequest for pre-qualification is a procurement process used to pre-qualify Vendors for\n8\n"
    },
    {
      "page_number": 9,
      "text": "subsequent participation in the competitive Bid process. Responses are evaluated against\nselection criteria, qualitative and technical, set out in the solicitation document, and a list of\nprequalified Bidders is generated. The information collected in this process may be used to\n“short List” potential Bidders where the timeframe is tight or in the best judgement of the\nDepartment Head or their Designate and the Purchasing Supervisor or their Designate deems\nit in the best interest of the City to do so.\n\nThe Department head or their Designate has designated authority to select a minimum of three\n(3) Vendors from this list for invitation in a competitive Bid process. When in the opinion of the\nDepartment Head or their Designate there are less than three (3) qualified Vendors, a report\nwill be written detailing the circumstances of that decision and less than three (3) Vendors may\nbe contacted with the approval of Chief Administrative Officer.\n\nVendors not participating in the pre-qualification process will be ineligible to compete for\nContracts to supply goods or services where a prequalification has been performed.\n\n15. REQUEST FOR TENDER (RFT):\n\nRequest for Tender procedures shall be used where Purchases are greater than $50,000 and\nshall be authorized as follows:\n\n(a) Where the process is based on precisely defined requirements for which a clear or\nsingle solution is assumed to exist, then the Department Head shall prepare the\nspecifications and requirements for Tenders and forward same to the Purchasing\nSupervisor for review and approval.\n\n(b) The Purchasing Supervisor advertises and makes available a Rrequest for Tender on\nthe City’s Bidding System Website. Additional means of advertisement may be\nemployed from time to time as deemed appropriate by the Purchasing Supervisor.\n\n(c) The Purchasing Supervisor shall receive the Bids until the deadline specified in the Bid\nDocument.\n\n(d) The City may elect to receive Bids electronically and the procurement process will be\nstated in the Bid Document.\n\n(e) The Department Head of the relevant Department or their Designate shall evaluate all\nBids submitted and prepare a report with recommendations for Council's consideration.\nPurchasing Services prepares the Preliminary Opening Summary, Contract/Agreement\nand/or Purchase Order and retains the Official Documentation.\n\n16. REQUEST FOR PROPOSAL (RFP):\nRequest for Proposal procedures shall be used when:\n\ne other factors will be considered in the selection of the Contract in addition to price;\n\ne where it is expected that negotiations with Bidders may be required with respect to any\naspect of the requirements for the provision of Goods and/or Services;\n\ne where a unique proposal or solution designed to meet broad outcomes to a complex\nproblem or need is required;\n\ne where there is no clear or single solution.\n\n(a) The Department Head shall prepare specifications and criteria as noted below and\nforward same to the Purchasing Supervisor for review and approval.\n9\n"
    },
    {
      "page_number": 10,
      "text": "(b) Requests for Proposals may be sent by the Purchasing Supervisor to specific Bidders (a\nminimum of three Bidders, where possible). The City may elect to receive Bids\nelectronically and the procurement process will be stated in the Bid Document.\n\n(c) The Purchasing Supervisor advertises and makes available a Request for Proposal on\nthe City’s Bidding System Website. Additional means of advertisement may be\nemployed from time to time as deemed appropriate by the Purchasing Supervisor.\n\n(d) The Purchasing Supervisor shall receive the Proposal Submissions until the date and\ntime specified in the proposal document. Proposal Submissions will be opened by the\nPurchasing Supervisor or a Designate on the following work day or as soon thereafter as\npossible.\n\nA Request for Proposal should include the following:\n\n° A work statement or performance specification;\n° Time frames in which the work is to be completed;\n. Specific criteria (including mandatory criteria and technical standards) and weighting\n\nfactors to be used in evaluating the Proposal;\n\nA Two (2)-envelope approach may be utilized with RFP’s. In the two (2) envelope approach,\nstep one (1) consists of a request for qualitative and/or technical information, without the pricing\nrequirement, and step two (2) consists of reviewing sealed proposal prices from only those\nProponents whose technical and/or qualitative requirements have been rated most acceptable,\ni.e., achieved a set threshold score on step one (1).\n\nWhere the Total Cost of the Proposal is greater than $50,000:\n\nThe Department Head of the relevant department or their Designate shall evaluate all Proposals\nsubmitted in accordance with the evaluation criteria in the Bid Document and prepare a report\nwith recommendations for Council's consideration. Purchasing Services prepares the Purchase\nOrder and retains the Official Documents, if applicable.\n\nWhere the Total Cost of the Proposal is greater than $20,000 but equal to or less than\n$50,000:\n\nA report will be prepared with a recommendation for Award and retained on file in the user\nDepartment and a copy be forwarded to Purchasing Services upon request. The report shall\ncontain detailed evaluation notes by each team member and scoring for each Proponent in\naccordance with the criteria in the original Bid Document.\n\nPrior to the issuance of the Purchase Order, the successful Vendor shall provide the Official\nDocuments (if applicable) to Purchasing Services for approval, retention and the managing any\nrenewals, if applicable.\n\nAfter receipt and approval of the Official Documents Purchasing Services shall issue a\nPurchase Order to the successful Vendor stating directly on the PO, “the City’s RFP document,\nany Addenda and the successful Vendor's Submission will be appended to the Purchase Order\nissued for this work and shall form the agreement”.\n\n10\n"
    },
    {
      "page_number": 11,
      "text": "Evaluation Committee:\n\nIn some instances, an Evaluation Committee will be established by the Department Head to\nreview the Proposals.\n\nDebriefings:\n\nDebriefing request(s) shall be forward to both the Department Head and Purchasing Services\nfor a response in writing by Purchasing Services and in accordance with Section 25 - Dispute\nResolution and Debriefing.\n\n17. INSURANCE:\n\nEach time a Vendor is hired to do work for the City regardless of the value, evidence of\ninsurance coverage satisfactory to the City must be obtained from the Bidder’s insurance agent\nor broker by the Bidder and provided to the City before any work commences. Such insurance\nmust include the City as Additional Insured or Additional Named Insured depending on the\ncontract and indemnify the City from any and all claims, demands, losses, costs or damages\nresulting from the performance of a Supplier’s obligations under the Contract.\n\nThe appropriate insurance coverage and value shall be determined by Purchasing Services in\nconsultation with the User Department ensuring an adequate level of protection to the City.\n\nThe type and value of the insurance coverage will be relevant to the Goods and/or Services\nbeing purchased and be in accordance with the City’s Purchasing Procedures.\n\nAll Bid Documents must indicate the insurance requirements to be provided by the successful\nBidder.\n\nPrior to execution of a Contract and before any work commences, or in the case of a direct hire\nthrough the User Department and before commencement of work, the Vendor must supply a\ncertificate of insurance confirming the required coverages in a form satisfactory to the City and\na signed copy of the City’s Health & Safety Declaration Form.\n\nThe successful Vendor is required to keep the insurance coverage in full force throughout the\ncourse of the work (including the warranty period) or executed Contract and the insurance\npolicy must provide that the insurance policy will not lapse or change without the insurer\nproviding thirty days’ notice to the Purchasing Services, or if applicable, the User Department.\nThe Vendor must provide the City with an up to date Certificate of Insurance upon request.\n\n18. HEALTH & SAFETY/ WSIB:\nContractors providing Goods and/or Services to the City must comply with and be held\naccountable for meeting the requirements of the Occupational Health and Safety Act and the\nCity’s Health & Safety Policy.\nEach time a Contractor is hired to complete work for the City, regardless of the dollar value of\n\nthe work, the Contractor must supply the City with a valid WSIB Certificate of Clearance prior to\nany work commencing and throughout the term of the Contract.\n\n11\n"
    },
    {
      "page_number": 12,
      "text": "19. STANDARD DOCUMENTATION:\n\nAs a risk mitigation strategy, standard formats and language, with the exception of\nspecifications, have been developed and continue to be monitored and changed in the Bid\nDocument templates available from and controlled by Purchasing Services and based upon\nfeedback from User Departments, case law decisions, legal review, best practices, and any\nother criteria the City determines.\n\nIn the situations where the City determines that it is more appropriate for Bid Documents to be\nprepared by a third party, it is the responsibility of the User Department to ensure that the third\nparty receives a copy of this policy and the Purchasing Procedures and the City’s standard\nlanguage or templates and incorporates all necessary information in the Bid Documents.\n\n20. PURCHASE ORDER AMENDMENTS AND REVISIONS:\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\nNo amendment or revision to a Purchase Order shall be made unless the amendment is\nin the best interest of the City.\n\nNo amendments to the price and/or scope of a Purchase Order where the Total Cost of\nthe Purchase of Goods and/or Services exceeds $50,000 shall be agreed to without a\ncorresponding authorized PO Amendment Form as prescribed by Purchasing Services.\n\nAmendments to the price and/or scope of a Purchase Order are subject to the\nidentification and availability of sufficient funds in appropriate accounts within a Council\napproved budget including any authorized revisions.\n\nAmendments to the price and/or scope of a Purchase Order where the Total Cost of the\nPurchase of Goods and/or Services exceeds $50,000, including any previous\namendments, may be authorized by issuance and approval of a PO Amendment Form\nand within the approval levels designated below;\n\nWhere the total PO amendments\nDEPARTMENT HEAD & TREASURER | (including any previous\nAPPROVAL REQUIRED amendments) does not exceed\n10% of the original PO amount.\n\nWhere the total PO amendments\nDEPARTMENT HEAD, TREASURER | (including any previous\n& CAO APPROVAL REQUIRED amendments) exceed 10% of the\noriginal PO amount.\n\nWhere the total PO amendments\n(including any previous\nDEPARTMENT HEAD, TREASURER | amendments) exceed 20% of the\n& CAO WITH A REPORT TO} original PO amount a report shall\n\nFINANCE COMMITTEE be submitted by the Director of\nFinance quarterly justifying the\namendment.\n\n21. OTHER TYPES OF PROCESSES:\n\nAs a preliminary step to other competitive bidding processes, including Tenders, Quotations and\nrequests for proposals, the following may be utilized:\n\n12\n"
    },
    {
      "page_number": 13,
      "text": "(a)\n\n(b)\n\n(c)\n\n(d)\n\nA Request for EOI: This is a request to potential Vendors to determine Vendor interest in\nany proposed Purchase. It may also be issued together with a request for qualifications\nwhere the proposed Purchase is well defined and the types of qualifications are reasonably\nwell known.\n\nA Request for Information (RFI): This is to be used in determining what products and\nservices are available to scope out business or other requirements and/or estimate project\ncosts prior to commencement of a competitive Bid process.\n\nExtension of a Previous Purchase (using acompetitive Bid process):\n\nIn the event that the Purchase is a direct extension of a previous Purchase which was\npurchased using a competitive Bid process and the previous Supplier will be considered\nappropriate as a single or sole source of procurement due to the particular nature of the\nextension, then the Department Head, in consultation with the City Treasurer and the\nPurchasing Supervisor may declare a competitive process is not required and they may\nproceed under a single source project up to a maximum of the Total Cost of up to $50,000\nwithout Council approval and above the Total Cost of $50,000.00 with Council approval.\n\nCo-operative Purchasing/VOR arrangements: Where the City is purchasing, together\nwith other municipalities or other public authorities or governmental agencies.\n\n22. GUARANTEES OF CONTRACT EXECUTION AND PERFORMANCE:\n\n(a)\n\n(b)\n\nThe Department Head or their Designate and Purchasing Supervisor may require that a Bid\nbe accompanied by a Bid Deposit to guarantee entry into a Contract.\n\nIn addition to the requirement of “Official Documents”, the successful Bidder may be\n\nrequired to provide:\n\n(i) | a Performance Bond to guarantee the faithful performance of the Contract normally in\nthe amount of 50% or 100% of the Contract price,\n\n(ii) | a Labour and Material Bond to guarantee the payment for labour and materials to be\nsupplied in connection with the contract normally in the amount of 50% of the\nContract price;\n\n(iii) and/or an Irrevocable Letter of Credit.\n\n(iv) All construction projects as defined by the Construction Act, as amended, require\nmandatory Surety Bonds as prescribed in the reregulation.\n\n23. EXCLUDED BIDDERS/OTHER FACTORS:\n\n(a)\n\n(b)\n\nThe City may, in its sole and absolute discretion, reject any Bid if the Bidder or any\naffiliated or associated person, firm or corporation (as defined under the Business\nCorporations Act (Ontario), including any officer or Department Head or shareholder, is or\nhas been engaged either directly or indirectly in any legal action against the City, its elected\nor appointed officers or employees in relation to any other Contract or service or any matter\narising from the City exercising its powers, duties and functions.\n\nThe City is entitled to include in its evaluation criteria any past experience that the City has\nhad with the Bidder (including performance records) or any related or affiliated\norganizations have had with the Bidder, whether favourable or unfavourable, including\nspecifically any Contracts, Contract disputes, litigation, or other experience or dealings\nwhatsoever including the reputation that the Bidder may have with any such entities.\n\n13\n"
    },
    {
      "page_number": 14,
      "text": "24. DISCLOSURE OF INFORMATION:\n\nAny information supplied in any Bid or Proposal which has been specifically designated to be,\nor is intended to be, and the City is aware is intended to be treated as confidential, shall be\ntreated as confidential information subject, however, to the City's obligations to disclose such\ninformation, if required, in accordance with MFIPPA. At the opening of any Tenders, the only\ninformation which shall be disclosed is the identity of the Bidders and the price submitted, but\nno further information shall be disclosed unless the City elects to do so at its option. Pertaining\nto a Request for Proposal, after closing and before the official Award, the only information which\nshall be disclosed is a list of the identity of the Bidders in alphabetical order. After the Award,\nonly the price (and the report to Council, if applicable) of the awarded bBdder will be disclosed.\n\n25. DISPUTE RESOLUTION AND DEBRIEFING:\n\nWherein the spirit of this policy is to promote a sense of fairness and transparency, in the event\nof possible dissatisfaction or request for a Bid debriefing, the following process will be followed:\n\na) The City reserves the right to debrief (or to not debrief) both the successful and\nunsuccessful Bidders.\n\nb) The Bidders will be required to submit a request in writing by email to the Purchasing\nSupervisor no later than ten (10) calendar days following the date of the issuing of the\nAward notification. The notice must clearly state the Contract details and the nature of the\nperceived problem or a request for a debriefing. Any request that is not received within the\nten (10) calendar day time limit may not be acknowledged nor answered.\n\nc) The Purchasing Supervisor shall respond to same in writing by email, and attempt to\nprovide the information requested, subject, however, to the City's obligations to disclose\nsuch information, if required, in accordance with the MFIPPA. The City will not disclose\nSubmission information from the other Bidders, unless required to do so based on MFIPPA\nor legal advice.\n\nd) The intent of the debriefing information session is to aid the Bidder in presenting a better\nSubmission in subsequent procurement opportunities. Any debriefing information provided\nis not for the purpose of providing an opportunity to challenge the procurement process.\n\n26. GREEN POLICY:\n\nThe City will endeavor to preserve and green the City’s environment while maintaining\neconomic, social, cultural and community health. The City is dedicated to meeting the needs of\nthe community today while ensuring a desirable future for future generations.\n\n27. LOCAL PREFERENCES:\n\nThe Discriminatory Business Practices Act of Ontario prohibits discriminatory business practices\nbased on, but not limited to, the geographical location of the persons employed in or engaging\nin business. The City adheres to the provisions of the Discriminatory Business Practices Act\nand therefore does not award Contracts based solely on local preference, nor does it include a\nlocal preference as an evaluation criteria. Not only is it against the law, it is not good business\npractice, since it limits fair and open competition for all Vendors and is therefore a detriment to\nobtaining the best possible value for each tax dollar. There may be instances where location\nand distance is a legitimate factor, for example, the location of a service depot for warranty or\nrepair service and its proximity to the City is a factor for scoring or awarding a Contract. Where\n\n14\n"
    },
    {
      "page_number": 15,
      "text": "there is a legitimate reason to do so, this shall not constitute local preference.\n\n28. PROHIBITED ACTIONS:\n\na)\n\nb)\n\nc)\n\nd)\n\ne)\n\nDivisions of a Contract and/or Purchase Order — No employee of the City shall divide a\nPurchase, Contract or PO Amendment or change order to avoid the requirements of the\nTender, Proposal, Quotation or a Low Value Purchase as noted herein. Nor shall the\nPurchases be split in order to circumvent prescribed spending authority dollar limits as\noutlined in this policy.\n\nAsking a Supplier to alter the invoice date or shipping date from what would otherwise be\nshown to accommodate City accounting needs.\n\nCreating a Purchase Order after the goods, service or construction has been received.\n\nSubmitting an invoice to accounts payable without a Purchase Order number (excluding\nPurchasing Policy Exemptions - Appendix A).\n\nHiring a Supplier to do work for the City regardless of the value, without first obtaining a\nvalid Certificate of Insurance, a signed Health & Safety Declaration and WSIB Certificate\nof clearance\n\nPeriodic reviews to ensure compliance may be performed and all compliance issues will be\nreported to the City Treasurer.\n\n29. DISPOSAL OF SURPLUS GOODS:\n\nThe Purchasing Supervisor shall coordinate the disposal of all surplus goods. Items deemed\nsurplus to the City shall be disposed of by first offering them to other Departments, and if not\nrequired by any City Department, it shall be disposed of in the most suitable manner that will\ntake into consideration the type of material being disposed of and the cost-benefit to the City.\nWhere the goods to be disposed are deemed to be of significant value, such as the case with\nvehicles, they shall be disposed of by means of Public Auction.\n\n30. NON-COMPETITIVE PURCHASES (SOLE SOURCE, SINGLE SOURCE, EMERGENCY):\n\n30.1 - Sole Sourcing:\n\nThe procurement may be conducted using a Sole Sourcing process if the Goods and/or\nServices are available from only one Supplier by reason of:\n\na)\nb)\n\nc)\n\nStatutory or market-based monopoly;\n\nCompetition is precluded due to the application of any act or legislation or because of\nthe existence of patent rights, copyrights, license, technical secrets or controls of raw\nmaterial; or\n\nThe complete item, service, or system is unique to one Supplier and no alternative or\nsubstitute exists.\n\n30.2 - Single Sourcing:\n\nSingle source means that there is more than one source of supply in the open market, but only\none source is recommended due to predetermined and approved specifications.\n\n15\n"
    },
    {
      "page_number": 16,
      "text": "The procurement may be conducted using a Single Sourcing process if the Goods and/or\nServices are available from more than one source but there are valid and sufficient reasons for\nselecting one Supplier in particular, as follows:\n\na) An attempt to acquire the required Goods and/or Services by soliciting competitive Bids\nhas been made in good faith, but has failed to identify any, willing and compliant,\ncompetitive Suppliers;\n\nb\n\naz\n\nFor additional deliveries by the original Supplier of goods or services that were not\nincluded in the initial procurement if a change of Supplier for such additional goods or\nservices: (a) cannot be made for economic or technical reasons such as requirements\nof interchangeability or interoperability with existing equipment, software, services or\ninstallations procured under the initial procurement; and (b) would cause significant\ninconvenience or substantial duplication of costs for the procuring entity;\n\nc) for Purchases made under exceptionally advantageous conditions that only arise in the\nvery short term in the case of unusual disposals such as those arising from liquidation,\nauction, receivership or bankruptcy, but not for routine Purchases from regular\n\nSuppliers;\n\nd) It is advantageous to the City to acquire the Goods and/or Services from a Supplier\npursuant to the procurement process conducted by another public body;\n\ne) Where it is advantageous to the City to acquire supplies (new or used) that are offered\n\nfor sale by tender, auction or negotiation;\n\nf) Another organization is funding or substantially funding the acquisition and has\ndetermined the Supplier, and the terms and conditions of the commitment into which\nthe City will enter are acceptable to the City;\n\n=\n\nWhere due to abnormal market conditions, the Goods and/or Services required are in\nshort supply.\n\ng\n\n30.3 - Sole and Single Sourcing — Approval and Reporting\n\nAwards which qualify to be considered as a Single Source or Sole Sourcing process require\nthe following approval:\n\ne For Purchases where the Total Cost is equal to or less than $50,000 the Department\nHead in consultation with the City Treasurer and the Purchasing Supervisor may\ndeclare a competitive process is not required and a written report indicating this\ncompelling rationale that warrants a non-competitive selection will be attached to the\nPurchase order.\n\ne For Purchases where the Total Cost is greater than $50,000 a written report indicating\nthe compelling rationale that warrants a non-competitive selection will be submitted by\nthe Department to Council for approval prior to selection.\n\ne For Purchases greater than $20,000, Purchasing Services shall prepare the Purchase\n\nOrder and retain and manage the official documentation, including any renewals, if\napplicable.\n\n16\n"
    },
    {
      "page_number": 17,
      "text": "30.4. - Emergency Purchases:\n\nFor the purposes of this section, “Emergency” means an event or occurrence that the\nDepartment Head deems an immediate threat to:\n\ne Public Health;\n\ne The maintenance of essential City service; or\n\ne The welfare and protection of persons, property, or the environment; and the event or\noccurrence necessitates the immediate need for Goods and/or Services to mitigate the\nemergency and time does not permit for a competitive procurement process.\n\nA list of pre-qualified Suppliers will be used to select the Suppliers, whenever possible.\n\nEmergency Purchases approval and reporting:\n\ne Where the Total Cost of the Purchase is equal to or less than $20,000, the Department\nHead may authorize the Purchase. The Department Head prepares the PO, retains and\nmanages the Official Documents, including any renewals, if applicable.\n\ne Where the Total Cost of the Purchase is greater than $20,000, the Chief Administrative\nOfficer may authorize the Purchase, and a report shall be submitted by the CAO\nquarterly to the Finance Committee setting out details of any Purchases made pursuant\nto this authority and the circumstances justifying the action taken.\n\ne For Purchases greater than $20,000, Purchasing Services shall prepare the Purchase\nOrder, and retain and manage the official documentation, including any renewals, if\napplicable.\n\n31. ACCESSIBILITY FOR ONTARIANS DISABILITIES ACT, 2005:\n\nPursuant to the Accessibility of Ontarians with Disabilities Act, 2005, City Council has adopted a\nplan that focuses on accessibility issues and the development of strategic actions to remove\n(where possible) and prevent barriers to access for people with disabilities. All competitive Bids\nwill incorporate measures to ensure that customer service is available to everyone, including\npersons with disabilities.\n\n17\n"
    },
    {
      "page_number": 18,
      "text": "THAT By-Law Number 2017-234 be and is hereby rescinded.\n\nTHIS BY-LAW SHALL COME INTO FORCE AND TAKE EFFECT IMMEDIATELY ON AND\nAFTER PASSING THEREOF.\n\nRead a first time this 13'\" day of January 2020.\n\nRead a second time this 13\" day of January 2020.\n\nRead a third time and finally passed this 13\"\" day of January 2020..\n\nMITCH PANCIUK, MAYOR\n\nMATT MACDONALD, CITY CLERK\n\n18\n"
    },
    {
      "page_number": 19,
      "text": "BELLEVILLE\n\non the Bay of Quinte\nTHE CORPORATION OF THE CITY OF BELLEVILLE\n\nBY-LAW NUMBER 2020-09\n\nAPPENDIX \"A\" - PURCHASING POLICY EXEMPTIONS\n\nAPPENDIX \"B\" — BID IRREGULARITIES\n\nAPPENDIX “C” — LEVELS OF APPROVAL AUTHORITY\n\n19\n"
    },
    {
      "page_number": 20,
      "text": "APPENDIX \"A\" - PURCHASING POLICY EXEMPTIONS\n\nThe purpose of this section is to set out the circumstances under which a Bid Solicitation process is not required.\n\n1.\n\nTraining and Education\n\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\n(9)\n(h)\n\nConferences\nCourses\nConventions\nMagazines\nPeriodicals\nMemberships\nSeminars\nSubscriptions\n\nRefundable Employee\n\n(a)\n(b)\n(c)\n(d)\n(e)\n\nAdvances\n\nMeal Allowances\nMiscellaneous — Non-Travel\nTravel Expenses\n\nTravel Allowances\n\nEmployer's General Expenses\n\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\n\n(9)\n(h)\n(i)\n\n(/)\n\n(k)\n\nPayroll Deduction Remittance\n\nWorkers Safety Insurance Board payments\nMedical\n\nLicenses (vehicles, etc.)\n\nDebt Payments\n\nGrants to Agencies\n\nDamage claims\n\nLegal settlements\n\nArbitration awards\n\nTax Remittances\n\nCharges to and from other government bodies\n\nProfessional and Special Services\n\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\n(9)\n\n(h)\n(i)\n(i)\n(k)\n\nCommittee Fees\n\nHonorariums\n\nMedical Professional Services\n\nTemporary Help\n\nRail Crossing Maintenance provided by CN or CP\n\nPurchases from other levels of Government\n\nCo-operative Purchasing/VOR arrangements. Where the City is purchasing, together with\nother municipalities or other public authorities or governmental agencies.\nThe purchase of Real Property\n\nFinancial assistance\n\nLegal and Insurance Fees\n\nAny additional exceptions, expressly permitted in any applicable Trade\nAgreements, as amended\n\nUtilities\n\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\n\nPostage\n\nWater, Wastewater\nHydro\n\nGas\n\nTelephone\n\nCable Television\n\n20\n"
    },
    {
      "page_number": 21,
      "text": "APPENDIX “B” BID IRREGULARITIES - APPLICABLE TO HARD COPY BIDDING\n\nIrregularity Response\ne Late Bids e Late Bids will not be accepted and will be returned\n\nunopened. Bids will be deemed to have been\nreceived when the package has been stamped\nwith the time and date of receipt by the Purchasing\nSupervisor or their Designate.\n\nSpecified Bid Submission label not used or\npackage not sealed\n\ne Optional rejection at discretion of City\n\nBids not completed in ink or by typewriter\n\ne Automatic rejection\n\nOriginal ink signature missing from\nsignature page(s)\n\ne Automatic rejection\n\nQualified Bids (Bids qualified or restricted\nby an attached or added statement)\n\ne Automatic rejection, unless specified and allowed for\nin the Tender\n\nBids received on documents other than\nthose provided in the Bid Document.\n\ne Automatic rejection\n\nAgreement to Bond\n\na) signature of Bidder and/or bonding\ncompany missing\n\nb) notin the form specified\n\nc) not provided.\n\ne Automatic rejection\n\ne Automatic rejection\n\ne Automatic Rejection\n\nBid Deposit\na) Not provided or not in form specified\n\nb) Bid Deposit of insufficient amount\n\nc) Cheque not certified when cheque has\nbeen submitted as the Bid Deposit\n\nd) Signature of Bidder and/or bonding\ncompany missing when Bid Bond\nsubmitted\n\ne Automatic rejection\ne Automatic rejection\n\ne Automatic rejection\n\ne Automatic rejection\n\nAll Addendum(s) not signed (if issued) and\nsubmitted with Bid Submission\n\ne Optional rejection by the City, unless otherwise\nspecified in the Bid document.\n\nIncomplete Bids (all items not Bid)\n\ne Automatic rejection, unless allowed for in the Bid\ndocument.\n\n21\n\n"
    },
    {
      "page_number": 22,
      "text": "Bids containing minor clerical errors\n\nBidders may be allowed a reasonable time to\ncorrect and initial errors. The City reserves the\nright to waive initialling and accept the Bid or\nreject the Bid. The City shall determine what is\n“minor” in its sole discretion or reject the Bid.\n\nUn-initialled changes to the Bid documents\nwhich are minor (e.g. Bidder’s address is\namended by over-writing but not initialled)\n\nBidders may be allowed a reasonable time to\ncorrect. The City reserves the right to waive\ninitialling and accept Bid or reject the Bid.\n\nUnit prices in the Itemized Bid have been\nchanged but not initialled\n\nBidders may be allowed a reasonable time to\ncorrect. The City reserves the right to waive\ninitialling and accept the Bid or reject the Bid.\n\nOther mathematical errors which are not\nconsistent with unit prices\n\nUnit prices shall govern and the Bid will be\ncorrected accordingly. The City reserves the\nright, in its sole and absolute discretion, to correct\nthe mathematical error(s) and accept Bid as\ncorrected or reject the Bid.\n\nFailure to return the documents as specified\n\nWhere complete documents are specified in the\nBid Document, automatic rejection\n\nIsolated pages are missing\n\nWhere the missing pages would not otherwise be\nassociated with any other Bid _Irregularity\nidentified, the Bidder may be allowed a\nreasonable time to supply the missing pages\nwhere in the opinion of the City, the missing\npage(s) would not directly affect the bid submitted.\nThe City reserves the right to waive the extra\npages and accept the Bid, or to reject the Bid\noutright.\n\nWithdrawal of Bids\n\nWithdrawal of Bids after the closing time will not\nbe allowed.\n\nTie Bids\n\nThe “designated official” shall use a draw to select a\nrecommended Bid as the method of dealing with tied\nBids.\n\nStatements A,B and C\n\nMissing document(s) shall be automatic rejection\nIncomplete or unclear Statement “A” or “B” may\n\nbe allowed reasonable time to correct at the\noption of the City or the City may reject the Bid.\nStatement “A” or “B” when marked “N/A”, “n/a” or\nleft blank shall be automatic rejection.\n\nStatement “C” if unsigned or marked “N/A”, or\nmarked “not applicable”, or left blank shall be\nautomatic rejection.\n\nStatement “C” if incomplete may be allowed a\nreasonable time to provide the missing information at\nthe option of the City or the City may reject the Bid.\n\n22\n\n"
    },
    {
      "page_number": 23,
      "text": "APPENDIX “B” BID IRREGULARITIES - APPLICABLE TO ELECTRONIC BIDDING ONLY\n\nNote: All other provisions under the “Appendix B - Bid Irregularities Applicable to Hard Copy Bidding” shall\n\napply, except for the specifically enumerate provisions below.\n\nLate Bid\n\nAutomatic rejection. Electronic Bidding\nSystem shall not accept late Bid\nSubmissions.\n\nBid submitted in other than the original Bid\nForm format.\n\nAutomatic rejection\n\nBid Form not signed\n\nAutomatic rejection. The Electronic\nBidding System shall not accept Bids\nunless the Bidder has checked a box\nconfirming authority to submit a Bid on\nbehalf of the Bidder.\n\nAll Addendum(s) not acknowledged (if issued).\n\nAutomatic rejection, unless specified\nand allowed for in the Bid document.\n\nBid Deposit\n\na) Not provided or not in form specified in the\nBid document.\n\nb) Bid Deposit of insufficient amount\n\nc) Cheque not certified when specified in the\nBid Document\n\nAutomatic Rejection\n\nAutomatic Rejection\n\nAutomatic Rejection\n\nThe City is unable to verify Digital Bond(s).\n\nUpon request by the City, the Bidder shall\nbe given reasonable time to either; remedy\nthe verification to the City’s satisfaction or\nto submit the original Bid Deposit and/or\nUndertaking to provide a Bond or Letter of\nCredit form to the City or the Bid shall be\nrejected.\n\n23\n\n"
    },
    {
      "page_number": 24,
      "text": "APPENDIX “C” - LEVELS OF APPROVAL AUTHORITY\n\n“Total Cost\" or “Total Dollar Value” means the sum of all costs excluding any non-refundable taxes.\n\nTotal Dollar Value Tool/Procurement Process Approval Authority Policy\nSection\nLow Value Purchase (LVP) - Equal to | Purchasing Card (up to $5,000)\nor less than $5,000. Petty Cash (up to $50) Department Head 11\nPurchase Order ($50 to $5,000)\nGreater than $5,000 but equal to or | RFQ Informal — three (3) written quotes by\nless than $20,000. Department & retained on file Department Head 12\nPO issued by Department\nOfficial Doc’s - Department\nRFQ Formal 13\nGreater than $20,000 but equal to or | RFP 16\nless than $50,000. Competitive process through Purchasing | Department Head\nServices and/or Purchasing Supervisor\nPO issued by Purchasing Services\nOfficial Doc’s — Purchasing Services\nRFP 16\nGreater than $50,000. RFT 15\nFormal Contract Council\nPO issued by Purchasing Services\nOfficial Doc’s — Purchasing Services\nEqual to or less than $20,000. Emergency Purchase Department Head 30.4\nPO issued by Department\nOfficial Doc’s - Department\nEmergency Purchase CAO authorizes, quarterly | 30.4\nGreater than $20,000. PO issued Purchasing Services report to the Finance\nOfficial Doc’s — Purchasing Services Committee\nSole Sourcing or Single Sourcing Department Head, City | 30.3\nEqual to or less than $20,000. PO issued by the Department goasuer & a renasing\nici . upervisor wi report\nOfficial Doc’s - Department steched 1D PO. P\nGreater than $20,000 but equal to or | Sole Sourcing or Single Sourcing Department Head, City | 30.3\nless than $50,000. PO issued by Purchasing Services Treasurer & Purchasing\nOfficial Doc’s — Purchasing Services Supervisor with report\nattached to PO.\nSole Sourcing or Single Sourcing\nGreater than $50,000. Formal Contract and/or PO issued by | Council with a written report | 30.3\nPurchasing Services indicating rationale\nOfficial doc’s — Purchasing Services\nPO Amendments - where the Total Cost of the PO exceeds $50,000 (including previous amendments)\nWhere the total PO amendments | Authorized PO Amendment Form and | Departmen Head and | 20\n(including any previous amendments) | subject to availability of sufficient funds in | Treasurer approval required\ndoes not exceed 10% of the original | appropriate account and budget on form\nPO amount.\nWhere the total PO amendments | Authorized PO Amendment Form and | Department Head, Treasurer | 20\n(including any previous amendments) | subject to availability of sufficient funds in | & CAO approval required on\nis greater than 10% and does not | appropriate account and budget orm\nexceed 20% of the original PO\namount\nWhere the total PO amendments | Authorized PO Amendment Form and | Department Head, Treasurer | 20\n(including any previous amendments) | subject to availability of sufficient funds in | & CAO approval required with\nexceed 20% of the original PO | appropriate account and budget a quarterly report to the\namount.) Finance Committee.\nNote: All work performed on City of Belleville property requires evidence of WSIB & Liability Insurance 17 &18\n\n24\n\n"
    }
  ]
}