{
  "file_name": "BL 2012-79 Property Standards - amended by 2018-82.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "PROPERTY STANDARDS\n\nBY-LAW NO. 2012-79\n"
    },
    {
      "page_number": 2,
      "text": "BY-LAW NO. 2012-79\n\nWHEREAS under Section 15.1(3) of the Building Code Act, S.O. 1992, c.23, as\namended, a By-Law may be passed by the Council of a municipality prescribing the\nstandards for the maintenance and occupancy of property within the municipality\nprovided the official plan for the municipality includes provisions relating to property\nconditions;\n\nAND WHEREAS the Official Plan for the City of Belleville includes provisions relating to\nproperty conditions;\n\nAND WHEREAS the Council of The City of Belleville is desirous of passing a by-law\nunder Section 15.1(3) of the building Code Act, S.O. 1992, c.23;\n\nAND WHEREAS Section 15.6(1) of the Building Code Act, S.O. 1992, c.23, requires\nthat a by-law passed under Selection 15.1(3) of the Building code Act, S.O. 1992, c.23\nshall provide for the establishment of a Property Standards Committee;\n\nAND WHEREAS Part XII Section 391 of the Municipal Act authorizes a Municipality to\nimpose or charge fees for services or activities provided or done by or on behalf of it\nand for adding the amount of such fees to the Municipal Tax Roll;\n\nNOW THEREFORE the Council of the City of Belleville hereby enacts the following:\n"
    },
    {
      "page_number": 3,
      "text": "TABLE OF CONTENTS\n\nSECTION 1\n\nSECTION 2\n\nSECTION 3\n\nSECTION 4\n\nGENERAL 1... cee ceeccecceeee cee eeeeeeceeaeeceeeeeeeeeesaeecaeeeeeeeesaeeseeeseees 1\nV.ASHort Tithe... cece cece ceceeceeeeeneeceeceeeeeeeeaeeseeeeecaeessaeeseeaes 1\nDEFINITIONS 1.00... cc: cccecceeeececeeceececeeceeeeeeeeeesaeeseeseecaeessaeeeneees 2\n2.1Definitions 2\nMAINTENANCE OF ACCESSORY AND\n\nUNOCCUPIED BUILDINGS AND YARDS ...........:::ccceeeeeees 7\n3.1 Accessory Buildings and Structures............::ccceeeeeee 7\n3.2 Unoccupied BuildingS...............:: 7\n3.3 Drainage... 7\n3.4 Fences... 8\n3.5 Trees and Shrubs... 8\n3.6 Garbage Disposal .. . 8\n3.7 NOXiOUS Plants ...........ceceeceeceeceeeeeeee eee eeeeeeeeneeeeeteneeeeeeee 11\n3.8 Parking, Walkways and Safe Passagé..........:.::cceeee 11\n3.9 Sewage .\n3.10 Yards...... .\nCA S101 (210100 peers 12\n3.12 Pedestrian ACCESS 00... eee eee cecte rene eeeeeeeesaeeeeeeeeeeees 13\n3.13 Retaining Walls......... 13\n\n3.14 Gantries and Antennae . 14\nB.15 SIGNS 0... cece cece cee eeetee cee eee cee eeeeeceeeeecaeeeeeeseeeeseeeeeeeees 14\nMAINTENANCE OF BUILDINGS AND STRUCTURES 15\n4.1 Structurally SOUNG.........ccecccceeeeeceeteeceeeeeeeeseseeseeeneeeee 15\n4.2 PeSt PreVentiOn .........ccccccccccccccssseseeeeeceeeescessnaeeeeeeeeeeseeees 15\n4.3 Foundations ............c:ccccccceeees 16\n\n4.4 Basement and Cellar Floors... 17\n4.5 Dampness..........::cccceeeeeeees 17\n4.6 INSUIAtiON............cccceeeceecceceeeeeeessteaeeeeens 17\n4.7 Exterior Walls, Columns and Beams... 17\nCc (00) eee 18\n4.9 Doors and WindOWS ...........c:cccceeeeeeeeeeeeceeeeeeeeeeeeeeeneeeeeeee 19\n4.10 Floors, Stairs, Verandahs, Porches, Decks,\n\nBalconies, Handrails and Landings .............. cece 20\n4.11 Walls and CeilingS........0...ccccccceeeseceseeeceeeeeeeeseseeseeeeneeeees 20\n4.12 EQVreSs .....ccccecceceeceeeeeecneeeeecne eee eeeceeeeesesaeeeeeeneaeeetsneeeeeeee 20\n4.13 Air Conditioners...... 21\n4.14 Elevating Devices..............4. 21\n\n4.15 Fire and Accident Prevention ..............ccccesssssseeeeeeeeeeeenens 21\n"
    },
    {
      "page_number": 4,
      "text": "TABLE OF CONTENTS (Cont'd)\n\nSECTION 5\n\nSECTION 6\n\nSECTION 7\n\nSECTION 8\n\nSTANDARDS FOR USE AND OCCUPANCY\n\n(0) sis =) 0) |B) | \\ Co ene 23\n5.1 Cleanliness................ ..23\n5.2 Water oo... eee 2d\n5.3 PIUMDING ........e cece etree eeeeeees 123\n5.4 Toilet and Bathroom Facilities... 23\n5.5 KITCHENS 0.0.0... ee ce cetececeeceeeesceneneaeeeeeeeeeeseeneneaaes 124\n5.6 Garbage, Refuse Storage Rooms and Chutes.. 25\n5.7 Heating, Ventilating and Mechanical Systems ..... 2d\n5.8 Electrical SErvice...... eee ceeesseeeeeeseceeeeseeeees 1126\n5.9 Light ...cccccseeeeeen 127\n5.10 Ventilation ........ ccc ceccceceeccscessseaeeeeeceeeesseseneaeeeeeeeeeeseenees 27\nOCCUPANCY STANDARDS FOR DWELLINGG................. 29\nADMINISTRATIONAND ENFORCEMENT. ..........cc:ccccceeseeeees 31\n\nApplication of By-Law\n7.1. Appointment of Property Standards Officers\n7.2 Property Standards Committee\n7.3 Notice of Appeal\n7.4 Offence and Penalty Provisions\n7.9 Validity\n"
    },
    {
      "page_number": 5,
      "text": "Page 1\n\nSECTION | - GENERAL\n\n1.1\n\nShort Title\n\nThis By-Law may be cited as the “Property Standards By-Law’.\n\nSECTION 2 - DEFINITIONS\n\n2.1\n\nDefinitions\n\n2.1.1\n\nAcceptable shall mean:\n\n(a) accepted by the Chief Building Official of the Municipality with\nrespect to matters under the Building Code;\n\n(b) accepted by the Chief Fire Official of the Municipality with respect\nto matters under the Fire Protection and Prevention Act, and the\nFire Code hereunder; or\n\n(c) accepted by the Property Standards Officer with respect to all\nother matters regulated by this By-Law.\n\nAccessory Building shall mean a detached building that is not used for\nhuman habitation and the use of which is customarily incidental and\nsubordinate to the principal use of building and located on the same\nlot therewith.\n\nBalustrade shall mean a protective barrier that acts as a guard around\nopenings in floors or at the open sides of stairs, landings, balconies,\ndecks, mezzanines, galleries, raised walkways, or other locations to\nprevent accidental falls from one level to another; such barrier may or\nmay not have openings through it.\n\nBasement shall mean that portion of a building between two floor\nlevels which is partly underground but which has at least one-half of\nits height from finished floor to the undersides of the floor joists of the\nnext above storey, above the adjacent average finished grade level\nadjacent to the exterior walls of the building and in which the height\nfrom finished grade to the underside of the floor joists of the next\nabove storey is less than 1.8 metres (5.91 feet).\n\nBathroom shall mean a room containing at least a washbasin and\ntoilet and bathtub or shower; or two rooms, which contain in total at\nleast one washbasin and one toilet and one bathtub or shower.\n\nBoarding, Rooming or Lodging House shall mean a dwelling house, in\nwhich the proprietor supplies lodging, with or without meals, in return\nfor monetary compensation. For the purposes of this By-Law, a\n\n"
    },
    {
      "page_number": 6,
      "text": "2.1.\n\n2.1.\n\n2.1.\n\n2.1.\n\n2.1.\n\n2.1.\n\n2.1.\n\n2.1.\n\nPage 2\n\nboarding or rooming house shall not include a motel, motor hotel,\nhotel, bed and breakfast establishment, group home or hospital.\n\nBuilding shall mean a structure having a roof supported by columns or\nwalls, directly on the foundation and used for the shelter and\naccommodation of persons, animals or goods.\n\nBuilding Code shall mean the regulations made under Section 34 of\nthe Ontario Building Code Act, 1992 S.O. 1992, c.23, and any\namendments thereto.\n\nBulk Container shall mean a refuse container emptied by mechanical\nmeans without removal from the property.\n\nCellar shall mean that portion of a building between two floor levels\nwhich is partly or wholly underground and which has more than one-\nhalf of its height from finished floor to the underside of the floor joists\nof the storey next above, below the average finished grade level\nadjacent to the exterior walls of the building.\n\nCommercial Property shall mean a property used for the sale and/or\nrental of goods and/or services and for the purpose of this By-Law\nshall include office buildings, public halls, taverns and private clubs,\nand any building that is used in conjunction with these.\n\nCommittee shall mean the Property Standards Committee established\nby the Municipality pursuant to the Building Code Act.\n\nDwelling shall mean a building or structure or part of a building or\nstructure occupied or capable of being occupied in whole or in art for\nthe purposes of human habitation and includes the land and premises\nappurtenant thereto and all outbuildings, fences or erections thereon\nor therein.\n\nDwelling Unit shall mean a suite of two or more rooms, designed or\nintended as an independent unit for residential occupancy by humans\nfor living and sleeping purposes, in which sanitary conveniences are\nprovided, in which facilities are provided for cooking or for the\ninstallation of cooking equipment, in which a heating system is\nprovided, and, which has a private entrance from outside the building\nor from a common hallway or stairway inside. For the purposes of this\nBy-Law, a dwelling unit does not include a hotel, motel or motor hotel.\n\nExterior Property Areas shall mean the property excluding buildings.\n\nFence shall mean a privacy or other screen.\n\nFire Resistance Rating shall mean the time in hours that a material\nconstruction or assembly withstand the passage of flame and\n"
    },
    {
      "page_number": 7,
      "text": "2.1.18\n\n2.1.19\n\n2.1.20\n\n2.1.21\n\n2.1.22\n\n2.1.23\n\n2.1.24\n\n2.1.25\n\n2.1.26\n\n2.1.27\n\n2.1.28\n\nPage 3\n\ntransmission of heat when exposed to fire under specified conditions\nof test and performance criteria as stated in the Building Code.\n\nFire Protection and Prevention Act shall mean the Fire Protection and\nPrevention Act, S.O. 1997, c.4 as amended from time to time.\n\nGraffiti shall mean one or more letters, symbols, etchings, figures,\ninscriptions, pictorial representations, stains or other markings that\ndeface or disfigure a property howsoever made and or affixed.\n\nGround Cover shall mean organic or nonorganic material applied to\nprevent erosion of the exterior property areas such as concrete,\nflagstone, gravel, asphalt or grass.\n\nHabitable Room shall mean a room designed for living, sleeping,\neating or food preparation, including a den, library, sewing room or\nenclosed sunrooms but not including any space in a dwelling used as\na lobby, hallway, closet or bathroom or any room having floor space of\nless than 4.65 square metres (50.05 sq. ft.).\n\nIndustrial Property shall mean a property used for the manufacturing\nand/or processing of goods or used for the storage of goods or raw\nmaterials and any property that is used in conjunction with these uses.\n\nMaintenance shall mean the preservation and keeping in repair of a\nproperty.\n\nMeans of Egress shall mean a continuous path of travel provided by a\ndoorway, hallway, corridor, exterior passageway, balcony, lobby, stair,\nramp, window or other egress facility for the escape of persons from\nany point within a building, floor area, room or contained open space\nto a public thoroughfare or approved open space and includes exits or\naccess to exits.\n\nMultiple Dwelling shall mean a building containing two or more\ndwelling units.\n\nMultiple Use Building shall mean a building containing both a\nresidential and a non-residential use.\n\nMunicipality shall mean The Corporation of the City of Belleville.\n\nNon-Habitable Space shall mean any space in a dwelling or dwelling\nunit other than a habitable room, and includes any bathroom, toilet\nroom, laundry, pantry, lobby, communicating corridor, stairway, closet,\nfurnace room, boiler room or other space for service and maintenance\nor common use, and for access to and vertical travel between storeys\nand any unfinished basement.\n\n"
    },
    {
      "page_number": 8,
      "text": "2.1.29\n\n2.1.30\n\n2.1.31\n\n2.1.32\n\n2.1.33\n\n2.1.34\n\n2.1.35\n\n2.1.36\n\n2.1.37\n\n2.1.38\n\n2.1.39\n\nPage 4\n\nOccupant shall mean any person or persons over the age of eighteen\nyears in possession of the property.\n\nOfficer shall mean a Property Standards Officer as may from time to\ntime by Council be assigned the responsibility of administering and\nenforcing this By-Law.\n\nOwner shall mean the registered owner of the land and premises or\nthe person for the time being paying the municipal taxes or managing\nor receiving the rent of the land or premises in connection with which\nthe word is used whether on his own account or as agent or trustee of\nany other person or who would so receive the rent if such land and\npremises were let, and shall also include a lessee or occupant of the\nproperty who, under the terms of a lease, is required to repair and\nmaintain the property in accordance with the standards for the\nmaintenance and occupancy of the property.\n\nProperty shall mean a building or structure or part of a building or\nstructure, and includes the lands and premises appurtenant thereto\nand all mobile homes, mobile buildings, mobile structures,\noutbuildings, fences and erections thereon whether heretofore or\nhereafter erected and includes vacant property.\n\nPublic Building shall mean a building, which is staffed by government\npersonnel for the purpose of servicing the public.\n\nRepair shall mean the provision of such facilities and the making of\nadditions or alterations or the taking of such actions as may be\nrequired so that the property shall conform to the standards\nestablished in this By-Law. All repairs shall be made in conformity\nwith all applicable codes, standards, regulations and acts.\n\nResidential Property shall mean any property that is used or designed\nfor use as a domestic establishment in which one or more persons\nusually sleep and prepare and serve meals, and includes any land or\nbuildings that are appurtenant to such an establishment.\n\nRoll-off Container shall mean a refuse container, which is required to\nbe transported from the property for the purpose of emptying.\n\nRoomer or Lodger shall mean a person harboured, received or lodged\nin a dwelling in return for compensation.\n\nSewage shall mean any liquid waste containing animal, vegetable or\nmineral matter in suspension or solution, but does not include roof\nwater or other storm runoff.\n\nSewerage System shall mean an adequate system of underground\nconduits, operated either by the Municipality or by the Ministry of the\n"
    },
    {
      "page_number": 9,
      "text": "2.1.40\n\n2.1.41\n\n2.1.42\n\n2.1.43\n\n2.1.44\n\n2.1.45\n\nPage 5\n\nEnvironment and Energy, which carries sewage to an adequate place\nof treatment which meets with the approval of the Ministry of the\nEnvironment and Energy.\n\nSign shall mean a structure or advertising device having illustrations\naffixed thereto or displayed thereon in any manner, which is used to\nidentify, advertise or attract attention to any object, product, place,\nactivity, person, institution, organization, firm, group, profession,\nenterprise, industry or business, or which displays or includes any\nletter, work model number, banner, flag, pennant, insignia, device or\nrepresentation used as an announcement, direction or advertisement.\n\nStandards shall mean the standards of physical conditions and\noccupancy set out in this By-Law.\n\nToilet_Room_ shall mean a room containing a water closet and\nwashbasin.\n\nUnsafe Condition shall mean:\n\n(a) structurally inadequate or faulty for the purposes for which it is used\nor intended to be used; or\n\n(b) in a condition that could pose a hazard to:\n(i) persons in the normal use of a building;\n\n(ii) persons authorized or expected to be on or about the\nproperty; or\n\n(iii) | persons or property in the immediate vicinity of the subject\ncondition.\n\nWall shall mean the solid vertical structure forming any one of the\nsides of the building and/or partition forming the side of a room.\n\nYard shall mean the land other than publicly owned land around and\nappurtenant to any property or any part of a building or structure and\nused or intended t be used or capable of being used in connection\nwith said property.\n"
    },
    {
      "page_number": 10,
      "text": "Page 6\n\nSECTION 3 - MAINTENANCE OF ACCESSORY AND UNOCCUPIED BUILDINGS\nAND YARDS\n\n3.1 ACCESSORY BUILDINGS AND STRUCTURES\n\na) Accessory buildings and structures shall be kept in good repair and free from\nhealth, fire and accident hazards.\n\nb) The exterior of any accessory building shall be weather-resistant through the\nuse of proper weather-resistant material.\n\n3.2 UNOCCUPIED BUILDINGS\n\n3.2.1 Where any property is unoccupied the owner or his agent shall protect every\nsuch property against the risk of fire, accident or other danger and shall\neffectively prevent the entrance thereto of all unauthorized persons, and shall\nprotect against weather damage.\n\n3.2.2 The owner of a vacant building shall board up the building to the satisfaction of\nthe Property Standards Officer by covering all openings through which entry may\nbe obtained with half-inch or thicker weatherproof sheet plywood painted a colour\ncompatible with the surrounding walls and securely fastened by nails or screws.\n\n3.2.3. Where a building remains vacant and unattended for a period of more than sixty\n(60) days, the owner or his agent shall ensure that all utilities serving the property\nare properly disconnected or otherwise secured to prevent accidental or\nmalicious damage to the building or adjacent property.\n\n3.2.4 Section 3.2.3 does not apply where such utilities are necessary for the safety\nsecurity or maintenance of the building.\n\n3.2.5 Despite the provisions relating to unoccupied buildings in section 3.2 of this by-\nlaw the owner of any property on which is situate a building, or part thereof, that\nis boarded up for a period exceeding three (3) months shall either:\n\na) repair the building and bring it into conformity with sections 4 through 6 of\nthis by-law within the next three (3) succeeding months, or\n\nb) demolish all buildings and structures on the property and remove all debris\nand refuse and leave the property in a graded and leveled condition.”\n\n3.3. DRAINAGE\n\n3.3.1 Storm water shall be drained from the yard so as to prevent recurrent ponding or\nthe entrance of water into a basement or cellar.\n\n3.3.2 All reasonable means shall be employed to prevent the erosion of the soil in the\nyard.\n"
    },
    {
      "page_number": 11,
      "text": "3.3.3\n\nPage 7\n\nNo roof drainage, pump discharge or surface water shall be discharged on\nsidewalks, stairs or directed to neighbouring property.\n\n3.4 FENCES\n\nEvery fence shall be kept:\n\na)\n\nb)\n\n¢)\n\nqd)\n\n3.5\n\nprotected by paint, preservative or other weather resistant material unless the\naesthetic characteristics of the fence, screen or enclosure are enhanced by the\nlack of such material; and\n\nin a structurally sound condition; and\n\nfree from objectionable markings, painted slogans, stains or other defacement;\nand\n\nin good repair and free of accident hazard.\n\nTREES AND SHRUBS\n\nNo person shall have, plant, grow, maintain or permit on his property any fence, hedge,\nshrub, or plant or tree which does or may:\n\na)\nb)\n¢)\n\nqd)\n\ne)\n\n3.6\n\n3.6.1\n\n3.6.2\n\nobstruct the safety of the public; or\naffect the safety of vehicular or pedestrian traffic; or\nconstitute an obstruction of view for vehicular traffic; or\n\nwholly or partially conceal or interfere with the use of any hydrant or water valve;\nor\n\noverhang or encroach upon any sidewalk or pavement or travelled portion of any\nstreet or highway, so as to interfere with the function of the sidewalk or highway.\n\nGARBAGE DISPOSAL\n\nAll garbage, rubbish and other debris from a property shall be promptly\nstored in receptacles and made available for removal or removed in\naccordance with City of Belleville regulations. Where private\ncontainerized garbage pickup is provided, such containers shall be placed\nbehind the building line and kept in a neat and tidy condition.\n\nWhere a separate garbage storage room for use by the tenants is not\nprovided inside a multiple dwelling building, exterior receptacles, bins or\ncontainers of sufficient size shall be provided for the storage of garbage\nand refuse.\n"
    },
    {
      "page_number": 12,
      "text": "3.6.3\n\n3.6.4\n\n3.6.5\n\nPage 8\n\nWithout limiting and in addition to the generality of Sub-section 3.6.1., the\ncollection, handling, storage and disposal of refuse shall comply with the\nfollowing:\n\na)\n\nb)\n\n¢)\n\nqd)\n\nit shall facilitate collection and disposal as required by the municipal\ncorporation or private collecting agency, as applicable; and\n\nrefuse storage facilities shall be readily accessible to all occupants\nfor whom the storage facility is required to be provided, or in the\nalternative be readily accessible by an operable refuse chute\nprovided for this purpose in compliance with all regulations\napplicable thereto; and\n\nrefuse storage facilities shall be maintained in a clean, sanitary and\nodour controlled condition, and\n\nit shall not obstruct an emergency route, recreation facility, parking\narea, driveway, walkway, or opening into a building.\n\nWhere refuse is to be stored or placed for disposal outside the enclosing\nwalls of a building, the storage and place for disposal shall;\n\na)\n\nb)\n\nbe maintained at all times in a litter free condition and in a manner\nthat will not attract pests or create a health or safety hazard due to\nthe nature of the storage or through deterioration, wind or misuse of\nthe storage facility; and\n\nbe screened if less than 60 metres (196.85 feet) from a public\nhighway, street, walkway, park or residential property so as not to\nbe visible from such locations.\n\nNothing in this Section shall require screening:\n\na)\n\nb)\n\n¢)\n\nqd)\n\ne)\n\nwhose only purpose is to screen a refuse collection area from\nanother refuse collection area on the same or abutting properties;\nor\n\nbetween each occupancy in a multiple occupancy building; or\n\nthat reduces the width of an access route to less than 10 metres\n(32.81 feet); or\n\nin regard to the placement of refuse for imminent pickup and\ndisposal in compliance with the refuse collection by-law of the\nMunicipality; or\n\nin relation to a residence building containing less than three\ndwelling units.\n"
    },
    {
      "page_number": 13,
      "text": "3.6.6\n\n3.6.7\n\n3.6.8\n\n3.6.9\n\n3.6.10\n\n3.6.11\n\nPage 9\n\nWhere an exterior bulk or roll-off container refuse disposal system is used\nit shall:\n\na) be equipped with covers or similar devices which shall be readily\nopenable but not left open except when actively being loaded; and\n\nb) be large enough to contain all refuse generated between collections\nby the occupants served; and\n\nc) not be loaded beyond the top of the container.\n\nSub-section 3.6.6 a) shall not apply to the storage of industrial or other\nreclaimable refuse that will not materially deteriorate by weathering or\npests.\n\nWhere refuse is stored or placed for disposal inside the enclosing walls of\na building, the storage and placement for disposal shall:\n\na) comply with the Building Code and the Fire Protection and\nPrevention Act, and the Fire Code thereunder; and\n\nb) be large enough to contain all refuse generated between collections\nby the occupants served.\n\nWhere a refuse chute system was originally provided in a multiple floor\nbuilding, the system shall be maintained operative, except that acceptable\nalternatives may be provided if readily accessible to all occupants.\n\nRefuse shall be deemed to be stored inside a building when:\na) a bulk or roll-off container is used; and\n\nb) connected to the building by a system of enclosed chutes such that\nthe loading of refuse thereto is directly from within the building\nutilizing manual, compaction or other methods of handling; and\n\nc) the components outside the building are screened from view and\nmaintained as prescribed in Sub-section 3.6.4.\n\nNotwithstanding the requirements of this Section, temporary storage\nresulting solely from the construction, demolition or alteration of a building\nor part thereof may be placed on the property provided:\n\na) itis removed frequently and in its entirety from the property; and\n\nb) it will not cause risk to the health or safety of any persons; and\n\nc) it is not stored in such a manner as to be deleterious to the\nneighbouring environment.\n"
    },
    {
      "page_number": 14,
      "text": "Page 10\n\n3.7 NOXIOUS PLANTS\n\nAll properties shall be kept free from noxious plants, including ragweed, poison ivy,\npoison oak and poison sumac and comply with the specifications of the Weed Control\nAct, R.S.O. 1990, as amended, and regulations and by-laws established there under.\n\n3.8 PARKING, WALKWAYS AND SAFE PASSAGE\n\n3.8.1 Areas used for vehicle traffic and parking shall be paved with bituminous,\nconcrete or equivalent surfacing or shall be surfaced with crushed stone or\nother suitable and reasonable dust free substance, and shall be free from\nponding and otherwise in good repair.\n\n3.8.2 Paved communal parking areas shall be provided with suitable markings,\nsuch as painted lines, to indicate parking spaces, means of entry and\negress for vehicles and shall be maintained so as to be clearly visible.\n\n3.8.3 In yards of multiple dwellings and non-residential properties sufficient\nlighting of exterior property areas shall be provided to minimize any\ndanger to persons using walkways.\n\n3.8.4 Artificial lighting standards and fixtures shall be kept in safe condition, in\nworking order and in good visual condition.\n\n3.8.5 Communal walkways, driveways, ramps, parking areas and outside stairs\nand landings shall be promptly cleared of snow and appropriate measures\nshall be taken to minimize the risk of persons slipping or vehicles skidding\non icy surfaces.\n\n3.8.6 Walkways shall be repaved, resurfaced or regraded as often as necessary\nto maintain a reasonably smooth and safe surface for pedestrian traffic.\n\n3.9 SEWAGE\n3.9.1 Sewage or organic waste shall be discharged into the municipal sewage\n\nsystem or a septic tank system subject to the requirements of the Building\nCode, latest edition.\n\n3.9.2 Sewage of any kind shall not be discharged onto the surface of the\nground, whether into a natural or artificial surface drainage system or\notherwise.\n\n3.10 YARDS\n\n3.10.1 All yards shall be kept clean and free from rubbish, garbage, brush, or\n\nother debris and from objects or conditions that might create a health, fire\nor accident hazard.\n"
    },
    {
      "page_number": 15,
      "text": "3.10.2\n\n3.10.3\n\n3.10.4\n\n3.10.5\n\n3.10.6\n\n3.10.7\n\n3.10.8\n\n3.10.9\n\n3.10.10\n\n3.10.11\n\nPage 11\n\nThe occupant of a residential property may store limited quantities of\nfirewood provided that it is stored in a safe manner. Such storage shall be\nfor the occupant’s sole use and shall not be located between a building\nand the front lot line.\n\nAny vehicle, including a trailer, which is in a wrecked, discarded,\ndismantled, inoperative or abandoned condition shall not be parked,\nstored or left in a yard but this shall not prevent the occupant of any\npremises from repairing one vehicle for his own use but not for\ncommercial purposes, while such repair is actively carried out.\n\nAll yards shall be kept reasonably free of weeds and heavy undergrowth.\nNoxious weeds shall be eliminated.\n\nGrasses shall be maintained at a reasonable length.\n\nAll yards and vacant lots shall be kept clean and free from termites,\nrodents, vermin and other pests and any conditions which might result in\nthe harbouring of such pests.\n\nAll yards and vacant lots shall be free of dilapidated or collapsed\nstructures or accumulation of materials, inoperative machinery, or any\nparts thereof or any other unsafe condition or unsightly condition out of\ncharacter with the surrounding environment.\n\nAll yards and vacant lots shall be free of holes or excavations or any\nunprotected wells that might create an accident or health hazard.\n\nAll yards shall be protected by suitable ground cover, which prevents\nerosion of the soil.\n\nAll composting associated with a residential dwelling unit shall be neatly\nkept in a suitable enclosure located in a rear yard or side yard, not closer\nto the front lot line than the front of the dwelling, and not closer than 1.0\nmetre to a side or rear lot line.\n\nAll trees on the property shall be kept pruned so as to be free from dead\nbranches. Dead trees and shrubs shall be removed from the property.\n\n3.11. BUFFERING\n\n3.11.1\n\nPremises which, because of their use or occupancy, or for any other\nreason, create a nuisance to adjacent premises or to the neighbourhood\nor to the users of streets or parks shall be buffered from such premises or\npublic areas so as to minimize the effect of the nuisance.\n"
    },
    {
      "page_number": 16,
      "text": "3.11.2\n\n3.12\n\n3.13\n\n3.13.1\n\n3.13.2\n\nPage 12\n\nWithout limiting the generality of the foregoing, such buffering shall\ninclude:\n\na)\n\nb)\n\n¢)\n\nqd)\n\ne)\n\nthe provision and maintenance of an effective barrier to prevent\nwind-blown waste, wrappings, debris and the like from encroaching on\nthe adjacent premises; and\n\nthe provision and maintenance of a visual screen, appropriate to the\nnature of the adjacent uses, to minimize the visual impact of\nnuisances to persons at grade adjacent to the property; and\n\nto prevent lighting and vehicle headlights in parking areas from shining\ndirectly into dwelling unit windows; and\n\nto screen transformers and other similar structures and/or equipment;\nand\n\nto provide a safe route for persons and vehicles.\n\nPEDESTRIAN ACCESS\n\nA safe pedestrian access shall be provided to the principal entrance of every\nresidential building.\n\nRETAINING WALLS\n\nRetaining walls shall be maintained in a structurally sound condition,\nin good repair, and free of accident hazards.\n\nWithout restricting the generality of Sub-section 3.13.1, the maintenance\nincludes:\n\na)\n\nb)\n\n¢)\n\nqd)\n\nredesigning and rebuilding to the requirements of the Building Code,\nor replacing of all deteriorated, damaged, misaligned or missing\nportions of the wall or railings and guards appurtenant thereto; and\n\ninstalling subsoil drains where required to maintain the stability of the\nwall; and\n\ngrouting masonry cracks; and\napplying a coating of paint or equivalent preservative to prevent\n\ndeterioration or an unsightly appearance deleterious to the\nneighbouring environment.\n"
    },
    {
      "page_number": 17,
      "text": "Page 13\n\n3.14 GANTRIES AND ANTENNAE\n\nGantries, antennae and similar structures shall be maintained:\n\n(a)\n(b)\n(c)\n(d)\n\nplumb, unless specifically designed to be other than vertical; and\nin good repair and free of fire and accident hazards; and\nin a relatively rust free condition; and\n\nso as not to present an unsightly appearance deleterious to the\nneighbouring environment.\n\n3.15 SIGNS\n\n3.15.1\n\n3.15.2\n\n3.15.3\n\nSigns shall be repaired and maintained:\na) so as not to cause any unsafe condition; and\n\nb) in a vertical plane unless otherwise erected and approved, in which\ncase the sign shall be maintained as erected and approved; and\n\nc) without any visible deterioration of the sign and its structure when\nviewed from any property other than the property on which the sign is\nsituated; and\n\nd) in conformance with the requirements of the Sign By-law of the\nMunicipality, if applicable.\n\nSigns and sign structures that are unused, not cared for or discarded shall\nbe removed from the property or shall be stored within a building.\n\nWhen the sign face or other part of a sign has been removed, the\nremaining portion of the sign including the sign structure shall be\nmaintained in a safe condition and so as not to create an unsightly\nappearance deleterious to the neighbouring environment, or be removed.\n"
    },
    {
      "page_number": 18,
      "text": "Page 14\n\nSECTION 4 - MAINTENANCE OF BUILDINGS AND STRUCTURES\n\n41\n\n4.1.1\n\n4.2\n\n4.2.1\n\n4.2.2\n\nSTRUCTURALLY SOUND\n\nEvery part of a property shall be maintained in a structurally sound\ncondition so as to be capable of sustaining safely its own weight and any\nload to which it may be subject.\n\nMaterials, which have been damaged or show evidence of rot or other\ndeterioration shall be repaired or replaced.\n\nThe factors of safety specified in the Building Code are the minimum\nstandards.\n\nWhere an owner disputes the need for repairs under this Section, he may\nsubmit a written report signed and sealed by a professional engineer\nlicensed to practice in the relevant discipline in the Province of Ontario on\nthe matters thereto.\n\nThe Officer may accept the findings in the report pursuant to Sub-section\n4.1.4 as the requirements for compliance with the required repairs\nprovided he is satisfied all deficiencies have been identified and\nappropriately dealt with by the report.\n\nThe Property Standards Officer may require an engineer's report of a\nbuilding or structure if in his opinion the building or structure is not\nstructurally sound, such engineer's report to be at the expense of the\nowner(s).\n\nPEST PREVENTION\n\nBuildings shall be maintained reasonably free of rodents, vermin and\ninsects at all times, and methods used for exterminating rodents, vermin\nand/or insects shall be in accordance with provisions of all applicable\nstatutes and regulations of any authority having jurisdiction.\n\nBasement and cellar windows or ventilators used or required for\nventilation, and any other openings in a building including a floor drain that\nmight permit the entry of rodents, shall be screened with wire mesh, metal\ngrille or other durable material which will effectively exclude rodents,\nvermin or other animals or pests.\n"
    },
    {
      "page_number": 19,
      "text": "4.3\n\n4.3.1\n\n4.3.2\n\nPage 15\n\nFOUNDATIONS\n\nFoundations shall be of masonry, concrete or other acceptable materials\nand designed to adequately support the loads imposed and provide a dry\nbasement or crawl space. They shall be free of leaks and defective\nmortar joints or masonry. Foundation walls shall be reasonably\nwaterproof and damp proof to prevent the entry of moisture or water into\nthe basement, cellar or crawl space.\n\nFoundations shall be maintained in good repair. The maintenance and\nrepair includes:\n\na) extension of the wall foundations below grade or regrading to provide\nadequate frost cover; and\n\nb) installing subsoil drains where such would be beneficial; and\n\nc) repairing or replacing decayed, damaged or weakened sills, piers,\nposts or other supports; and\n\nd) grouting, waterproofing, cladding or replacing as necessary so as to\nbe weather tight; and\n\ne) where insects and rodents are detected, the treatment by acceptable\nmethods to deter their entrance; and\n\nf) the replacement, cladding or treatment with other methods to restore\nthe wall to its original or acceptable equivalent appearance; and\n\ng) the applying of acceptable materials to preserve all wood, metal work\nor other materials not inherently resistant to weathering or wear; and\n\nh)_ the restoring, or replacing of:\n\ni) the foundations, walls, columns, beams, floor and floor slabs;\nand\n\nii) components, claddings, finishes, and trims forming a part\nthereof;\n\ni) the carrying out of such other work as may be required to overcome\nany existing settlement detrimental to the structural integrity or\nappearance of the building; and\n\nj) removing or replacing loose or unsecured objects and materials.\n"
    },
    {
      "page_number": 20,
      "text": "44\n\n4.4.1\n\n4.4.2\n\n4.4.3\n\n4.4.4\n\n4.5\n\n4.6\n\n4.6.1\n\n4.6.2\n\n4.7\n\n4.7.1\n\n4.7.2\n\n4.7.3\n\nPage 16\n\nBASEMENT AND CELLAR FLOORS\n\nWhere a basement or cellar has a concrete or masonry floor, such floor\nshall be maintained in good condition.\n\nWhere a basement, cellar or crawl space has an earthen floor, adequate\nventilation shall be provided.\n\nBasement or cellar windows used or required for ventilation and any\n\nother opening in a basement or cellar including a floor drain, shall be\nscreened with wire mesh, metal grille or other durable material which will\neffectively exclude rodents.\n\nWhere equipment requiring service such as plumbing, clean outs, traps\nand furnaces is located in crawl spaces, safe and adequate access\nshall be provided.\n\nDAMPNESS\n\nThe interior floors, ceilings and walls shall be kept free from dampness arising\nfrom the entrance of moisture through an exterior wall or a roof, or through a\ncellar, basement or crawl space floor.\n\nINSULATION\n\nThe insulation requirements of the Building Code shall be complied with\nwhere necessary and practical.\n\nEvery dwelling shall be provided with sufficient thermal insulation to\nprevent moisture condensing on the interior surfaces of walls, ceilings and\nfloors during the winter.\n\nEXTERIOR WALLS, COLUMNS AND BEAMS\n\nThe exterior walls and other parts of the building shall be free from loose,\nrotted, warped and broken materials and objects. Such materials and\nobjects shall be removed, repaired or replaced.\n\nAll exterior surfaces shall be of materials, which provide adequate\nprotection from the weather and insects.\n\nThe exterior walls and their components shall be adequate to support the\nloads upon them and shall have an acceptable cladding or covering, free\nof holes, cracks or excessively worn surfaces, to prevent the entry of\nmoisture into the structure and provide reasonable durability and shall be\nso maintained by the painting, restoring or repairing of the walls, coping or\nflashing and by the waterproofing of joints and of the walls themselves and\nby the installing or repairing of terminate shields or other suitable\nmethods.\n"
    },
    {
      "page_number": 21,
      "text": "4.7.4\n\n4.7.5\n\n4.7.6\n\n4.7.7\n\n4.8\n\n4.8.1\n\n4.8.2\n\n4.8.3\n\n4.8.4\n\nPage 17\n\nGraffiti on the exterior of any property shall be prohibited and the surface\nof the property shall be restored to as near as possible the original\nappearance before the graffiti was applied.\n\nExterior surfaces of a building shall be kept clean.\n\nExterior surfaces of materials used for the temporary barricading of\nopenings to the interior of a building shall be surfaced with a finish\ncompatible with the surrounding finishes.\n\nExterior columns and beams shall be maintained in a good state of repair\nand any decorative trim shall be maintained in a safe condition. Where\nnecessary, such columns, beams and trim shall be restored, repaired or\nreplaced and suitably protected against weathering, so as to prevent or\nremedy deterioration detrimental to the appearance of the building.\n\nAll roof construction components shall provide adequate support for all\nprobable loads and form a suitable base for the roof covering. The roof\nincluding the fascia board, soffit, cornice and flashing shall be maintained\nin a watertight condition so as to prevent leakage of water into the building\nand where necessary shall be maintained by the repair of the roof and\nflashing, or by applying waterproof coatings or coverings.\n\nEvery roof including related roof structures, eavestroughs, roof gutters,\ndownpipes, guards and lightning arrestors shall be maintained, repaired or\nreplaced so as to properly perform the intended function and be of\nacceptable appearance.\n\nWithout restricting the generality of Subsections 4.8.1 and 4.8.2 the\nmaintenance and repair includes:\n\n(a) removal of obstructions or loose, unsecured objects and materials,\nand;\n\n(b) removal of dangerous accumulations of snow and ice, and;\n\n(c) removal of other accident and fire hazards, and;\n\n(d) the overhaul or provision of flashings.\n\nChimneys, smoke or vent stacks and other roof structures shall be\nmaintained in good repair so as to be free from:\n\n(a) loose bricks, mortar, and loose or broken capping, and;\n\n(b) loose or rusted stanchions, guy wires, braces and attachments,\nand;\n\n(c) any fire or accident hazard, and;\n\n(d) unsightly objects and conditions detrimental to the appearance of the\nbuilding.\n"
    },
    {
      "page_number": 22,
      "text": "4.9\n\n4.9.1\n\n4.9.2\n\n4.9.3\n\n4.9.4\n\n4.9.5\n\n4.9.6\n\nPage 18\n\nDOORS AND WINDOWS\n\nAll exterior door openings shall be fitted with exterior grade doors and all\nexterior window openings shall be fitted with exterior grade windows.\n\nWindows, exterior doors and basement or cellar hatchways shall be\nmaintained in good repair so as to prevent the entrance of wind or rain into\nthe dwelling.\n\nRotted or damaged doors, door frames, window frames, sashes and\ncasings, weatherstripping, broken glass and missing or defective door and\nwindow hardware shall be repaired or replaced.\n\nWithout restricting the generality of Sub-section 4.9.3, the maintenance\nand repair includes:\n\n(a) the refitting, replacing or renewing of damaged, decaying or defective\ndoors, windows, frames, sashes, casings, shutters, hatchways or\nscreens; and\n\n(b) reglazing cracked, broken or missing glass; and\n\n(c) replacing or repairing defective or missing hardware; and\n\n(d) rescreening or weatherstripping where such is defective or\nmissing; and\n\n(e) painting or the applying of a similarly effective preservative.\n\nWhen an opening is used or required for ventilation or illumination and is\nnot required to be protected by a door, window or similar closure, it shall\nbe protected with:\n\n(a) awire mesh screen, metal grille or other equivalent durable material;\nor\n\n(b) other protection so as to effectively prevent the entry of rodents or\nVermin.\n\nAll doors and opening windows in a dwelling unit shall be provided with\nthe means of being latched or secured from within, and shall be\nmaintained in an operable condition.\n"
    },
    {
      "page_number": 23,
      "text": "Page 19\n\n4.10 FLOORS, STAIRS, VERANDAHS, PORCHES, DECKS, BALCONIES\nHANDRAILS AND LANDINGS\n\n4.10.1 Every floor, stair, verandah, porch, deck, balcony and every appurtenance\nand surface finishing attached or laid thereto shall be maintained,\nreconstructed, repaired, cleaned or replaced so as to properly perform the\nintended function and be of acceptable appearance.\n\n4.10.2 Without restricting the generality of Sub-section 4.10.1, the maintenance,\nreconstructing or repair includes:\n\n(a) repairing or replacing floors, treads and risers, including finishes such\nas linoleum and carpet which contain depressions, protrusions,\ndeterioration, or are broken, torn, warped, loose or otherwise\ndefective; and\n\n(b) renewing or strengthening structural members that are rotted,\ndeteriorated or loose; and\n\n(c) providing or renewing balustrades, guardrails and railings; and\n\n(d) restricting openings in and climbability of guards to which small\nchildren have access, to the requirements of the Building Code; and\n\n(e) painting or the applying of other equivalent preservative.\n4.11 WALLS AND CEILINGS\n\n4.11.1 Every wall and ceiling finish shall be maintained so as to be free of holes,\ncracks, loose coverings or other defects. Such maintenance shall include\nappropriate finishing of all joints and surfaces.\n\n4.11.2 Where dwelling units are separated vertically, the divided walls from the\ntop of the footings to the underside of the roof deck, and any space\nbetween the top of the wall and the roof deck shall be tightly sealed by\ncaulking, mineral wool or similar non-combustible material, and such walls\nshall conform to the fire resistance ratings contained in the Building Code.\n\n4.12 EGRESS\n\n4.12.1 Every required exit from a residential building shall open directly to a\nstreet or outer court. In the case of a one unit dwelling, there shall be at\nleast two exits suitably remote from each other, from the first storey.\n\n4.12.2 Every dwelling, which contains dwelling units located, other than on the\nground floor shall be provided with a second means of safe continuous\nand unobstructed egress.\n"
    },
    {
      "page_number": 24,
      "text": "4.12.3\n\n4.12.4\n\n4.12.5\n\n4.12.6\n\n4.12.7\n\nPage 20\n\nIn the case of a multiple dwelling, wherever there are not two means of\negress from each apartment, suitably remote from each other, there shall\nbe ready access to at least two means of egress leading to separate and\nindependent exits or safe place of rescue.\n\nA required exit shall not pass through an attached garage, or built-in\ngarage or an enclosed part of another dwelling unit.\n\nAll commercial, institutional and industrial buildings shall be provided with\nexits of size and number so as to be in compliance with the requirements\nof the Building Code, for the appropriate group and division.\n\nAll commercial, institutional and industrial buildings shall be provided with\nemergency lighting facilities capable of ensuring a safe means of egress.\n\nAll commercial, institutional and industrial buildings shall be provided with\nclean, clear, unobstructed and readily visible exit signs where such exit\nsigns would be required to locate means of egress.\n\n4.13 AIR CONDITIONERS\n\nAll air conditioners (including heat pumps) shall be maintained in a safe\nmechanical and electrical condition and shall not adversely affect areas\nbeyond the limits of the property by reason of condensation drainage.\n\n4.14 ELEVATING DEVICES\n\n4.15\n\nElevating devices shall be maintained:\n\n(a)\n\nin accordance with the requirements of the Technical Standards and Safety\nAct, 2000, S.O. 2000, c.16 as amended from time to time, and all\nregulations made thereunder; and\n\n(b) with all parts including, but not limited to, lighting fixtures, lamps, elevator\n\nbuttons, floor indicators and ventilation fans in good repair and operational.\n\nFIRE AND ACCIDENT PREVENTION\n\n(a) When, because of the existence of a building or accessory structure, or the\n\n(b)\n\ncontents thereof, an unsafe condition exists to persons on or about the\nexterior property areas of a premises, the Building Code shall apply to the\nextent necessary to abate the unsafe condition.\n\nIn the event of fire or other disaster, measures shall be taken as soon as\npossible to make the damaged building or accessory structure compatible\nwith its environment. Without restricting the generality of the foregoing,\nsuch measures include making the building or accessory structure safe;\nrepairing damaged surfaces exposed to view; and refinishing so as to be in\nharmony with adjoining undamaged surfaces and the general environment.\n"
    },
    {
      "page_number": 25,
      "text": "(c)\n\n(d)\n\nPage 21\n\nIn the event the building or accessory structure is beyond repair, the land\nshall be cleared of all remains and left in a graded and tidy condition.\n\nMaterials of an inflammable nature shall be safely stored or removed at\nonce from the property.\n"
    },
    {
      "page_number": 26,
      "text": "Page 22\n\nSECTION 5 - STANDARDS FOR USE AND OCCUPANCY OF BUILDINGS\n\n5.1\n\n5.2\n\n5.2.1\n\n5.2.2\n\n5.2.3\n\n5.3\n\n5.3.1\n\n5.3.2\n\n5.3.3\n\n5.3.4\n\n5.3.5\n\n5.4\n\n5.4.1\n\n5.4.2\n\nCLEANLINESS\n\nEvery floor, wall, ceiling and fixture in any building shall be maintained in a clean\nand sanitary condition and the building shall be kept free from rubbish, debris or\nconditions, which constitute a fire, accident or health hazard.\n\nWATER\n\nEvery dwelling, dwelling unit, commercial, institutional or industrial building shall\nbe provided with an adequate supply of drinkable running water from a source\napproved by the Medical Officer of Health.\n\nEvery sink, wash basin, bathtub, or shower required by this By-law shall have an\nadequate supply of hot and cold running water.\n\nAdequate running water shall be supplied to every water closet.\nPLUMBING\n\nSewage shall be discharged into the municipal sewerage system, or a system\nconforming to the building code.\n\nAll plumbing, drain pipes, water pipes and plumbing fixtures in every building and\nevery connecting line to the sewerage system shall be maintained in good\nworking order and be protected from freezing.\n\nThe plumbing system shall provide an adequate and potable hot and cold\nwater supply, drainage, venting and operation of fixtures.\n\nEvery water heater shall have sufficient capacity to provide an adequate supply\nof hot water at a temperature of not less than 43 degrees Celsius (109.4 degrees\nF) at all times in all parts of every building, dwelling unit, or shared facility.\n\nAll plumbing fixtures and piping shall conform to all Federal and Provincial\nlegislation and regulations and to Municipal By-laws.\n\nTOILET AND BATHROOM FACILITIES\n\nEvery dwelling unit except as provided in Sub-section 5.4.2 hereof, shall contain\nplumbing fixtures consisting of at least:\n\n1. water closet 2. akitchen sink\n3. awashbasin 4. a bathtub or shower\n\nIn a boarding, lodging, or rooming house there shall be a water closet, wash\nbasin and bathtub or shower for not more than eight persons and these facilities\n"
    },
    {
      "page_number": 27,
      "text": "5.4.3\n\n5.4.4\n\n5.4.5\n\n5.4.6\n\n5.4.7\n\n5.4.8\n\n5.4.9\n\n5.5\n\n5.5.1\n\n5.5.2\n\n5.5.3\n\nPage 23\n\nshall be located on the same storey as, or on the next storey up or down from the\nstorey on which the room is located.\n\nEvery commercial, institutional and industrial building shall contain plumbing\nfixtures in accordance with the appropriate Provincial legislation.\n\nAll bathrooms and toilet rooms shall be located within and be accessible from\nwithin the building, which it serves.\n\nAll bathrooms and toilet rooms shall be fully enclosed and have a door capable of\nbeing locked so as to provide privacy for the occupant.\n\nWhere practical a washbasin shall be located in the same room as the water\ncloset, or shall be conveniently adjacent to the room containing the water closet.\n\nNo facilities for the preparation, cooking, storage or consumption of food or for\nsleeping shall be within a room that contains a water closet.\n\nIn a building containing dwelling units, the sanitary conveniences and toilet\nfacilities used in connection with the residential portion of the building shall be\nseparated from any facilities and conveniences used in connection with any\nnon-residential portion.\n\nRooms containing sanitary conveniences and toilet facilities shall:\n\n(a) be regularly cleaned so as to be maintained in a clean and sanitary\ncondition; and\n\n(b) have smooth surfaces reasonably impervious to water.\nKITCHENS\n\nEvery kitchen area shall be equipped with a sink served with hot and cold\nrunning water, storage facilities and counter top work area having minimum\ndimensions of 1.20 metres (3.94 feet) in length by 0.56 metres (1.84 feet) in\nwidth and space shall be provided for a stove and refrigerator.\n\nThe splash back and counter top around the kitchen sink shall have an\nimpervious surface.\n\nEvery kitchen shall have provided an adequate and approved gas or electrical or\nother fuel supply for cooking purposes and there shall be at least 0.76 metres\n(2.49 feet) clear space above any exposed cooking surface. Clear space may be\nreduced in compliance with the requirements of the Building Code.\n"
    },
    {
      "page_number": 28,
      "text": "5.6\n\n5.7\n\n5.7.1\n\n5.7.2\n\n5.7.3\n\n5.7.4\n\n5.7.5\n\n5.7.6\n\n5.7.7\n\n5.7.8\n\n5.7.9\n\nPage 24\n\nGARBAGE, REFUSE STORAGE ROOMS AND CHUTES\n\nGarbage chutes, disposal rooms, containers and receptacles shall be washed\ndown, disinfected and maintained as is necessary to be clean, free of pests or\nvermin, odour free and in good working order and good repair.\n\nHEATING, VENTILATING AND MECHANICAL SYSTEMS\n\nEvery dwelling and/or dwelling unit shall be provided with a heating system\ncapable of maintaining an indoor air temperature of 21 degrees Celsius (69.8\ndegrees F) in all areas of the dwelling or dwelling unit except that in an\nunfinished basement or cellar and common areas such as common hallways and\nlaundry rooms, the heating system shall be capable of maintaining an indoor air\ntemperature of not less than 15 degrees Celsius (59.0 degrees F) from the 15th\nday of September in each year to the 31st day of May of the following year at the\noutside winter design temperature specified in the Building Code. Crawl spaces\nneed not be heated.\n\nThe heating system required by Section 5.7.1 shall be maintained in good\nworking condition so as to be capable of heating the dwelling safely to the\nrequired standard.\n\nAny heating appliance or device shall be located with reference to clear space\nrequirements on all sides in accordance with the Building Code and shall not be\nplaced so as to impede the free movement of persons within the room where it is\nlocated.\n\nA space that contains a heating unit shall have natural or mechanical means of\nsupplying air in such quantities to provide adequate combustion.\n\nWhere a heating system, or part of it, or any auxiliary heating system burns solid\nor liquid fuel, a space or receptacle for the storage of the fuel or residue shall be\nprovided and maintained in a convenient location and properly constructed so as\nto be free from fire or accident hazards.\n\nFuel burning equipment shall be vented by means of a connection leading to a\nchimney or a vent or flue which conforms to building and safety standards.\n\nEvery chimney, smoke pipe and flue shall be maintained so as to prevent the\ncontents from leaking into the dwelling.\n\nAll flues shall be kept clear of obstruction, all open joints shall be sealed and all\nbroken and loose masonry shall be repaired.\n\nFireplaces and similar construction used or intended to be used for burning fuels\nin open fires shall be connected to approved chimneys and shall be installed and\nmaintained so as not to create a fire hazard to nearby or adjacent combustible\nmaterials and structural members.\n"
    },
    {
      "page_number": 29,
      "text": "Page 25\n\n5.7.10 In multiple dwellings provided with a central heating system, the heating unit\n\nshall be located in a separate room having walls, ceilings and doors all of which\nshall have the appropriate fire resistance ratings as required by the Building\nCode.\n\n5.7.12 Heating, ventilating and mechanical systems including factory built stoves,\n\nfireplaces and chimneys, fans, pumps, filtration and other equipment provided to\nsupply heat or other services shall be maintained:\n\n(a) operational in accordance with manufacturers specifications; and\n\n(b) for spaces provided for human habitation, with a heating capacity in\naccordance with the indoor/outdoor design temperatures as required by the\nBuilding Code; and\n\n(c) free of hazards that could cause an accident.\n\n5.7.13 Ventilation systems shall be:\n\n5.8\n\n5.8.1\n\n5.8.2\n\n5.8.3\n\n5.8.4\n\n5.8.5\n\n5.8.6\n\n5.8.7\n\n(a) regularly cleaned and maintained in good repair, working order and in a safe\ncondition at all times; and\n\n(b) in conformance with the requirements of the Building Code; and the Fire\nProtection and Prevention Act and the Fire Code thereunder.\n\nElectrical Service\n\nElectrical installations, including the service capacity of the installations and the\nnumber and distribution of circuits, shall conform to the Ontario Electrical Safety\nCode.\n\nEvery habitable room, except for a kitchen, shall contain at least one electrical\nduplex convenience outlet. Additional duplex convenience outlets shall be\nprovided in accordance with the requirements of the Ontario Electrical Safety\nCode, as amended from time to time.\n\nEvery kitchen shall have at least two electrical duplex convenience outlets, which\nshall be on separate circuits. One such outlet shall be provided over the counter\ntop work surface and one shall be provided at the refrigerator space. In addition,\nan outlet shall be provided in a dining area forming part of a kitchen.\n\nFuses or overload devices shall not exceed limits set by the Ontario Electrical\nSafety Code, as amended from time to time.\n\nAn electrical light fixture shall be installed in every bathroom, toilet room, laundry\nroom, furnace room, kitchen, hallway, stairwell, basement and cellar.\n\nExtension cords shall not be permitted on a permanent basis.\nThe electrical wiring and all electrical fixtures located or used in any building shall\n\nbe installed and maintained in good working order and in conformance with the\nOntario Electrical Safety Code, as amended from time to time.\n"
    },
    {
      "page_number": 30,
      "text": "Page 26\n\n5.8.8 Every dwelling and every dwelling unit shall be wired for and provided with\nelectricity and lighting fixtures shall be installed.\n\n5.8.9 In apartment buildings where a voice communication system exists and or where\na security locking and release system for the entrance is provided and is\ncontrolled from each dwelling unit such systems shall be maintained operational\nand in good repair.\n\n5.9 LIGHT\n\n5.9.1 Every habitable room, except for a kitchen, shall have a window or windows,\nskylights or translucent panels that face directly outside at least .15 metres (0.49\nfeet) above the adjoining finished grade with an unobstructed light transmitting\narea of not less than ten percent of the floor area of such rooms. The glass area\nof a sash door may be considered as a portion of the required window area.\n\n5.9.2 Every public hall and stair and outside entrances in all buildings shall be\nilluminated at all times so as to provide safe passage.\n\n5.9.3 Where a window in a building is located less than 0.91 metres (2.99 feet) from an\nadjacent building, wall, fence or similar structure, such window shall not be\ndeemed to face directly to the outside and shall not be included as contributing to\nthe required minimum window area of the room in which the window is located.\n\n5.10 VENTILATION\n\n5.10.1 Every habitable room shall have an opening or openings for natural ventilation\nfrom the outside. Such opening or openings shall have a minimum aggregate\nunobstructed area of 0.28 square metres (3.01 square feet) and shall be located\nin the exterior walls or through openable parts of skylights.\n\n5.10.2 Openings for natural ventilation may be omitted from a kitchen, living or\nliving-dining room, basement, cellar and crawl space if mechanical ventilation is\nprovided which changes the air once every hour.\n\n5.10.3 Every bathroom or room containing a water closet, shall be provided with an\nopening or openings for natural ventilation located in an exterior wall or through\nopenable parts of skylights except said openings may be omitted where a system\nof mechanical ventilation has been provided, such as an electrical fan with a duct\nleading to outside the dwelling.\n\n5.10.4 All systems of mechanical ventilation or air conditioning shall be maintained in\ngood working order.\n\n5.10.5 Every basement, cellar, and unheated crawl space shall be adequately vented to\nthe outside air by means of screened windows, which can be opened, or by\nlouvres with screened openings.\n"
    },
    {
      "page_number": 31,
      "text": "Page 27\n\n5.10.6 In multiple dwellings, every laundry room, garbage room, corridor, boiler room,\nstorage garage and all parts of the building used by the tenants in common shall\nbe adequately ventilated and where a system of mechanical ventilation is used, it\nshall be maintained in good working condition.\n\n5.10.7 Where insulation is installed so that there is a space between the insulation and\nthe roofing, the roof space shall be ventilated.\n"
    },
    {
      "page_number": 32,
      "text": "Page 28\n\nSECTION 6 _- OCCUPANCY STANDARDS FOR DWELLINGS\n\n6.1\n\n6.2\n\n6.3\n\n6.4\n\n6.5\n\n6.6\n\n6.7\n\n6.8\n\nEvery occupant of a dwelling shall, in that part of the dwelling that he occupies or\ncontrols:\n\n(a) limit the number of occupants thereof to the maximum number\npermitted by this By-law; and\n\n(b) maintain all plumbing, cooking, refrigerating appliances and fixtures and all\nstorage facilities and other equipment therein in a clean, safe and sanitary\ncondition; and\n\n(c) keep all exits clean and unobstructed; and\n(d) maintain the dwelling in a clean, sanitary and safe condition.\n\nA dwelling shall be at all times kept free of rodents, vermin and insects which\nmay be deleterious to safety or health and from conditions which may encourage\ninfestation by such pests.\n\nIn a residence unit, openings in the exterior walls or roof shall be fitted and\nmaintained as to protect all habitable space from water and weather entry and so\nas to make such space reasonably free from drafts.\n\nNo person shall use or permit the use of a non-habitable room in a dwelling for a\nhabitable room purpose.\n\nThe maximum number of occupants in a dwelling or dwelling unit shall not\nexceed one person per 9.28 square metres (100 square feet) of habitable room\nfloor area.\n\nFor the purpose of computing the maximum number of occupants in Sub-section\n6.5 any child under twelve years of age shall be deemed one-half occupant.\n\nNo room in any dwelling shall be used for sleeping purposes unless there is a\nminimum width of 2 metres (6.56 feet) and a minimum floor area of 7 square\nmetres (75.35 square feet). At least one half of the required minimum floor area\nshall have a ceiling height of 2.13 metres (7.0 feet) and no floor area with a\nceiling height of less than 1.37 metres (4.50 feet) shall be counted.\n\nA bedroom shall be a habitable room, and notwithstanding Section 2.1.21, a\nkitchen shall not be used as a bedroom.\n"
    },
    {
      "page_number": 33,
      "text": "6.9\n\n6.10\n\n6.11\n\n6.12\n\n6.13\n\nPage 29\n\nFor the purpose of computing the habitable room space in Sub-section 6.7, the\nfloor area under a ceiling, which is less than 2.13 metres (7.0 feet) high, shall not\nbe counted. If a finished ceiling is not applied to the underside of the joists, then\nthe bottom of the joists shall be deemed to be a ceiling for the purpose of\nestablishing this measurement.\n\nThe minimum floor area of a room used by two or more persons for sleeping\nshall be 3.72 square metres (40 square feet) for each person so using the room.\n\nFood shall not be stored or prepared in a room that contains a water closet.\nEvery room in which meals are prepared shall have a sink.\n\nNo portion of a building shall be occupied if it does not meet the requirements of\nthis By-law.\n"
    },
    {
      "page_number": 34,
      "text": "Page 30\n\nSECTION 7\n\nADMINISTRATION AND ENFORCEMENT\n\nThis By-Law shall apply to all property within the limits of the Municipality.\n\nOFFICERS\n\n7A\n\nThe Council of the Municipality shall appoint a Property Standards Officer(s) [herein\nreferred to as a \"Property Standards Officer\"] to be responsible for the administration\nand enforcement of this By-Law.\n\nPROPERTY STANDARDS COMMITTEE\n\n7.2\n\n7.3\n\nCouncil shall appoint at large, by a Resolution, (or By-Law) of Council no fewer than\nthree (3) persons of the Municipality to the Property Standards Committee for a term of\noffice concurrent with Council.\n\nEvery person who initiates an appeal of an Order made under Section 15.2(2) of the\nBuilding Code Act, S.O. 1992, c23, shall submit a notice of Appeal in the time frame and\nthe manner as prescribed in section 15.3(1) of the Act. All Notices of Appeal shall be\naccompanied by a non-refundable payment of one hundred ($100.00) dollars.\n\nOFFENCE AND PENALTY PROVISIONS\n\n15\n\n7.6\n\n“7\n\n78\n\nAny property that does not meet the standards set by this Bylaw shall be repaired\nand maintained to conform with the standards set by this Bylaw or the site shall\nbe cleared of all buildings, structures, debris or refuse and left in graded and\nleveled condition.\n\nAn owner who fails to comply with an order issued by a Property Standards\nOfficer \\Provincial Offences Officer is guilty of an offence and upon conviction is\nsubject to a fine/penalty as provided by the Building Code Act, 1992, S.O. 1992,\nc.23 as amended from time to time.\n\nIf this Bylaw is contravened and a conviction entered, the Court in which the\nconviction was entered or any Court of competent jurisdiction may, in addition to\nany other remedy and to any penalty that is imposed, make an order prohibiting\nthe continuation or repetition of the offence by the person convicted.\n\nIf the owner fails to do the remedial or maintenance work necessary to meet the\nrequirements of this Bylaw or an order issued pursuant to this Bylaw the\nMunicipality may do the required remedial or maintenance work at the owner's\nexpense and the Municipality may recover the costs of doing such work by action\nor by adding the cost to the tax roll and collecting the costs in the same manner\nas property taxes. The aforesaid costs shall include an administrative fee of\n$150.00 plus $50.00 for each inspection that is made following the issuance of\nthe City Action Letter, and interest calculated on the costs and the administrative\nfee at the rate of 15%, calculated for the period commencing on the day the\n"
    },
    {
      "page_number": 35,
      "text": "Page 31\n\nMunicipality incurs the costs and ending on the day the costs, including interest,\nare paid in full.\n\n7.9 The Municipality shall have a lien on the owner's land for the amount spent on\nthe repair or demolition under an order issued by a Property Standards\nOfficer/Property Offences Officer and the amount shall have priority lien status as\ndescribed in section 1 of the Municipal Act, 2001 as amended from time to time.\n\nVALIDITY\n\n7.9 Where a provision of this By-Law conflicts with the provision of another By-Law in\nforce within the Municipality, the provisions that establish the higher standards to\nprotect the health, safety and welfare of the general public shall prevail.\n"
    },
    {
      "page_number": 36,
      "text": "Page 32\n\nNOTICE OF APPEAL\n\nTO PROPERTY STANDARDS COMMITTEE\nPursuant to Section 15.3-(1) of the Ontario Building Code Act\n\nDate\n\nTo the Secretary\n\nProperty Standards Committee\nCorporation of the City of Belleville\n169 Front Street\n\nBELLEVILLE, Ontario\n\nK8N 2Y8\n\nRE: Order to Remedy Violation of Standards of\nMaintenance and Occupancy at:\n\n(Description and Location of Property in Violation)\nTAKE NOTICE of the appeal of the undersigned to the Property Standards Committee\n\nbecause of dissatisfaction with the above referenced Order to Remedy Violation of\nStandards of Maintenance and Occupancy served upon the undersigned on\n\nName (Owner or Agent)\nAddress\n\nTelephone Number\n\nAPPEAL TO PROPERTY STANDARDS COMMITTEE\n\nAn owner or occupant who has been served an order and is not satisfied with the\nterms or conditions of the order may appeal to the Property Standards Committee\nby sending a NOTICE OF APPEAL, along with a fee in the amount of $100.00\npayable to the City of Belleville, by registered mail to the Secretary of the\nProperty Standards Committee within fourteen (14) days after service of the\norder, and, in the event that no appeal is taken, the order shall be deemed to have\nbeen confirmed.\n"
    },
    {
      "page_number": 37,
      "text": "Page 33\n\n\"REGISTERED MAIL\" ORDER OF THE\nPROPERTY STANDARDS OFFICER\nOF THE CITY OF BELLEVILLE\n\nDear\n\nRE: Belleville, Ontario\n\nYour property described above and in Schedule “A” does not conform to the standards\nprescribed in the City of Belleville Property Standards By-Law 2012-79 as amended, particulars\nof which are as set out in Schedule “B” attached hereto.\n\nIT IS HEREBY ORDERED:\n\n1. Your property be repaired and maintained in accordance with the requirements in Schedule\n“B”, such work to be completed no later than fourteen (14) days after the date of this Order\nand if such repairs are not carried out within such time, or the property is not maintained as\nrequired, the City of Belleville may carry out the repairs and maintenance work at your\nexpense. Should further repairs and maintenance work be necessary at a later time as a\nresult of your failure to maintain and keep your property in repair in accordance with the\nrequirements in Schedule “B”, the City of Belleville, without further notice to you, may carry\nout such further repairs and maintenance work at your expense.\n\nYou may appeal this Order to the Property Standards Committee by sending Notice of Appeal,\naccompanied by a non-refundable cheque in the amount of One Hundred Dollars ($100.00)\npayable to the City of Belleville, by registered mail to the Secretary of the Property Standards\nCommittee by the day of ; .\n\nDATED AT THE CITY OF BELLEVILLE THIS DAY OF.\n\nPROPERTY STANDARDS OFFICER\n\nAttachment\n"
    },
    {
      "page_number": 38,
      "text": "Page 34\n\nSCHEDULE “A”\n\nIn the City of Belleville, County of Hastings,\n\nPlan , Lot , Part Lot\n\nRegistered Plan , Lot , Parts\n\nMunicipally known as\n\nSCHEDULE “B”\n"
    },
    {
      "page_number": 39,
      "text": "Page 35\n\n* INFORMAL NOTICE\n\nDear\n\nRE:\n\nBe advised that on an inspection of your property, as noted above, revealed\ncertain violations of the Municipality's Property Standards By-Law No. 2012-79.\n\nSchedule “A”, attached hereto, sets out the work required to remedy such violation(s)\nand to bring the property into compliance with the By-Law.\n\nBe advised that By-Law No. 2012-79 gives the Municipality the authority to\nissue an ORDER TO COMPLY pursuant to Section 15.2-(2), Ontario Building Code\nAct 1992. It is desired that you comply with this informal notice so that the\naforementioned procedural step will not be necessary.\n\nA re-inspection of this property will take place on or about to ascertain\ncompliance. If compliance cannot be gained by this date, please contact the undersigned as\nsoon as possible. My office hours are 8:30 - 9:30 a.m. and 1:00 - 2:00 p.m. Monday through\nFriday. My direct telephone line is 967-3200 extension 3233.\n\nShould you require further information pertaining to this matter, please do not hesitate to\ncontact the undersigned during normal business hours.\n\nYours truly\n\nPROPERTY STANDARDS OFFICER\n\n“NOTE: AN INFORMAL NOTICE IS NOT REQUIRED UNDER PROVINCIAL\nSTATUTE. HOWEVER, IT MAY BE GIVEN AS A COURTESY.\n"
    },
    {
      "page_number": 40,
      "text": "Page 36\n\nSCHEDULE “A”\n"
    },
    {
      "page_number": 41,
      "text": "Page 37\n\nORDER TO REMEDY VIOLATION OF\n\n\"REGISTERED MAIL\" STANDARDS OF MAINTENANCE\nAND OCCUPANCY\nDear Sir/Madam:\nRE:\nWHEREAS on you were served with an Informal NOTICE that required\n\nyou to remedy certain violations of standards of maintenance and occupancy at your property,\ndescribed above.\n\nAND WHEREAS you have failed to remedy the noted violation(s) as set out in Schedule “B”,\nattached hereto and which forms part of this ORDER.\n\nTHEREFORE, IT IS HEREBY CHARGED THAT the violation(s) as set out in Schedule\n“B” be remedied and the property brought into a condition of compliance with the\nprescribed standards as set out in the Property Standards By-Law No.2012-79 on or\nbefore .\n\nTAKE NOTICE that if such violations are not remedied within the time specified\nin this order, the Municipality may correct such violations at the expense of the owner.\nShould further repairs and maintenance work be necessary at a later time as a result of\nyour failure to maintain and keep your property in repair in accordance with the\nrequirements of Schedule “B”, the City of Belleville, without further notice to you, may\ncarry out such further repairs and maintenance work at your expense.\n\nAPPEAL TO PROPERTY STANDARDS COMMITTEE\n\nAn owner or occupant who has been served an order and is not satisfied with the terms\nor conditions of the order may appeal to the Property Standards Committee by sending\na NOTICE OF APPEAL, along with a fee in the amount of $100.00 payable to the City\nof Belleville, by registered mail to the Secretary of the Property Standards Committee\nwithin fourteen (14) days after service of the order, and, in the event that no appeal is\ntaken, the order shall be deemed to have been confirmed.\n\nFINAL DATE OF APPEAL:\n\nPROPERTY STANDARDS OFFICER\n"
    },
    {
      "page_number": 42,
      "text": "Page 38\n\nSCHEDULE “A”\n\nIn the City of Belleville, County of Hastings\n\n, Part Lot\n\nRegistered Plan , Part\n\nMunicipally known as\n\nSCHEDULE “B”\n"
    },
    {
      "page_number": 43,
      "text": "Page 39\n\nCITY ACTION\n\nDate\n\nDear.\n\nRE: Order of the Property Standards Officer\n\nDated\n\nPlease be advised this office is now prepared to take whatever steps necessary\nto satisfy the captioned “Order”. All costs and Administration fees incurred will be\ncollected as taxes.\n\nIf you wish to undertake the required remedial action yourself contact the\nundersigned no later than . If we do not hear from you by this date\nthe Municipality will proceed to complete the work and add all costs to your Municipal\nTax Bill.\n\nSincerely,\n\nProperty Standards Officer\n"
    },
    {
      "page_number": 44,
      "text": "Page 40\n\nTHAT By-Law Number 2000-45 and all other By-Laws or parts thereof\ninconsistent herewith be and the same are hereby rescinded.\n\nTHIS BY-LAW SHALL COME INTO FORCE AND TAKE EFFECT IMMEDIATELY ON\nAND AFTER THE PASSING THEREOF.\n\nRead a first time this 14\"\" day of May, 2012.\nRead a second time this 14'\" day of May, 2012.\nRead a third time and finally passed this 14' day of May, 2012.\n\nNEIL ELLIS MAYOR\n\nJULIE ORAM CITY CLERK\n"
    }
  ]
}