{
  "file_name": "BL 2025-118 Open Air Burning.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "The Corporation of the City of Belleville\nBy-law Number 2025-118\n\nA By-law to Regulate “Open Air Burning” in the City of Belleville\nand Repeal By-law Number 2021-12\n\n(Open Air Burning By-law)\n\nWhereas Section 10(2) of the Municipal Act, 2001, SO. 2001, as amended, c.25, a\nsingle-tier municipality may pass by-laws respecting health, safety and well-being of\npersons;\n\nAnd Whereas Section 7.1(1)(b) of the Fire Protection and Prevention Act, 1997, S.O.\n1997, c.4, as amended, authorizes the council of a municipality to pass by-laws\nregulating the setting of open-air fires, including establishing the times during which\nopen air fires may be set;\n\nAnd Whereas the regulation of open-air burning is important for the health, safety\nand well-being of the inhabitants of the municipality;\n\nAnd Whereas the Council of The Corporation of the City of Belleville deems It\nadvisable to enact such a by-law and repeal By-law 2021-12;\n\nNow Therefore the Council of The Corporation of the City of Belleville enacts as\nfollows:\n\nPart 1 — Interpretation\n\nDefinitions\n1. In this Bylaw:\n\n“Adverse Effect” means impairment of the safety of any person or their ability to\nenjoy their property or premises and or damage to property;\n“Agricultural Fire\" means an open-air fire where materials to be burned that\ndoes not exceed 5 metres in height, 5 metres in width and 5 metres in length and\nwhere the open-air fire is set and maintained solely for the purposes of burning\nwood, tree limbs and branches;\n“Approved” means approved by the “Chief Fire Official’ as defined in section\n1.2.1.2 on Ontario Regulation 213/07 (Ontario Fire Code), as amended, made\nunder the Fire Protection and Prevention Act 1997, S.O. 1997, c. 4 as amended;\n\n“Approval” means written authorization from the Chief Fire Official or designate.\n\nPage 1 of 15\n\n"
    },
    {
      "page_number": 2,
      "text": "\"Approved Device” means a device/container that is approved or listed by a\nrecognized national or international testing/certification organization that is\ndesigned and approved to contain an open-air fire and or as approved by the Fire\nChief or designate to contain an open-air fire;\n\n\"Barbecue\" means a portable or fixed device designed and\nintended solely for the cooking of food in the open air but does not\nInclude outdoor fireplaces or campfire;\n\n\"Balcony\" means a platform projecting from a wall of a multiple unit\ndwelling, surrounded by a railing or balustrade;\n\n\"Brush fire\" means an open-air fire where the material to be burned does not\nexceed 3 metres in height, 3 metres in width and 3 metres in length and where\nthe open-air fire is set and maintained solely for the purposes of burning wood.\ntree limbs and branches;\n\n“Burn Barrel” means a noncombustible or combustible barrel of any size\ncommonly used to burn debris and other waste materials.\n\n“Burn Permit” means a permit that is issued in accordance with this Bylaw,\nauthorizing a “Open Air Burning, Brush Fire, Agricultural Fire or Specific Use\nFire”;\n\n\"By-law Enforcement Officer\" means a person duly appointed by the\nCouncil of the City of Belleville to enforce by-laws;\n\n“Campfire” means an open-air fire that is set and maintained solely for\nthe purpose of cooking food. providing warmth and/or recreational\nenjoyment and is a maximum size of 1 cubic meter;\n\n“Cooking Device” means a non-combustible device designed for and\nused solely for the cooking of food;\n\n“Cooking Fire” means an Open Air fire used for the purpose of cooking food on\na grill but does not include a manufactured barbeque.\n\n“Dangerous condition\" means any condition as determined by the\nFire Chief that increases the risk of the spread of a fire or is averse\nto public safety;\n\n“Farming business\" means a farming business as defined in the\nFarm Registration and Farm Organizations Funding Act, S.O.\n1993, as amended;\n\n“Fire Chief” means the Chief of the Fire and Emergency Services Division of the\nCity of Belleville, or their designate.\n\nPage 2 of 15\n\n"
    },
    {
      "page_number": 3,
      "text": "“Firefighter” means the Fire Chief and any other person employed in, or\nappointed to, the Fire and Emergency Services Division of the City of Belleville,\nand assigned to undertake fire protection services.\n\n“Flying/floating lanterns” means a combustible material warm air\nfloating device which uses an open flame for floatation;\n\n\"EPPA\" means the Fire Protection and Prevention Act, S.O. 1997, c4,\nas amended, and the regulations enacted thereunder as amended\nfrom time to time. or any Act or Regulation enacted in substation\ntherefore;\n\n\"Household waste” means combustible material such as perishable foods,\nplastics, paints, oils, solvents. rubber. insulation, batteries, acids, polystyrenes\n(Styrofoam), pressure treated or painted lumber, tires, upholstered furniture,\nsynthetic fabrics, diapers and hazardous waste as defined in the Environmental\nProtection Act and all other similar and like materials;\n\n\"Highway\" means a common and public highway and includes any\nbridge, trestle. viaduct or other structure forming part of the highway\nand, except as otherwise provided, Includes a portion of the highway;\n\n“1_ot line\" means any boundary of a lot or the vertical projection thereof;\n\n“Maintain” means to allow an open-air fire to continue to burn and \"maintained\"\nand \"maintaining\" have a corresponding meaning;\n\n“Material to be burned\" means total volume of materials contained in\nthe fire;\n\n\"Municipality\" means The Corporation of the City of Belleville or the\ngeographic area of the Municipality of the Corporation of the City of Belleville;\n\n“Non-approved Device\" means a container that is not listed by a recognized\nnational or international testing/certification organization and designed and\napproved to contain an open-air fire and can include but are not limited to drums,\nbarrels, oil fanks, gas tanks, wheel rims;\n\n“Nuisance” means excessive smoke, smell, airborne sparks or embers that is\nlikely to disturb others, or that is likely to reduce visibility on roads in the vicinity\nof the Open Air Burning;\n\n“Open Air Burning” means the setting of a fire in the open air for the purpose of\nburning grass, leaves, petroleum products, household garbage, plastics, rubber,\npainted or pressure treated lumber or any other rubbish and combustible material\nand includes burning in barrels, drums, pits, outdoor fireplaces either masonry,\nmetal, or clay pot type, but does not include small confined fires, or fires used to\ncook on a grill or barbecue that are supervised at all times;\n\nPage 3 of 15\n\n"
    },
    {
      "page_number": 4,
      "text": "“Qutdoor Appliance” means a manufactured non-combustible solid fuel burning\ndevice that:\n(a) is not contained within a building;\n(b) is wholly or partly enclosed; and\n(c) has a chamber intended to contain combustion, and may include a\nstack to direct the flow of air or combustion gases from the appliance\nand may include, but is not limited to, appliances such as stoves,\nfurnaces, boilers.\n\n“Outdoor Fireplace” means a non-combustible, wholly-enclosed or partially\nenclosed container designed to hold a fire for decorative purposes and the size\nof which is not larger than 1 metre in any direction, and may include, but is not\nlimited to, chimineas or fire bowl, and which is not fueled by natural gas or\npropane.\n\n“Partial Burn Ban” means a period of time which the Fire Chief\ndeclares open-air burning restricted to the use of campfires, outdoor\nfireplaces and cooking devices\n\n“Person\" means any individual, association, firm, partnership,\ncorporation, agent or trustee and the heirs, executors, or other legal\nrepresentatives of a person to whom the context can apply according\nto law;\n\n\"Portable appliance\" means a device to convert fuel into energy, and includes\nall components, controls, wiring and piping for outdoor use and installed in\naccordance with the manufacturer's instructions;\n\n“Prohibited Materials\" includes wet materials, green timber, household waste,\nrubber or rubber products, plastic or plastic products, pressure treated or painted\nlumber and waste petroleum products and any material or materials which are\nprohibited by the Environmental Protection Act, R.S.O. 1990, c.E.19, as\namended;\n\n“Prohibited Areas” are those areas within the Corporation of the City of\nBelleville as outlined in Schedule 1 of this By-Law;\n\n“Property” includes a building or structure or part of a building or structure, and\nincludes the lands appurtenant thereto and all mobile homes, mobile buildings or\nmobile structures and vacant land:\n\n“Registered owner\" includes the person who is shown as owner ofa\nproperty in the records of the Land Registry Office, a trustee acting\non behalf of the registered owner, the estate trustee of a registered\nowner, a person with a leasehold interest In the land and an\nauthorized representative of a corporate registered owner;\n\n“Smog Alert” means an alert issued by the Ministry of the Environment with\nrespect to air quality;\n\nPage 4 of 15\n\n"
    },
    {
      "page_number": 5,
      "text": "“Spark Screen” means a metal screen or shield placed over —\nabove cooking or campfire to restrict sparks or embers;\n\n\"Total Burn Ban\" means a period of time during which the Fire Chief\ndeclares a ban on any open-air burning, including cooking fires and\ncampfires.\n\n“Wind Speed” means the wind speed for Belleville as reported on the\nEnvironment Canada website.\n\nPart 2 — Application\n\nApplication\n\n2. This By-law applies within the geographical boundaries of The Corporation of the\nCity of Belleville.\n\nNon-Application:\n\n3. This By-law does not apply to a person who sets a fire:\n\na) Inan incinerator operated in accordance with the Certificate of Approval\nissued pursuant to the Environmental Protection Act, R.S.O. 1990, c.E.1g\nand Regulations thereunder;\n\nb) Ina device which has been installed outside of a building which meets\neach of the conditions;\n\ni. The device is designed for and used as a source of heat or power\nfor the building or Is designed for and used for a purpose ancillary\nto a manufacturing process;\n\nii. the certification of the device is produced upon request of a By-law\nEnforcement Officer or Firefighter; and\n\niii. | the device Is in good working order;\n\nListed gas appliance\n\nNatural gas or propane fueled fire pits listed by a recognized and authorized national\ntesting laboratory are permitted in all areas of the municipality and do not require a burn\npermit.\n\nEffect of other legislation\n\n4. Nothing in this By-law shall be deemed to authorize any fire, burning or other act |\nthat is in contravention of the Environmental Protection Act R.S.O. 1990, c.E.19,\nthe Forest Fires Prevention Act, R.S.O. 1990, c.F.24, the Fire Protection and\nPrevention Act, S.O. 1997, c4, or other federal or provincial statute, or any\nRegulation made thereunder. In the event of any conflict between the provisions }\nof the By-law and said Act or Acts or Regulations, the said Act or Acts or\nRegulations made thereunder shall govern. In the event of any conflict between :\nthe provisions of the By-law and any other municipal by-law, the provision that '\n\nPage 5 of 15\n\n"
    },
    {
      "page_number": 6,
      "text": "establishes the higher standard to protect the health, safety and welfare of the\ngeneral public shall prevail.\n\nProhibition - Setting Fires\n\n5. Except as provided in Section 4, no person shall set a fire in the Municipality\nunless:\na) The fire is in accordance with all the conditions and permit requirements\nincluded in this By-Law;\nb) The fire set in an “approved device” and does not constitute a health or\nenvironmental concern to any resident or business;\n\nTraining or Demonstration Fires\n\n6. (a) For the purpose of the By-law, a training or demonstration fire is a fire which\nis set in the Municipality for the purpose of demonstrating firefighting equipment\nor as a training exercise;\n\n(b) The Fire Chief is authorized to give written consent for the setting of a\ndemonstration or training fire.\n\nPermitted Fire\n\n7. For the purposes of this By-law, a permitted fire is a fire that complies with all\nRegulations and conditions as described within this by-Law.\n\nGeneral Prohibitions\n\n8.\na) No person shall set or maintain an open-air fire that is in contravention with\n\nany part of this By-Law;\n\nb) No person shall set or maintain any open-air “Brush Fire’ within any of the\nidentified area in Schedule 1 Zone A or B of this By-Law unless approved;\n\nc) No person shall set or maintain a fire in a burn barrel or other non- approved\ncontainer within the city of Belleville unless approved;\n\nd) No person shall set or burn grass;\n\ne) No person shall burn prohibited materials or household waste in an open-air\nfire;\n\nf) No person shall use a flying/fioating lantern as defined;\n\ng) No person shall use gasoline, diesel fuel or any other type of hydrocarbon\nfuel to start a fire. ;\n\nh) No person shall set or maintain any open-air fires other than a permitted\ncampfire as defined and the use of cooking devices as defined, when a partial\nburn ban on open-air fires has been issued by the Fire Chief or designate;\n\ni) No person shall set or maintain any open-air fire when a total burn ban on\nopen-air fires has been issued by the Fire Chief or designate without\napproval;\n\n~~\n\nPage 6 of 15\n\n"
    },
    {
      "page_number": 7,
      "text": "Consent of Registered Owner\n\n9. No person shall set or maintain a permitted fire on any property in the\nMunicipality unless:\n\na) The person setting or maintaining the fire is the registered owner or the\nauthorized designate of the property on which the fire is set,\n\nb) The person setting or maintaining the fire has the written consent of at least\none registered owner of the property on which the fire Is set.\n\nProhibited Conditions\n\n10.No person shail set or maintain a permitted fire in the Municipality in a\nlocation or in a condition likely to cause or result in:\n\na) a decrease in visibility on any highway from smoke;\n\nb) cause a nuisance, inconvenience or irritation to others from smoke or fumes\nto a neighboring property, resident or business;\n\nc) The spread of the fire due to the proximity of any combustible materials;\n\nd) Wind driven flames from high wind conditions {Wind speed not to exceed 24\nkilometers per hour (kph)}\n\nPart 4— Prohibition on Specific Types of Fires\n\nCampfires\n\n11.No person shall set or maintain a campfire unless all of the following conditions\nare met:\n\n(a) No person shall conduct or permit open air burning without obtaining a\npermit as outlined in Part 5\n\n(b) | The campfire shall occur between the hours of 5pm and 11 pm;\n\n(c) | The campfire is contained within an area of noncombustible metal,\nmasonry. ceramic or stone or is contained within a pit In the ground and\nhas a maximum diameter or 60 centimeters and is located in Zone A of\nschedule 1;\n\n(d) The material burned in the campfire is clean, dry, untreated wood ina\nsingle pile that is less than 60 centimeters in height, width and length;\n\n(e) The campfire is located not less than six (6) metres from any building,\nhedge, fence, overhead wiring or other combustible material and be\nlocated 15 metres from the lot line;\n\n(f) The person tending the campfire has tools or water adequate to contain\nand if required extinguish the fire within the campfire area;\n\n(g) The fire is not set or maintained during a period identified as having a\n“Total Burn Ban’ in place.\n\nPage 7 of 15\n\n"
    },
    {
      "page_number": 8,
      "text": "Fire in an Outdoor Fireplace / Burning Appliance\n\n12.No person shall set or maintain a fire in an outdoor fireplace / burning appliance\nunless all of the following conditions are met:\n\na)\nb)\nc)\n)\ne)\nf)\n\ng)\n\nh)\n\nPermit\n\nNo person shall conduct open air burning without obtaining a permit as\noutlined in Part 5\n\nThe outdoor fireplace /burning appliance is constructed of non-combustible\nmetal, masonry, ceramic or stone on grade;\n\nThe outdoor fireplace is not located on a balcony or deck;\n\nThe outdoor fireplace is not located on any combustible surface;\n\nThe outdoor fireplace is in good working order;\n\nThe fire in the outdoor fireplace/ burning appliance shall occur between the\nhours of 5 pm and 11 pm;\n\nThe outdoor fireplace / burning appliance is located not less than three (3)\nmetres from any structure, overhead wiring or other combustible material and\nbe three (3) meters from the lot line;\n\nThe person burns only clean, dry, untreated wood or commercial charcoal in\nthe outdoor fireplace;\n\nAny fire in an outdoor fireplace within the areas identified in Zone A or B of\nSchedule 1, the appliance or fireplace must be equipped with a spark screen\nor cover with a maximum opening of 13mm, and flames shall not extend more\nthan 15 cm through and above the spark arrestor;\n\nThe fire is not set or maintained during a period identified as having a “Total\nBurn Ban” in place;\n\nand Specific Approval Required for Brush, Agricultural and\n\nSpecial Events\n\nBrush Fire\n\n13.No person shall set or maintain a brush fire unless they ensure all the following\nconditions are met:\n\na)\n\nc)\nqd)\n\ne)\nf)\n\nNo person shall conduct a brush fire without obtaining a permit as outlined in\nPart 5;\n\nb) The fire is set and maintained at no less than twenty (20) metres from any\n\nbuilding, hedge, fence, overhead wire or other combustible material, or lot\n\nline;\nThe pile of materials to be burned in the fire do not exceed three (3) metres in\nlength, three (3) metres in width, and three (3) metres in height;\nThey have the necessary means immediately available at the site of the fire to\npermit them to extinguish the fire, to limit its spread, and if necessary, to\nsummon Belleville Fire & Emergency Services;\nBrush fires are only permitted in Zone A as identified in Schedule 1 of this By-\nLaw;\nThat the person present and in control of the Brush Fire is the person\nidentified in the Burn Permit\n\nPage 8 of 15\n\ni\nHl\n{\n\n"
    },
    {
      "page_number": 9,
      "text": "Agricultural Fire\n\n14.No person shall set or maintain an agricultural fire unless they apply in writing to\nthe Fire Chief for the Agricultural required burning and if they ensure all of the\nfollowing conditions are met:\n\na) No person shall conduct a agricultural fire without obtaining a permit as\noutlined in Part 5\n\nb) Property owners shall have the area where they plan to burn inspected. No\nexceptions. Contact the fire department 3 business days prior to burning to\narrange for an inspection at 613-962-2010\n\nc) The fire is set and maintained at no less than Fifty (50) metres, from any\nbuilding, hedge, fence, overhead wire or other combustible material, or lot\nline;\n\nd) The materials to be burned in the fire do not exceed five (5) metres in length,\nfive (5) metres in width and five (5) metres in height with a maximum of four\n(4) piles burning simultaneously unless otherwise approved;\n\ne) The agricultural fire shall occur between sunrise and sunset;\n\nf) The person setting the fire has the necessary means immediately available at\nthe site of the fire to permit them to extinguish the fire, to limit its spread, and\nif necessary, summon Belleville Fire & Emergency Services;\n\ng) Agricultural Fires are only permitted in area identified as zone A in Schedule 1\nof this By-Law;\n\nh) Authorization approval issued is valid only for the time(s), conditions and\nday(s) set out as approved by the Chief Fire Official and has issued\nAuthorization to Burn Permit\n\ni) That the person present and in control of the Agricultural Fire is the person\nidentified in the Authorization.\n\nSpecific Event\n\n15.A community not-for-profit organization, school, religious Institution or a\nresident may apply in writing to the Fire Chief for a specific event permit to\nconduct open air fires for cultural, religious or recreational specific event and if\nthey ensure all of the following conditions are met:\n\na) No person shall conduct a specific event fire without obtaining a permit as\noutlined in Part 5\n\nb) All conditions as set out on the permit and approval are followed;\n\nc) The person or organization issued the permit has the necessary means\nimmediately available at the site of the permit to extinguish the fire or to limit\nits spread and if necessary, summon Belleville Fire & Emergency Services;\n\nd) Authorization approval issued is valid only for the time(s) and day(s) set out\non the issued Authorization to Burn;\n\ne) That the person present and in control of the Specific Event Fire is the person\nidentified in the Burn Permit and/or the authorization from the Chief Fire\nOfficial; ‘\n\nPage 9 of 15\n\n"
    },
    {
      "page_number": 10,
      "text": "Fire in a Cooking Device\n\n16.No person shall set or maintain a fire in a cooking device unless they ensure all\nthe following conditions are met:\n\nThe cooking device:\n\na) Is not located on a balcony of a multi-unit residential building;\n\nb) Is located at least one (1) metre from any building or structure; and is in good\nworking order, and/or the clearances labelled on the device can be met;\n\nc) The person burns only commercial charcoal, compressed gas or wood in the\ncooking device, as is appropriate for the design of that cooking device.\n\nHeating During Construction\n\n17.No person may set or maintain a fire in a portable appliance during a\nconstruction or maintenance process unless they ensure all the following\nconditions are met:\n\na) The portable appliance is designed for that purpose;\n\nb) The portable appliance is only used for that purpose;\n\nc) The portable appliance is used in accordance with manufacturer's\ninstructions;\n\nd) The portable appliance is in good working order;\n\ne) Burn Barrels or drums are not permitted\n\nRequest for a Burn Permit\n\n18.Any person eighteen (18) years of age or older may apply for an open air fire\nburn permit prior to the proposed date of any open-air burning;\n\na) The applicant for a burn permit shall provide all the information and such\nother documentation or materials as may be requested by City of Belleville\nprior to obtaining the burn permit.\n\nIssuing of a Burn Permit\n\n19. The Fire Chief/designate shall review the request for a burn permit and the\ndocumentation or materials filed with the request and shall:\n\na) Approve the request and issue the burn permit to the applicant if all fees are\npaid;\n\nb) conditionally approve the request subject to such restrictions, regulations or\nconditions as the Fire Chief in their sole and absolute discretion consider\nadvisable if all fees are paid;\n\nc) May refuse to approve the request;\n\nd) Where the Fire Chief refuses to approve a request for an open air burn\npermit, the Fire Chief shall advise the applicant that the request has been\nrefused;\n\n;\nt\ni\ni\ni\n\nPage 10 of 15\n\n"
    },
    {
      "page_number": 11,
      "text": "Part 5 - Burn Permit\n\n20.Burn Permits\n\na) Any permit issued under this by-law is personal to the permit holder and shall not\nbe transferred or assigned;\n\nb) A permit shall be valid only for the period of time for which it was issued and shall\nexpire on December 31* or in the manner specified in the authorization;\n\nc) The person who was issued the burn permit is responsible for any costs\nassociated with Belleville Fire & Emergency Services being required to attend to\nextinguish or control the fire;\n\nPermit Holder\n\n21.No person holding a burn permit or specific event permit shall set or maintain a\nfire under the authority of the authorization, except in accordance with the terms\nand conditions of authorization/permit and this by-law:\n\nRevocation of Burn Permit\n\n22 The Fire Chief may, at any time, in their sole and absolute discretion, revoke any\nburn permit, if the Fire Chief reasonably believes that:\n\na) Any of the information provided with the request or supporting documentation\n_ or materials are not accurate;\nb) A term or condition of the bum permit is not being observed;\nc) The open air burning causes, or has potential to cause a hazard whether it be\nfrom smoke or fire to persons, property or the environment.\n\nPart 6 — Approved Devices\n23 Any propane or natural gas outdoor fireplace or cooking appliance is considered\nan approved device as long as it is operated within the manufacture’s\nspecifications and has the approved listing of a testing and certification\norganization;\n\nPart 7 —- Enforcement and Cost Recovery\n\nEnforcement\n\n24 No person shall obstruct, hinder or in any way interfere with any person\ndesignated to enforce this By-law:\n\n25 A person is guilty of an offence if the person:\n(a) furnishes false information in an application for a Permit under this By-law;\n(b) contravenes any provision of this By-law; or\n(c) contravenes an order issued under section 15.\n\nPage 11 of 15\n\n"
    },
    {
      "page_number": 12,
      "text": "26\n\n27\n\n28\n\nA person who is convicted of an offence under this by-law is liable to a fine and\npenalty as pursuant to the provisions of the Provincial Offences Act, R.S.O.\n1990, c.P.33.\n\nA Permit issued under this By-law may be revoked by Fire Chief if the Permit\nholder fails to comply with the requirements of the Permit or any other provision\nof this By-law.\n\nIn accordance with section 7.1 of the FPPA, a Firefighter may enter upon land\nand into structures at any reasonable time to inspect the land and structures to\ndetermine whether this by-law is being complied with.\n\nFor the purposes of an inspection pursuant to s. 28 above, an Officer may:\n\n(1) require the production for inspection of documents or things relevant to the\ninspection;\n\n(2) inspect and remove documents or things relevant to the inspection for the\npurpose of making copies or extracts;\n\n(3) require information from any person concerning a matter related to the\ninspection; and\n\n(4) alone or in conjunction with a person possessing special or expert\nknowledge, make examinations or take tests, samples or photographs\nnecessary for the purposes of the inspection.\n\n(5) If an Officer is satisfied that this by-law has been contravened, the Officer\nmay requiring the person contravening the by-law to immediately\nextinguish the fire or take action to extinguish the fire.\n\nRight of Entry\n\n29\n\n30\n\nUpon producing proper identification, a By-law Enforcement Officer or the\nFire Chief or their representative may, at all reasonable times enter upon\n\nand inspect any property to determine if there Is a contravention of this by-law\nand to enforce or carry into effect the by-law.\n\nA Firefighter may order a fire to be extinguished immediately if the fire:\n\n(1) _ is not set in compliance with this By-law;\n\n(2) is determined upon inspection by the Firefighter to constitute a safety\nhazard or concern; or\n\n(3) is not set in compliance with a Permit.\n\nPage 12 of 15\n\n"
    },
    {
      "page_number": 13,
      "text": "Cost to Extinguish Fire\n\n31 Any costs and expenses of any action by the Municipality with respect to\ncontrolling or extinguishing a fire that is caused by, or results from, the conduct of\na person acting contrary to this by-law, or is caused by or results from a person\ndisobeying or refusing or neglecting to carry out any of the provisions of this by-\nlaw, will be assessed in accordance with the City of Belleville Fees Bylaw at the\ntime of the infraction, and are payable by that person to the Corporation of the\nCity of Belleville on the date specified in the request for payment and if not paid\non the date specified, such costs and expenses together with costs of collection,\nincluding legal fees and disbursements, are recoverable as a debt due to the\nMunicipality by any remedy or procedure available to the Municipality by law and\nmay be recovered in a like manner as taxes;\n\nCivil Action\n\n32 Nothing in this by-law affects or shall be held to limit or interfere with the right\nof any person to bring and maintain a civil action for damages occasioned by\nfire.\n\nOffence\n\n33 Every person who contravenes any of the provisions of this By-law is\nguilty of an offence and upon conviction is liable to a fine as provided in the\nProvincial Offences Act, R.S.O. 1990, c.P.33 as amended or as assessed in\naccordance with the City of Belleville Fees Bylaw\n\nConflict with Other By-laws\n\n34 That By-law 2021-12 is hereby repealed and in the event of any conflict\nbetween the provisions of this by-law and any other by-law regarding the\nregulation of open air fires the provisions of this by-law shall prevail, but\nnothing in this by-law shall invalidate the enforceability of other provisions of\nthose by-laws.\n\n35 The Clerk of the City of Belleville is hereby authorized to make any minor\nmodifications or corrections of an administrative, numerical, grammatical,\nsemantically or descriptive nature or kind to the By-Law and schedule as may be\n\ndeemed necessary after the passage of this By-Law, where such modifications or\ncorrections do not alter the intent of the By-Law;\n\nCiting\n\n36 This By-law may be cited as the “Open Air Burning By-law’.\n\nPage 13 of 15\n\n"
    },
    {
      "page_number": 14,
      "text": "Enactment\n37 This by-law shall come into force and take effect on the final passing thereof.\n\nBy-law read and passed this 23'¢ day of June 2025.\n\nNeil R. Ellis, Mayor\n\nPage 14 of 15\n\n"
    },
    {
      "page_number": 15,
      "text": "Schedule 1\nto By-law Number 2025-118 for\nThe Corporation of the City of Belleville\n\nThis Bylaw shall restrict type and size of allowable fires specifically in the following\nareas:\n\nBELLEVILLE\n\nto Y,\non the Bay of Quinte\n\nCITY\nOF\nBELLEVILLE\n\nPage 15 of 15\n"
    }
  ]
}