{
  "file_name": "BL 2006-55 A Bylaw to Regulate Signs and other Advertising Devices.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\nBY-LAW NUMBER 2006-55\n\nA BY-LAW TO REGULATE SIGNS AND OTHER ADVERTISING DEVICES IN THE CITY OF\nBELLEVILLE\n\nWHEREAS the Council of The Corporation of the City of Belleville is desirous of establishing a\nBy-Law to regulate signs and other advertising devices throughout the whole of the City of Belleville;\n\nNOW THEREFORE, THE COUNCIL OF THE CORPORATION OF THE CITY OF BELLEVILLE\nENACTS AS FOLLOWS:\n\nSECTION 1 — DEFINITIONS\nFor purposes of this By-Law, the following definitions shall apply:\n\n(1) “Abandoned Sign\" means a sign located on property which becomes vacant and\nunoccupied for a period of ninety (90) days or more, or any sign which pertains to a\ntime, event or purpose which no longer applies.\n\n(2) “Alter, Altered or Alteration\" means any change to a sign with the exception of:\ni) achange in the message displayed by a sign;\n\nii) the rearrangement of numerals, letters or copy applied directly to the face of a\nsign and specifically designed and intended to be periodically rearranged; or\n\niii) repair and maintenance, including replacement by identical components; unless\nsuch works change the size, height or location of the sign or otherwise affect the\nstructure of the sign.\n\n(3) “Banner Sign\" means a temporary sign made of vinyl, cloth, canvas, or other pliable\nmaterial, but shall not include a flag or banner employed for artistic or design\npurposes.\n\n(4) “Building Fagade\" means that portion of any exterior elevation of a building\n\nextending from grade to the top of the parapet, wall or eaves and encompassing the\nentire width of the building.\n\n(5) \"Chief Building Official\" means the Chief Building Official or his/her designate, of\nthe Corporation of the City of Belleville.\n\n(6) \"Clear Height\" means the distance between the highest elevation of the ground\nbeneath a sign or awning, and the lowest point of the sign or awning exclusive of the\nsign or awning structure.\n\n(7) “Contractor's Sign\" means a temporary sign used to identify the name or names of\nthe contractors doing work on a lot, where such sign is removed upon completion of\nthe work.\n\n(8) “Corner Lot\" means a lot situated at the intersection of two or more streets where\n\nthe angle of the intersection of the two streets is not more than 135 degrees.\n\n(9) “Developer's Sign\" means a temporary on-premise sign used to identify the name\nof a land development project that is either ongoing or going through the approval\nprocess, where such sign is removed upon completion of the development project.\n\n(10) “Directional Sign\" means a permanent on-premise sign that provides direction or\nother information for the control of vehicular and pedestrian traffic on a lot, such as\n"
    },
    {
      "page_number": 2,
      "text": "(11)\n\n(12)\n\n(13)\n\n(14)\n\n(15)\n\n(16)\n\n(17)\n\n(18)\n\n(19)\n\n(20)\n(21)\n\n(22)\n\n(23)\n\n(24)\n\n(25)\n\n(26)\n\nentry or exit signage, loading area signage, or on-site parking signage, and includes\nmenu signage and similar on-site instructional signage.\n\n“Election Sign\" means a temporary sign erected in connection with a Federal,\nProvincial or Municipal election by or on behalf of a candidate officially registered for\nelection.\n\n“Electric Spectacular\" means a permanent animated sign, and shall include any\nsign whose message remains unchanged or unmoved for a period of less than\nseven (7) seconds, but shall not include signs that display in whole or in part the time\nof day and/or the temperature.\n\n“Fascia Sign\" means a permanent on-premise sign attached to or painted directly\non a building fagade, where the sign face is parallel to the building fagade on which\nthe sign is affixed.\n\n“Flashing Sign\" means a type of sign defined in this By-Law that contains lights that\nvary in intensity at intervals less than seven (7) seconds.\n\n\"Ground Sign\" means a permanent on-premise sign that is supported from the\nground and not attached to any part of a building.\n\n“Illuminated Sign\" means a type of sign as defined in this By-Law that is illuminated\nby either internal or external lamps, luminous tubes, or reflectorized glowing or\nradiating lights.\n\n\"Lot\" means a parcel of land under single ownership and which is distinct from the\nownership of adjoining lots or parcels of land, whether such parcel is described in a\nregistered deed, or shown as a lot or block on a registered plan of subdivision.\n\n\"Marquee\" means a permanent roof structure projecting horizontally from the face of\na building, upon which there may or may not be one or more signs.\n\n“Municipal Property\" means property owned by or under the control of the\nCorporation of the City of Belleville and shall include streets as defined herein within\nthe City of Belleville.\n\n\"Municipality\" means The Corporation of the City of Belleville.\n\n“Off-Premise Sign\" means any sign advertising a business, person, activity, good,\nproduct or service that is not principally related to, or available at the location or on\nthe lot where the sign is located, and/or which generally directs people to locations\ndifferent from the location where the sign is located.\n\n“On-Premise Sign\" means any sign advertising a business, person, activity, good,\nproduct or service that is principally available at the premises or on the lot where the\nsign is located.\n\n\"Owner\" means the registered owner of the lot upon which a sign is or is to be\nerected. When used in context with a sign, Owner shall mean the owner of the sign.\n\n\"Parapet\" means an extension of a wall of a building above the roof level of the\nbuilding.\n\n\"Person\" means any human being, association, firm, partnership, incorporated\ncompany, corporation, agent or trustee and any heirs, executors, successors,\nassigns or other legal representatives of a person to whom a contract can apply\naccording to law.\n\n“Portable Sign\" means a temporary sign which is specifically designed or intended\nto be readily moved from one location to another and which does not rely on a\nbuilding or fixed foundation for its structural support, and which for purposes of this\n\n2\n"
    },
    {
      "page_number": 3,
      "text": "(27)\n\n(28)\n\n(29)\n\n(30)\n\n(31)\n\n(32)\n\n(33)\n\n(34)\n\n(35)\n\n(36)\n\n(37)\n\n(38)\n\n(39)\n\nBy-Law includes any sign mounted on a trailer, a banner sign, and an inflatable sign,\nbut does not include a sandwich board sign as defined herein.\n\n“Poster Panel Sign\" means a permanent off-premise sign that may be either self\nsupporting or affixed to a building or other structure for support.\n\n“Private Thoroughfare\" means that portion of private property over which vehicular\ntraffic has the right of passage, and without limiting the generality of the foregoing,\nshall include private roadways, laneways, driveways, and parking areas.\n\n\"Projecting Sign\" means a permanent on-premise sign which projects\nperpendicularly from the wall of a building to which the sign is affixed for support.\n\n“Public Information Sign\" means any sign erected for or at the direction of any\ngovernment authority, agency, board or committee for the purpose of providing\ninformation to the public concerning such authority, agency, board or committee, or\nany proceedings thereof, and shall include signs that advertise applications for\nOfficial Plan or Zoning By-Law amendments.\n\n“Read-o-graph\" means a permanent sign composed of manually or electronically\ninterchangeable letters intended to convey a temporary message.\n\n“Real Estate Sign\" means a temporary on-premise sign erected on a lot or affixed\nto a building to advertise the availability of the real property for sale, lease or rent.\n\n“Roof Sign\" means a permanent on-premise sign, the face of which is above the\nroof level or parapet of the building upon which the sign is affixed.\n\n“Sandwich Board Sign\" means a temporary sign that is self-supporting on-grade,\nconstructed of substantive weather-resistant materials, typically forming the shape of\nan 'A' when erected.\n\n\"Sign\" means any advertising device or display upon which there is printed,\nprojected or attached any announcement, declaration, or insignia, used for direction,\ninformation, identification, advertisement, business promotion or promotion of\nproducts, or availability of services, whether intended to be permanent or temporarily\ncapable of being readily moved or relocated, and includes an inflatable model placed\non a lot for the purpose of advertising, and also includes banners and vehicles used\nstrictly as advertising devices, and shall include the sign structure and the sign face,\nbut shall not include flags or other embellishments to a lot or building that are strictly\nfor design or architectural purposes.\n\n\"Sign Area\" means the surface area of a sign face, except on a double-faced sign\nwhere only the larger of the two sign faces shall be calculated as the sign area.\nWhere letters, figures or symbols are affixed to a wall separately to constitute a sign,\nthe sign area shall be deemed to be the area of the smallest rectangle, triangle,\ncircle or oval or combination thereof which will enclose all of the sign message\ncomponents. For purposes of this definition, a double-faced sign shall mean a sign\nwith two sign faces back-to-back facing opposite directions.\n\n\"Sign Face\" means that portion of a sign on which a message is intended to be\ndisplayed.\n\n\"Sign Height\" means the distance measured from height of the ground directly\nbeneath the sign to the highest point of the sign including the sign structure and the\nsign face.\n\n\"Sign Structure\" means the supporting structure and framework that supports the\nsign face.\n"
    },
    {
      "page_number": 4,
      "text": "(40) \"Signature Entrance Sign\" means a permanent ground sign erected on a street or\nother property used to identify the name of a development or a community or area of\nthe Municipality.\n\n(41) \"Street\" means a highway as defined in the Municipal Act including highways under\nthe jurisdiction of the Municipality and the Province of Ontario, and shall include all\ntravelled and un-travelled portions of a highway, and shall include lanes and\nwalkways owned by the Municipality, but shall not include a private thoroughfare.\n\n(42) \"Street Frontage\" means the linear distance of the street line of a lot.\n(43) \"Street Line\" means the common lot line that divides a street from a lot.\n\n(44) \"Unsafe\" means:\ni) structurally inadequate or faulty; or\nii) in a condition or location that could be hazardous to any person or property.\n\n(45) \"Zone\" means zones established by City of Belleville Zoning By-Law Number 10245\nas amended from time to time, Township of Thurlow Zoning By-Law Number 3014\nas amended from time to time, and Township of Sidney Zoning By-Law\nNumber 2076-80 as amended from time to time.\n\nSECTION 2 — GENERAL PROVISIONS\n\n2.1\n\n2.2\n\n2.3\n\n2.4\n\nShort Title\nThis By-Law may be cited as \"The City of Belleville Sign By-Law\".\n\nScope\n\n(1) This By-Law shall apply to all signs and other advertising devices within the limits of\nthe Corporation of the City of Belleville except as otherwise provided in this By-Law.\n\n(2) This By-Law shall not apply to signs erected in the interior of any building except for\nsuch signs that are placed on the interior of windows or other building fenestrations\nthat are intended strictly for external advertising.\n\n(3) This By-Law shall not apply to signs located on lots that display only municipal\naddresses or 9-1-1 property identifications, provided such signs:\ni) are erected so as to not create a safety hazard;\nii) are properly maintained; and\niii) do not have a sign area exceeding 5 square feet (.46 square metres).\n\n(4) Measurements in this By-Law are provided in imperial and metric units. Where there\nis a conflict between the imperial and the metric measure provided in this By-Law,\nthe imperial measure shall prevail.\n\nEffect of By-Law\n\nNo person shall erect, display, alter, repair or maintain, or cause the same to be done to, any\nsign or other advertising device within the corporate limits of the City of Belleville that is in\ncontravention of any provision of this By-Law.\n\nProhibited Signs\n\nNo person shall erect, place or display any sign or cause the same to be done in respect to\nany of the following:\n\ni) Signs that contravene the requirements of this By-Law, the Ontario Building Code or\nany other applicable regulation, as amended from time to time;\n\n4\n"
    },
    {
      "page_number": 5,
      "text": "2.5\n\n2.6\n\n2.7\n\n2.8\n\nii)\nii)\n\niv)\n\nv)\n\nvi)\n\nvii)\n\nviii)\n\nix)\n\nx)\n\nxi)\n\nElectric spectacular signs;\n\nSigns that overhang or encroach on municipal property including streets unless\nexpressly authorized by this By-Law or the Municipality;\n\nSigns that are unsafe, or endanger public safety by reason of their location or\ninadequate or improper construction or maintenance;\n\nAny sign that is located so as to obstruct the view of any pedestrian or motor vehicle\ndriver so as to cause an unsafe condition;\n\nAny sign that is located so as to obstruct or impede any flue, air intake, fire escape,\nfire exit, door, window, skylight or exhaust or so as to impede free access by fire\nfighters to any part of a premise;\n\nAny sign that is attached or secured to a tree, shrub or bush, or utility pole;\n\nVehicles parked and located solely for the purpose of advertising a place of\nbusiness, a product or a service;\n\nAny sign other than a roof sign that is erected upon or supported by a parapet;\n\nAny sign located on a corner lot that is placed in the triangular space formed by the\nstreet lines for a distance of 25 feet (7.62 metres) from their point of intersection, with\nthe exception of the area defined in Schedule 'A' hereto to which this clause shall not\napply, or any lot from which the City has previously obtained a day-lighting triangle;\n\nAny sign that may confuse passing motorists or interfere with the safe movement of\ntraffic.\n\nMaintenance\n\nEvery sign shall be kept clean, neatly painted, well maintained and in a good state of repair\nas to safety and appearance. No person shall permit any sign to become unsafe.\n\nMinimum Clear Height\n\n(1)\n\n(2)\n\nExcept as may otherwise be provided for in this By-Law, the clear height for any sign\nerected over a private thoroughfare or portions of streets used for vehicular traffic\nshall be 14 feet (4.27 metres) minimum.\n\nExcept as may otherwise be provided for in this By-Law, the clear height for any sign\nerected over a sidewalk, walkway or trail shall be 8 feet (2.44 metres) minimum.\n\nIllumination\n\n(1)\n(2)\n\n(3)\n\nSigns may be illuminated unless otherwise expressly prohibited by this By-Law.\n\nNo illumination of a sign shall spill beyond the face of the sign such that light\ninterferes with the enjoyment of neighbouring lands or interferes with visibility on\nnearby streets.\n\nNo person shall erect a flashing sign in the City of Belleville.\n\nTechnical Requirements\n\n(1)\n\nNo person shall erect any sign upon or attached to any building or other approved\nsupport unless such building or structure will carry the additional dead and wind\nloads due to the erection of such sign or without exceeding the stresses on the\nrespective materials as may be set out in the Ontario Building Code.\n"
    },
    {
      "page_number": 6,
      "text": "2.9\n\n(2) Where required by the Chief Building Official, signs including their supporting\nstructure, shall be designed by a professional engineer licensed to practice in the\nProvince of Ontario.\n\nLiability\n\nThe provisions of this By-Law shall not be construed as relieving or limiting the responsibility\nor liability of any person erecting or owning any sign for personal injury or property damage\nresulting from the placing or erecting of such sign or resulting from negligence or wilful acts\nof such person, or of his/her agents or employees in the construction, erection,\nmaintenance, repair or removal of any sign erected in accordance with a sign permit issued\nhereunder, nor shall it be construed as imposing upon the Municipality or its officers or\nemployees any responsibility or liability by reason of the approval of any sign, materials or\ndevices under provisions of this By-Law.\n\nExisting Signs\n\n(1) This By-Law shall not apply so as to require any sign that was legally erected before\nthe date this By-Law comes into full force and effect, to be made to comply with this\nBy-Law so long as the sign is not altered.\n\n(2) If any sign legally existing on the date this By-Law comes into full force and effect is\nremoved or deemed by the Chief Building Official to be substantially altered, the sign\nshall be replaced or upgraded only in accordance with all requirements of this\nBy-Law.\n\nSECTION 3 — SIGN CLASSIFICATIONS\n\n3.1\n\nGround Signs\n\nNo person shall erect a Ground Sign, where permitted pursuant to the provisions of\nSection 4 of this By-Law, except in accordance with the following provisions:\n\n(1) Size and Number of Signs:\n\na) The maximum cumulative sign area for all Ground signs erected on a lot shall be\n\neither:\n\ni) 1 square foot (.09 square metres) for each 1.75 feet (.53 metres) or part\nthereof of street frontage; or\n\nii) 1 Square foot (.09 square metres) for each 300 square feet (27.87 square\nmetres) or part thereof of lot area; or\n\niii) 60 square feet (5.57 square metres);\n\nwhichever is the greater.\n\nb) No individual Ground sign shall have a sign area in excess of 200 square feet\n(18.58 square metres).\n\n(2) Sign Setbacks:\n\na) Ground signs may be located adjacent to any lot line other than a street line,\nexcept lot lines abutting lots in a Residential zone, in which case Ground signs\nshall be set back minimum 50 feet (15.24 metres) from the said lot line.\n\nb) Ground signs with a clear height of minimum 8 feet (2.44 metres) may be located\nimmediately adjacent to a street line, and Ground signs with a clear height of less\nthan 8 feet (2.44 metres) shall be set back minimum 5 feet (1.52 metres) froma\nstreet line.\n"
    },
    {
      "page_number": 7,
      "text": "3.2\n\n(3)\n\n(4)\n\nc\n\n~\n\nNo Ground sign shall be located any closer than 50 feet (15.24 metres) to any\nother Ground sign located on another lot.\n\nd) Where more than one (1) ground sign is located on a lot, a separation distance\nof 250 feet (76.2 metres) minimum between the signs shall be provided.\n\nSign Height:\nNo Ground sign shall have a sign height exceeding 35 feet (10.67 metres).\n\nSign Structure:\n\na) Ground signs over 8 feet (2.44 metres) in height shall have a non-combustible\nsign structure.\n\nb) Ground signs over 8 feet (2.44 metres) in height shall be set in concrete footings\nthat extend to below frost depth which shall have sufficient size and weight to\nprevent overturning of the sign in heavy winds.\n\nc) The sign structure of a Ground sign shall be free of any extra bracing, angle iron,\nguy wires, cables, or similar, and the supports shall be an integral part of the\nsign.\n\nPoster Panel Signs\n\nNo person shall erect a Poster Panel sign, where permitted pursuant to the provisions of\nSection 4 of this By-Law, except in accordance with the following provisions:\n\n(1)\n\n(2)\n\n(3)\n\n(4)\n\nNumber of Signs:\nNo more than one (1) Poster Panel sign shall be erected on any one lot.\n\nSign Setbacks:\n\na) No Poster Panel sign shall be located within 15 feet (4.57 metres) of a driveway\n\nleading to a street nor closer to a street line than:\n\ni) 50 feet (15.24 metres) in the case of a sign with a sign area of 75 square feet\n(6.97 square metres) or less;\n\nii) 75 feet (22.86 metres) in the case of a sign with a sign area greater than\n75 square feet (6.97 square metres) and less than 150 square feet\n(13.94 square metres); or\n\niii) 100 feet (30.48 metres) in the case of a sign with a sign area 150 square feet\n(13.94 square metres) or greater.\n\nb) No Poster Panel sign with a sign face:\ni) 75 square feet (6.97 square metres) or less shall be located within 100 feet\n(30.48 metres) of any lot within a Residential Zone; and\nii) exceeding 75 square feet (6.97 square metres) shall be located within\n150 feet (45.72 metres) of any lot within a Residential Zone.\n\nSize of Sign:\n\nNo Poster Panel sign shall have a sign face exceeding 300 square feet\n(27.87 square metres) in area.\n\nSeparation Distance of Signs:\n\na) Within any Rural or Agricultural Zone:\ni) no Poster Panel sign with a sign area in excess of 100 square feet\n(9.29 square metres) shall be located within a radius of 5,000 feet\n(1524 metres) from another Poster Panel sign; and\n"
    },
    {
      "page_number": 8,
      "text": "3.3\n\n(5)\n\n(6)\n\n(7)\n\n(8)\n\nii) no Poster Panel sign with a sign area 100 square feet (9.29 metres) or less\nshall be located within a radius of 3,000 feet (914.4 metres) from another\nPoster Panel sign.\n\nb) Within any Zone other than a Rural or Agricultural Zone where Poster Panel\n\nsigns are permitted:\n\ni) no Poster Panel sign with a sign area in excess of 100 square feet\n(9.29 square metres) shall be located within a radius of 2,000 feet\n(609.6 metres) from another Poster Panel sign; and\n\nii) no Poster Panel sign with a sign area 100 square feet (9.29 square metres)\nor less shall be located within a radius of 1,000 feet (304.8 metres) from\nanother Poster Panel sign.\n\nSign Height:\nNo Poster Panel sign shall have a sign height exceeding 30 feet (9.14 metres).\n\nAgreement of Land Owner:\n\nAll applications for a sign permit to erect a Poster Panel sign shall be accompanied\nwith confirmation from the owner of the lot upon which the sign is to be placed that\nhe/she consents to the sign being erected, where the applicant for the sign permit is\nnot also the owner of the lot.\n\nBusinesses Not Located in Belleville:\n\nAny business that does not maintain a place of business within the corporate limits of\nthe City of Belleville shall not advertise on more than one poster panel sign within the\nCity of Belleville at any one time.\n\nSign Structure:\n\na) The supporting members of a Poster Panel sign shall be free of any extra\nbracing, angle iron, guy wires, cables, or similar, and the supports shall be an\nintegral part of the sign.\n\nb) Poster panel signs, except where supported by another structure such as the\nwall of a building, shall be set in concrete footings that extend to below the level\nof potential damage from frost and shall be of sufficient size and weight to\nprevent overturning the sign in heavy winds.\n\nc) Poster panel signs over 8 feet (2.44 metres) in height shall have a non-\ncombustible sign structure.\n\nPortable Signs\n\nNo person shall erect a Portable Sign, where permitted pursuant to the provisions of\nSection 4 of this By-Law, except in accordance with the following provisions:\n\n(1)\n\n(2)\n\nNumber of Portable Signs:\n\nA maximum of one (1) Portable sign shall be permitted for each 200 feet\n(60.96 metres) or part thereof of street frontage of a lot, but in no case shall more\nthan four (4) Portable signs be erected or maintained on a lot at any one time.\n\nDuration of a Portable Sign:\n\nA Portable sign may be erected for a period of up to 3 months pursuant to a permit\nissued under Section 5 of this By-Law, but a permit may be obtained from month to\nmonth or for three (3) month intervals with respect to the same sign.\n"
    },
    {
      "page_number": 9,
      "text": "(3)\n\n(4)\n\n(5)\n\n(6)\n\n(7)\n\n(8)\n\n(9)\n\nSign Setbacks:\na) Portable signs shall be located entirely on a lot and shall not be located on or\npermitted to encroach onto a street.\n\nb) The Sign Face of any Portable sign shall be set back:\ni) 15 feet (4.57 metres) minimum from a driveway exiting onto a street;\nii) 5 feet (1.52 metres) minimum from any lot line other than a street line;\niii) 7 feet (2.13 metres) minimum from a public sidewalk; and\niv) 15 feet (4.57 metres) minimum from any curb line or edge of the travelled\nportion of a street.\n\nSign Size and Height:\n\nExcept as may otherwise be provided:\n\ni) no Portable sign shall have a sign height exceeding 7 feet (2.13 metres); and\n\nii) the maximum sign area of a Portable sign shall be 50 square feet (4.65 square\nmetres).\n\nIllumination:\n\nA Portable sign may be illuminated, but no Portable sign shall have any flashing or\n\nmoving lights or be mechanized in any way.\n\nOff-Premise Portable Signs:\nA portable sign shall not be erected or displayed as an off-premise sign.\n\nPortable Signs with No Message:\n\na) Portable signs not displaying any message for a period of sixty (60) days shall be\nprohibited.\n\nc) For purposes of Part a) above, a Portable sign displaying a message identifying\njust the identity and/or contact information of the owner of the Portable sign\nand/or that the Portable sign is for rent shall be deemed to not be displaying any\nmessage and shall be prohibited.\n\nSign Structure:\nPortable signs shall be anchored, pinned, weighted, tied, or possess sufficient\nintegral weight to prevent overturning in heavy winds.\n\nInflatable Signs:\nNotwithstanding any other provisions of this Section to the contrary, the following\n\nprovisions shall apply to Inflatable signs:\na) Amaximum of one (1) Inflatable sign shall be permitted on a lot at any one time.\n\nb) The maximum number of days that an Inflatable sign may be erected on a lot in\nany one calendar year (January 1° to December 31\") shall be sixty (60).\n\nc) Inflatable signs may be erected on a lot in addition to any other type of Portable\nsign permitted by this By-Law.\n\nd) An Inflatable sign shall not be subject to any sign area limitations but shall not\nexceed 40 feet (12.19 metres) in height from the base of the Inflatable sign to the\nhighest point of the Inflatable sign.\n\ne) Inflatable signs shall be anchored, pinned, weighted or tied to prevent shifting,\nmoving or overturning in heavy winds. Where erected on the roof of a building or\nwhere attached to any structure on a lot, the Chief Building Official may require\n\n9\n"
    },
    {
      "page_number": 10,
      "text": "3.4\n\n(10)\n\n(11)\n\nsuch sign be erected under the supervision and approval of a Professional\nEngineer.\n\nf) Models and other similar advertising devices shall be considered inflatable signs\nfor purposes of this By-Law.\n\nBanner Signs:\n\nNotwithstanding any other provisions of this Section to the contrary, the following\nprovisions shall apply to Banner signs:\n\na) A maximum of one (1) Banner sign shall be permitted on a lot at any one time.\n\nb) The maximum number of days that a Banner sign may be erected on a lot in any\none calendar year (January 1° to December 31“) shall be ninety (90).\n\nc) Banner signs may be erected on a lot in addition to any other type of Portable\nsign permitted by this By-Law.\n\nd) Banner signs shall not be subject to any sign height limitations, and may have a\nsign area of 150 square feet (13.94 square metres) maximum.\n\ne) Where not affixed to and flush with the fagade of a building, the provisions of\nSection 3.3 (3) of this By-Law with respect to setbacks shall apply to Banner\nsigns.\n\nf) Banner signs shall be sufficiently tied or secured to permanent structures so as\nto prevent moving or release in heavy winds, and shall consist of weather-\nresistant material that will not rip in heavy winds or when wet.\n\nSearch Lights and Other Similar Advertising Devices:\n\nThe use of search lights as an advertising device and other similar advertising\ndevices shall be prohibited.\n\nFascia Signs\n\nNo person shall erect a Fascia Sign, where permitted pursuant to the provisions of Section 4\nof this By-Law, except in accordance with the following provisions:\n\n(1)\n\n(2)\n\n(3)\n\nWhere Permitted:\n\nFascia signs may be erected or displayed on each side building fagade that is clearly\nvisible from a street, private thoroughfare, or sidewalk, walkway or trail.\n\nMinimum Clear Height:\n\na) Where pedestrian access beneath a Fascia sign is prohibited, no minimum clear\nheight shall be required.\n\nb) Where pedestrian access beneath a Fascia sign is possible, the lowest part of\nthe Fascia sign shall not be less than 8 feet (2.44 metres) above the grade below\nthe sign.\n\nMaximum Height and Projection:\na) No Fascia sign shall extend above the building facade.\n\n10\n"
    },
    {
      "page_number": 11,
      "text": "3.5\n\n(4)\n\n(5)\n\n(6)\n\nb) For buildings located closer than 8 inches (.20 metres) to a street line, Fascia\nsigns affixed to such buildings may project a maximum of 8 inches (.20 metres)\nover the street line provided a minimum clear height of 8 feet (2.44 metres) is\nprovided.\n\nSign Area:\n\nThe maximum cumulative sign area of all Fascia signs affixed to any single building\nfacade shall be 15% of the total area of the building fagade to which the Facia signs\nare affixed.\n\nSign Structure:\n\nFascia signs shall be securely fastened to a building fagade.\nSigns on Awnings:\n\na) Fascia sign lettering may be painted on an awning.\n\nb) Within the area designated in Schedule 'A' hereto, Fascia sign lettering may be\npainted on an awning that projects over a street.\n\nc) By-Law Number 11067 of the Corporation of the City of Belleville, as amended\nfrom time to time, shall apply to awnings that project over a street upon which\nFascia sign lettering is to be displayed.\n\nRoof Signs\n\nNo person shall erect a Roof Sign, where permitted pursuant to the provisions of Section 4\nof this By-Law, except in accordance with the following provisions:\n\n(1)\n\n(2)\n\n(3)\n\n(4)\n\nNumber of Signs:\n\nNo more than one (1) Roof sign that may have either one (1) or two (2) sign faces\nshall be permitted on a lot.\n\nSign Height:\n\na) No Roof sign shall extend more than 5 feet (1.52 metres) above the maximum\nheight of the roof upon which the Roof sign is erected.\n\nb) Unless otherwise certified as acceptable by a Professional Engineer, every Roof\nsign shall maintain a vertical distance of minimum 3 feet (.91 metres) between\nthe roof or parapet and the bottom of such Roof sign.\n\nSign Area:\n\nNo single sign face of a Roof sign shall exceed 200 square feet (18.58 square\nmetres) in area.\n\nSign Structure:\na) Roof signs shall be secured to the building structure.\n\nb) The sign structure of a Roof sign shall be free of any extra bracing, angle iron,\nguy wires, cables, or similar; the supports for a Roof sign shall be an integral part\nof the sign.\n\nc) No Roof sign constructed either wholly or partly of wood shall be erected upon\nthe roof of any building.\n\n11\n"
    },
    {
      "page_number": 12,
      "text": "3.6\n\nSandwich Board Signs\n\nNo person shall erect a Sandwich Board sign, where permitted pursuant to the provisions of\nSection 4 of this By-Law, except in accordance with the following provisions:\n\n(1)\n\n(2)\n\n(3)\n\n(4)\n\n(5)\n\n(6)\n\nNumber of Signs:\n\nNo more than one (1) Sandwich Board sign shall be permitted for each 200 feet\n(60.96 metres) or part thereof of street frontage of the lot.\n\nSize of Sign:\n\nSandwich Board signs shall have a maximum height of 4 feet (1.22 metres) anda\nmaximum width of 2 feet (.61 metres), except as may otherwise be provided for in\nthis By-Law.\n\nSign Location on a Lot:\n\nWhere located on a lot, Sandwich Board signs may be located adjacent to any lot\nline including a street line.\n\nSign Location on a Street:\n\nSandwich Board signs shall not be located on any street except within the area\ndefined in Schedule 'A' hereto, provided that the Sandwich Board sign:\n\ni) shall be placed either:\n1) directly adjacent to the street line such that the sign does not project more\nthan 2 feet (.61 metres) from the street line, or\n2) on the boulevard or sidewalk on the street provided it is set back minimum\n2 feet (.61 metres) from the curb line; and\n\nii) shall be located either:\n1) immediately in front of or adjacent to the business advertised on the\nSandwich Board sign, or\n2) within 150 feet (45.72 metres) of the business so advertised on the Sandwich\nBoard sign subject to the concurrence of the property owner in front of which\nthe sign will be so located; and\n\niii) shall only be erected on the street when the business advertised on the sign is\nopen for business; and\n\niv) shall not impede pedestrian or vehicular traffic.\nAuthorization Permit:\n\na) No person shall erect any Sandwich Board sign on a street in accordance with\nthis By-Law without first obtaining from the Chief Building Official an\nauthorization permit for such sign.\n\nb) No more than one authorization permit shall be required for each Sandwich\nBoard sign, which permit shall authorize the placement of such sign on a street\nin accordance with the provisions of this By-Law for the life of the sign.\n\nc) The required fee for an authorization permit to erect a Sandwich Board sign ona\nstreet shall be $25.00.\n\nd) The Chief Building Official may place on any Sandwich Board sign for which an\nauthorization permit has been issued, a validation tag or sticker to certify that an\nauthorization permit has been issued for the said sign.\n\nSign Structure:\n\nSandwich Board signs shall be anchored in place through weight or other support so\nas to prevent incidental movement of the sign through the impacts of wind.\n\n12\n"
    },
    {
      "page_number": 13,
      "text": "3.7\n\n3.8\n\n3.9\n\nProjecting Signs\n\nNo person shall erect a Projecting sign, where permitted pursuant to the provisions of\nSection 4 of this By-Law, except in accordance with the following provisions:\n\n(1)\n\n(2)\n\n(3)\n\n(4)\n\nNumber of Signs:\n\nThe number of Projecting signs permitted on a lot shall be:\n\ni) amaximum of one (1) Projecting sign for each 100 feet (30.48 metres) or part\nthereof of length of each building fagade; or\n\nii) amaximum of one (1) Projecting sign for each separate business;\n\nwhichever is the greater.\n\nSign Area:\n\nA Projecting sign shall have a maximum sign area of 6 square feet (.56 square\n\nmetres).\n\nClear Height:\n\nProjecting signs shall have a minimum clear height of 9 feet (2.74 metres).\n\nSigns over a Street:\n\na) Within the area designated in Schedule 'A' hereto, Projecting signs may project a\nmaximum of 3 feet (.91 metres) over a street.\n\nb) Banners shall not be erected so as to project over a street without the approval\nof City Council.\n\nRead-o-graphs\n\n(1)\n\n(2)\n\nA Ground or Fascia sign may contain a Read-o-graph as a component of the sign,\nprovided that such Read-o-graph shall:\n\ni) not have a sign area in excess of 50% of the total permitted sign area; or\n\nii) have a sign face exceeding 75 square feet (6.97 square metres);\n\nwhichever is the lesser.\n\nRead-o-graphs that form a component of a permitted Ground or Fascia sign shall not\nbe included in the calculation of the maximum sign area for such sign as set out in\nthis By-Law.\n\nMarquees\n\nMarquees associated with a theatre may project over a street within the area defined in\nSchedule 'A' hereto, subject to the following provisions:\n\na)\nb)\n\nc)\n\nqd)\n\nThe clear height beneath the marquee shall be a minimum of 9 feet (2.74 metres).\n\nThe maximum distance that a marquee may project over a street shall be 10 feet\n(3.05 metres), but in no case shall any marquee project to within less than 3 feet\n(.91 metres) of a curb line, utility pole or tree.\n\nWhere a sign is to be located on a marquee, for purposes of this By-Law, such signs\nshall be deemed to be Fascia signs.\n\nProjecting signs may be permitted as a separate structure and complementary to a\nmarquee where a marquee is permitted by this By-Law, and such Projecting signs:\ni) shall not project over the street more than 5 feet (1.52 metres);\n\nii) shall not have a sign face exceeding 75 square feet (6.97 square metres); and\niii) shall have a minimum clear height of 9 feet (2.74 metres).\n\n13\n"
    },
    {
      "page_number": 14,
      "text": "e) Marquees shall be designed so as to prevent snow, ice or other matter from sliding\nor dropping from the marquee onto the municipal sidewalk.\n\nf) The Chief Building Official shall require submission of a plan certified by a\nprofessional engineer for any marquee or complementary Projecting sign prior to the\nissuance of any permit therefore.\n\nAdult Entertainment Establishments\n\nNotwithstanding anything in this By-Law to the contrary, no person shall erect any sign in\nsupport of an adult entertainment establishment (which for purposes of this By-Law shall\ninclude a body rub parlour) except in accordance with the following provisions:\n\na) No off-premise sign shall be erected in support of an adult entertainment\nestablishment.\n\nb) No sign or other advertising device in support of an adult entertainment\nestablishment shall contain any pictures, pictograms, caricatures, or other similar\nimages that are intended to cater or appeal to erotic or sexual appetites or\ninclinations.\n\nCc) No sign in support of an adult entertainment establishment shall contain any words\nother than the phrase \"Adult Entertainment\" or derivations thereof, the business\nname, and business operational information such as hours of operation and\nlicencing information, but nothing herein shall apply to prevent the use of words that\nadvertise products or services that are available for sale at the premises but which\nare not related to the adult entertainment service, subject to compliance with all other\nprovisions of this By-Law.\n\nd) No sign face of any sign in support of an adult entertainment establishment shall\nhave a sign area exceeding 100 square feet (9.29 square metres).\n\ne) Read-o-graph signs, portable signs, or sandwich board signs shall not be used in\nsupport of an adult entertainment establishment.\n\nSECTION 4 — ZONES WHERE SIGNS PERMITTED\n\n4.1\n\n4.2\n\nInterpretation\n\nReference made in this By-Law to Zoning By-Laws of the Corporation of the City of Belleville\nshall mean:\n\na) By-Law Number 10245 as amended from time to time, adopted by the Corporation of\nthe City of Belleville on April 4, 1977; and\nb) By-Law Number 3014 as amended from time to time, adopted by the Corporation of\n\nthe Township of Thurlow on August 12, 1987; and\n\nCc) By-Law Number 2076-80 as amended from time to time, adopted by the Corporation\nof the Township of Sidney on October 27, 1980.\n\nSigns Permitted in All Zones\n\nElection signs, real estate signs, contractor's signs, developer's signs, directional signs,\nwarning signs, and traffic control and public information signs shall be permitted in any zone\nand no permit shall be required for any of the foregoing signs.\n\nNo person shall erect an election sign, real estate sign, contactor's sign, developer's sign,\ndirectional sign, or warning sign in any zone except in accordance with the following\nprovisions:\n\n14\n"
    },
    {
      "page_number": 15,
      "text": "(1) Election Signs:\n\na)\n\nb)\n\nc)\n\nSections\n4.2 c) (v)- (xi)\nAdded by\n\nby-law 2017-196\n\nElection signs shall be permitted in any Zone following declaration of a Provincial\nor Federal election, or the day following the final day for filing nominations in a\nMunicipal election, and shall be removed within one (1) week following the date\nof the election.\n\nElection signs shall be permitted on a lot provided:\n\ni) the sign is affixed to the ground and is not nailed or fastened in any way toa\ntree, or any other similar plant or structure;\n\nii) the sign area of each sign does not exceed 32 square feet (2.97 square\nmetres); and\n\niii) where the sign has a sign area in excess of 12 square feet (1.11 square\nmetres), the sign is located in accordance with the provisions of\nSection 3.3 (3) of this By-Law.\n\nElection signs may be permitted on the un-travelled portion of streets provided:\n\ni) such signs do not interfere with the safe movement of pedestrians and\nvehicles on such streets, or cause disruption to the maintaining or use of the\nstreet by the Municipality or any utility or other similar authority;\n\nii) the sign is affixed to the ground and is not nailed or fastened in any way toa\nutility pole, traffic control sign or device, tree, or any other similar plant or\nstructure;\n\niii) the sign area of each sign does not exceed 12 square feet (1.11 square\n\nmetres) with a maximum sign height of 3 feet (.91 metres);\n\nthe owner of the lot immediately abutting the location of the sign on the street\n\ndoes not object to the election sign being located on the street next to his/her\n\nproperty;\n\n(v) Signs must be a minimum of 195 feet (60m) from the middle of any\nintersection;\n\n(vi) Signs shall not be permitted in any centre median;\n\n(vii)Signs shall not be permitted between the sidewalk and the curb;\n\n(viii)Signs shall be setback a minimum of 15 feet (4.57m) from the edge of a\ndriveway and any curb line or edge of the travelled portion of a street;\n\n(ix) Signs shall be setback a minimum of 1 foot (0.3m) from a sidewalk;\n\n(x) Signs advertising the same candidate shall be a minimum of 33 feet (10m)\napart; and\n\n(xi) where located on a street that is not under the jurisdiction of the Corporation\nof the City of Belleville, that authorization has been obtained from the\nnecessary authorities.\n\niv\n\n7\n\n(2) Real Estate Signs:\n\na)\n\nb)\n\nReal Estate signs shall be permitted in any Zone on a lot which is for sale or\navailable for lease or rent, and shall be removed within twenty-one (21) days\nfollowing the confirmation of a sale or the leasing of the premises.\n\nReal Estate signs shall not have a sign area:\n\ni) exceeding 10 square feet (.93 square metres) on any lot within a Residential\nZone or on a lot containing a residential use; or\n\nii) exceeding 32 square feet (2.97 square metres) in any other zone;\n\nexcept however that the maximum sign area of any Real Estate sign may be\n\ndoubled where the lot has a street frontage greater than 300 feet (91.44 metres).\n\nWithin Rural and Agricultural Zones, the maximum sign area of a Real Estate\nsign shall be as set out above, plus an additional 8 square feet (.74 square\nmetres).\n\n15\n"
    },
    {
      "page_number": 16,
      "text": "(3)\n\n(4)\n\n(5)\n\n(6)\n\nc) The number of Real Estate signs permitted on any lot shall be:\n\ni) amaximum of one (1) sign for each 200 feet (60.96 metres) or part thereof of\nstreet frontage; or\n\nii) amaximum of one (1) sign for each separate street frontage on a corner lot,\nwhich for purposes of this section includes frontage onto a navigatable\nwaterway;\n\nwhichever is the greater.\n\nd) Any Real Estate sign that has a sign area in excess of 10 square feet\n(.93 square metres) shall be located in accordance with the provisions of\nSection 3.3 (3) of this By-Law.\n\nContractor's Signs:\n\na) Contractor's signs shall be permitted in any Zone on a lot where there is active\nand ongoing construction by the business or person so indicated on the sign,\nand shall be removed upon completion of construction.\n\nb) Contractor's signs shall not have a sign area exceeding 16 square feet\n(1.49 square metres).\n\nc) Contractor's signs may be located adjacent to any lot line including a street line.\n\nDevelopers' Signs:\n\na) Developer's signs may be permitted in any Zone on a lot that is subject to a\ncurrent or proposed development or redevelopment project.\n\nb) A maximum of one (1) Developer's sign shall be permitted on a lot for each\nseparate street onto which the lot subject to the development project fronts.\n\nc) Developer's signs shall be removed within twenty one (21) days from the date of\ncompletion of the development or redevelopment project.\n\nd) Developer's signs shall be deemed to be Ground signs for setback purposes.\n\ne) The maximum sign area for each Developer's sign shall be 1 square foot\n(.09 square metres) for each 5 feet (1.52 metres) or part thereof of street\nfrontage, but in no case shall any sign face of a Developer's sign exceed\n150 square feet (13.94 square metres) in area.\n\nf) The maximum sign height for a Developer's sign shall be 15 feet (4.57 metres).\n\nDirectional Signs:\n\na) Directional signs shall be permitted in any Zone along or adjacent to any private\nthoroughfare.\n\nb) Directional signs shall not have any sign face exceeding 6 square feet\n(.56 square metres) with the exception of signs used to display menus or convey\nsimilar information, which shall have a maximum sign area of 60 square feet\n(5.57 square metres).\n\nWarning Signs:\n\na) Warning signs having a maximum sign area of 5 square feet (.46 square metres)\nfor each sign face shall be permitted in any Zone on a lot.\n\n16\n"
    },
    {
      "page_number": 17,
      "text": "4.3\n\n4.4\n\n(7)\n\nTraffic Control, Public Information and Other Signs:\n\na) Nothing in this By-Law shall apply to prevent the Municipality from erecting or\nauthorizing the erection of any sign on any street or on other property under the\njurisdiction or control of the Municipality in any Zone:\n\ni) to regulate traffic;\n\nii) to provide for the safety or protection of the public;\n\niii) to provide the public with information which shall include tourist directional\nsignage and service club identification; or\n\niv) as a component of any bus shelter, bench seating or similar facility.\n\nb) Nothing in this By-Law shall apply to prevent the Provincial and Federa\nGovernments from erecting or authorizing the erection of any sign on any street\nor on other property under the jurisdiction or control of the Provincial or Federa\nGovernment in any Zone:\n\ni) to regulate traffic\n\nii) to provide for the safety or protection of the public,\n\niii) to provide the public with information which shall include tourist directiona’\nsignage and service club identification; or\n\niv) as a component of any bus shelter, bench seating or similar facility.\n\nc) Public information signs shall be permitted in any Zone on a lot or on municipa\nproperty with the approval of the Municipality, or on a street under the jurisdiction\nof the Province of Ontario subject to obtaining approval from the Province.\n\nd) Where authorized by the Municipality through the provisions of a subdivision or\ndevelopment agreement, a land developer may erect a Signature Entrance sign\nin any Zone on a lot or on a street as set out in the said agreement.\n\nOpen Space Zones\n\n(1)\n\n(2)\n\n(3)\n\nOpen Space Zone, as referred to herein, shall mean:\n\na) O1 to O3 zones inclusive established by By-Law Number 10245;\nb) ES zones established by By-Law Number 3014; and\n\nc) O1 zones established by By-Law Number 2076-80.\n\nNo person shall erect or display any sign or other advertising device on any lot in an\nOpen Space Zone except:\n\na) Signs permitted pursuant to Section 4.2 of this By-Law;\n\nb) Ground signs;\n\nc) Fascia signs;\n\nd) Projecting signs;\n\ne) Roof signs;\n\nf) Sandwich Board signs; and\n\ng) Portable signs.\n\nNothing in this By-Law shall apply to prevent the erection of any Off-premise sign\nwithin any park under the jurisdiction of the Municipality or the Quinte Conservation\nAuthority provided such signs are not intended to cater to traffic on abutting streets.\n\nResidential Zones\n\n(1)\n\nResidential Zone, as referred to herein, shall mean:\n\na) R1 to R8 zones inclusive, plus RH and RS zones established by By-Law\nNumber 10245;\n\nb) R1 to R4 zones inclusive, plus RR, SR, ER and MHR zones established by\nBy-Law Number 3014; and\n\n17\n"
    },
    {
      "page_number": 18,
      "text": "45\n\n46\n\n(2)\n\n(5)\n\nc) R1 to R4 zones inclusive, plus R2S, R4S, RR and SPR zones established by\nBy-Law Number 2076-80.\n\nNo person shall erect or display any sign or other advertising device on any lot ina\nResidential Zone except:\n\na) Signs permitted pursuant to Section 4.2 of this By-Law;\n\nb) Ground or Fascia signs:\n\ni) used for personal identification, having a maximum sign area of 2 square feet\n(.19 square metres), provided a maximum of one (1) such sign shall be\npermitted for each lot;\n\nii) used to advertise boarding, lodging, tourist or apartment accommodation, or\na home occupation located upon which property the sign is located, having a\nmaximum sign area of 2 square feet (.19 square metres), provided a\nmaximum of one (1) such sign shall be permitted for each lot; or\n\niii) used to advertise an apartment complex with a minimum of 8 separate\napartment units, having a maximum sign area of 32 square feet (2.97 square\nmetres), provided a maximum of one (1) such sign shall be permitted for\neach lot.\n\nNo sign erected in a Residential Zone shall be mechanized.\n\nFor any institutional or community facility use located in a Residential Zone, the\nprovisions of Section 4.5 of this By-Law shall apply.\n\nFor any open space use located in a Residential Zone, the provisions of Section 4.3\nof this By-Law shall apply.\n\nCommunity Facility Zones\n\n(1)\n\n(2)\n\n(3)\n\nCommunity Facility Zones, as referred to herein, shall mean:\na) CF and NH zones established by By-Law Number 10245;\nb) CF zones established by By-Law Number 3014; and\n\nc) CF and NH zones established by By-Law Number 2076-80.\n\nNo person shall erect or display any sign or other advertising device on any lot ina\nCommunity Facility Zone except:\n\na) Signs permitted pursuant to Section 4.2 of this By-Law;\n\nb) Ground signs;\n\nc) Fascia signs;\n\nd) Sandwich board signs; and\n\ne) Portable signs.\n\nNo sign erected in a Community Facility Zone shall be mechanized.\n\nCommercial Zones\n\n(1)\n\n(2)\n\nCommercial Zone, as referred to herein, shall mean:\n\na) C1 to C7 zones inclusive, and CR, CM, CC and CH zones established by By-Law\nNumber 10245;\n\nb) C1 to C4 zones inclusive established by By-Law Number 3014; and\n\nc) CR, CH, MCH and CD zones established by By-Law Number 2076-80.\n\nNo person shall erect or display a sign or other advertising device on any lot ina\nCommercial Zone except:\n\na) Signs permitted pursuant to Section 4.2 of this By-Law;\n\nb) Ground signs;\n\nc) Fascia signs;\n\nd) Roof signs;\n\n18\n"
    },
    {
      "page_number": 19,
      "text": "47\n\n48\n\n49\n\n4.10\n\ne) Projecting signs;\n\nf) Sandwich board signs;\ng) Portable signs; and\n\nh) Poster panel signs.\n\nRural and Agricultural Zones\n\n(1)\n\n(2)\n\nRural and Agricultural Zones, as referred to herein, shall mean:\na) RU and PA zones established by By-Law Number 3014; and\nb) A1 and A2 zones established by By-Law Number 2076-80.\n\nNo person shall erect or display a sign or other advertising device on any lot ina\n\nRural or Agricultural Zone except:\n\na) Signs permitted pursuant to Section 4.2 of this By-Law;\n\nb) Ground or Fascia signs used for personal identification, having a maximum sign\narea of 25 square feet (2.32 square metres);\n\nc) Fascia signs erected on a barn or other accessory building or structure used to\nadvertise the name of the farm or the identity of the operators, having a\nmaximum sign area of 150 square feet (13.94 square metres);\n\nd) Temporary signs used to identify crops;\n\ne) Sandwich board signs, having a maximum sign area of 20 square feet\n(1.86 square metres) per sign face;\n\nf) Portable signs; and\n\ng) Poster panel signs.\n\nIndustrial Zones\n\n(1)\n\n(2)\n\nIndustrial Zone, as referred to herein, shall mean:\n\na) M1 to M4 zones inclusive, and the MCP zone established by By-Law\nNumber 10245, as amended from time to time;\n\nb) M1 to M3 zones inclusive established by By-Law Number 3014; and\n\nc) MR, MW,M1, MS, M1S, and M2 zones established by By-Law Number 2076-80.\n\nNo person shall erect or display a sign or other advertising device on any lot in an\nIndustrial Zone except:\n\na) Signs permitted pursuant to Section 4.2 of this By-Law;\n\nb) Ground signs;\n\nc) Fascia signs;\n\nd) Projecting sign;\n\ne) Roof signs;\n\nf) Sandwich board signs;\n\ng) Portable signs; and\n\nh) Poster panel signs.\n\nOther Zones\n\n(1)\n\n(2)\n\nNo person shall erect or display a sign or other advertising device on a lot in any\nother zone except signs permitted pursuant to Section 4.2 of this By-Law or for signs\nfor which a permit is not required by this By-Law.\n\nFor purposes of this By-Law, Holding \"H\" Zones shall be treated in the fashion of the\nunderlying zone as if the Holding symbol were not attached.\n\nNon-conforming Uses\n\nFor any legal non-conforming use as determined through the provisions of the City's Zoning\nBy-Laws, no person shall erect any sign or other advertising device with the exception of\n\n19\n"
    },
    {
      "page_number": 20,
      "text": "5.1\n\n5.2\n\nsigns permitted pursuant to Section 4.2 of this By-Law or for signs for which a permit is not\nrequired by this By-Law, without first obtaining an amendment to this By-Law.\nSECTION 5 — SIGN PERMITS\n\nSign Permit Required\n\n(1)\n\n(2)\n\n(3)\n\nExcept as otherwise provided for in this By-Law, no person shall erect or install or\ncause to be erected or installed any sign without first applying for and obtaining a\nsign permit for such sign from the Chief Building Official.\n\nNotwithstanding Part (1) above, a sign permit shall not be required for the erection of\n\nthe following signs:\n\ni) Contractor's Signs;\n\nii) Directional signs provided no sign face is larger than 6 square feet (.56 square\nmetres);\n\niii) Displays consisting entirely of landscaping material;\n\niv) Signs erected on municipal property by or for the Municipality, including signs\nerected by the Provincial or Federal Government or the Municipality for the\nregulation, safety or guidance of traffic;\n\nv) Public information signs, including Banner signs erected on or over streets;\n\nvi) Election signs;\n\nvii) Real estate signs;\n\nviii) Warning signs (such as 'No Trespassing’, ‘Private Property’ or 'Beware of Dog’);\nix) Sandwich Board signs with the exception of an authorization permit where such\nsign is to be located on a street as set out in Section 3.6 (5) of this By-Law;\n\nx) Crop signs having a maximum sign area of 10 square feet (.93 square metres);\nxi) Any other sign having a sign area not exceeding 2 square feet (.19 square\n\nmetres).\n\nNo sign permit shall be required for any alterations or repairs to an existing sign if\nsuch alterations or repairs involve only a change of the message on the sign or the\nrepainting, cleaning or other normal maintenance and repair of the sign and the sign\nis not modified in any other way.\n\nApplication for Sign Permit\n\nWhere required by this By-Law, applications for a sign permit shall be made to the Chief\nBuilding Official upon a form to be provided by the Chief Building Official which shall require\nthe following information to be set out on or accompany such application:\n\ni)\nii)\n\nii)\n\niv)\n\nThe name and address of the Contractor installing the sign;\n\nThe name and address of the owner of the premises upon which the sign is to be\nlocated and the name and address of the person in possession of the premises upon\nwhich the sign is to be located;\n\nDrawings, plans and specifications showing:\n\n1) the location or proposed location of the sign on the premises;\n\n2) the location or proposed location of all other signs on the premises for which a\npermit is required; and\n\n3) the dimensions, foundations, construction supports, sizes, electrical wiring and\ncomponents, materials of the sign and method of attachment and character of\nstructural members to which the attachment is made, together with such other\nengineering data certified by a duly licensed engineer as required by the Ontario\nBuilding Code, as amended;\n\nProof of possession of all permits as may be required by any other applicable\ngovernment authority including the Ontario Ministry of Transportation;\n\n20\n"
    },
    {
      "page_number": 21,
      "text": "5.3\n\n5.4\n\n5.5\n\nv)\n\nvi)\n\nvii)\n\nThe required fee as set out in Section 5.3 of this By-Law.\n\nOther information as may be required by the Chief Building Official to ensure that\nsuch sign will comply with the requirements of this By-Law, the Ontario Building\nCode, any other applicable law, and to ensure the sign is not unsafe.\n\nThe consent of the person in possession of the lot or premises upon which the sign\nis to be erected, to permit entry upon the said premises by the Chief Building Official\nfor the purpose of inspecting the sign in accordance with Section 6.3 of this By-Law,\nbut nothing herein shall be construed to limit or restrict the right of the Chief Building\nOfficial to enter upon the premises in accordance with the provisions of the Building\nCode Act, the Provincial Offences Act or any other applicable statutory authority.\n\nFees for Sign Permits\n\n(1)\n\n(2)\n\n(3)\n\n(4)\n\n(5)\n\nEach application for a sign permit other than for Portable signs, Poster Panel signs,\nand Sandwich Board signs on a street shall be accompanied by a fee payable to the\nCorporation of the City of Belleville at a rate of $10.00 per $1,000.00, or part thereof,\nof the construction value (labour and materials) of the sign, or $30.00, whichever is\nthe greater.\n\nApplications for a sign permit for a Portable sign shall be accompanied by a fee\npayable to the Corporation of the City of Belleville at a rate of $10.00 for each week\nor part thereof that such sign is to be displayed, or $15.50 per month, whichever is\nthe lesser.\n\nApplications for a sign permit for a Poster Panel sign shall be accompanied by a fee\npayable to the Corporation of the City of Belleville at a rate of $25.00 per $1,000.00,\nor part thereof, of the construction value (labour and materials) of the sign, or\n$50.00, whichever is the greater.\n\nAn authorization permit shall be issued for each Sandwich Board sign that is to be\nerected on a street in accordance with the provisions of this By-Law, at a rate of\n$25.00 for each sign, on a one time basis for each sign, as set out in Section 3.6 (5)\nof this By-Law.\n\nAll fees payable are non-refundable upon issuance of the sign permit.\n\nIssuance of Sign Permit\n\n(1)\n\n(2)\n\nThe Chief Building Official shall issue a sign permit except where:\n\ni) the proposed sign or other advertising device will not comply with this By-Law or\nthe Ontario Building Code or will contravene any other applicable law; or\n\nii) the application for the sign permit is incomplete or any fees due are unpaid.\n\nAny sign permit issued by the Chief Building Official shall attest to the compliance to\nthe provisions of this By-Law, but issuance of a sign permit by the Chief Building\nOfficial shall not relieve the applicant from obtaining any other permit as may\nrequired by any other authority having jurisdiction or any other agency having\nregulations which may apply, including the Ontario Ministry of Transportation in the\nvicinity of highways under the jurisdiction of the Province of Ontario.\n\nNotice and Inspection Pursuant to a Sign Permit\n\nThe person to whom a sign permit has been issued shall notify the Chief Building Official of:\n\ni)\n\nthe readiness to construct the footings for the sign; and\n\nii) the completion of the erection, display, alteration, or repair of the sign for which the sign\n\npermit was issued;\n\nto facilitate inspection of the works.\n\n21\n"
    },
    {
      "page_number": 22,
      "text": "5.6\n\nSpecial Provisions for Sign Permits\n\nRevocation of Sign Permits:\nThe Chief Building Official may revoke a sign permit where:\n\n(1)\n\n(2)\n\n(3)\n\ni)\nii)\n\nii)\n\nthe sign permit was issued on mistaken or false information;\n\nafter six (6) months after its issuance, the erection, display, alteration or repair of\nthe sign in respect of which the permit was issued has not, in the opinion of the\nChief Building Official, been seriously commenced or has been substantially\nsuspended or discontinued; or\n\na person to whom an order has been given in accordance with Section 6.3 of this\nBy-Law has failed or refused to comply with such order.\n\nSpecial Provisions for Sign Permits for Portable Signs:\n\nNotwithstanding any provisions of this By-Law to the contrary, the following\nprovisions shall apply to sign permits for Portable signs:\n\na)\n\nb)\n\nc)\n\nqd)\n\nNo sign permit shall be issued for a Portable sign more than twenty eight (28)\ndays in advance of when the Portable sign for which the permit has been\nrequested is to be erected.\n\nWhere a sign permit for a Portable sign has been issued and the Portable sign\nfor which the sign permit has been issued has not been erected within twenty\neight (28) days of the date of issuance of the sign permit, the sign permit shall be\nvoid and may be revoked.\n\nNo sign permit for a Portable sign shall be issued for any period of time\nexceeding three (3) months in duration.\n\nNo person shall permit a Portable sign to be erected or displayed beyond the\neffective period for which the sign permit has been issued for the Portable sign.\n\nReturn of Sign Permit Fees:\n\nWhere a sign permit is revoked as set out herein, any permit fees paid to the\nMunicipality shall not be refundable.\n\nSECTION 6 — ADMINISTRATION AND ENFORCEMENT\n\n6.1\n\n6.2\n\nChief Building Official (as amended by by-law 2018-182)\n\nThe Chief Building Official or designate shall be responsible for the administration and\nenforcement of this By-Law.\n\nInspectors (as amended by by-law 2018-182)\n\nThe Chief Building Official may assign such building inspectors or By-law Enforcement\nOfficers as necessary to carry out the duties and responsibilities granted to and imposed\nupon the Chief Building Official by this By-Law, who shall have all of the authorities and\nresponsibilities attributed to the Chief Building Official by this By-Law.\n\n22\n"
    },
    {
      "page_number": 23,
      "text": "6.3\n\nRemedies (as amended by by-law 2018-182)\n\n(1)\n\n(2)\n\n(3)\n\nOrder to Comply:\n\na) The Chief Building Official or designate may issue an order to comply to require\nany person who:\n\ni) having obtained a sign permit, has caused a sign to be erected, displayed,\naltered or repaired contrary to the approved plans in respect of which the\nsign permit was issued; or\n\nii) has erected, displayed, altered or repaired a sign contrary to the provisions\nof this By-Law, the Ontario Building Code or any other applicable law;\n\nto make such sign comply or to remove the sign within the time prescribed in the\n\nnotice.\n\nb) The Chief Building Official or designate may issue an order to comply to require\nany person who has caused or allowed an existing sign to become unsafe or\nabandoned to correct the situation to the satisfaction of the Chief Building Official\nor designate in the manner and within the time prescribed in the order.\n\nc) Ifthe person to whom an order to comply has been issued fails to comply with\nthe said order, the Chief Building Official or designate, at his/her option, may\ninitiate procedures provided for in law to enforce this By-Law including\nauthorizing the laying of charges and prosecuting persons for contravention of\nthis By-Law, and the Chief Building Official or designate may enter land and pull\ndown or remove an existing sign, at the expense of the owner of the sign, if it is\nerected or displayed in contravention of this By-Law.\n\nOrders Written:\n\nOrders issued by the Chief Building Official or designate pursuant to this By-Law\n\nshall be given by registered mail addressed to:\n\ni) such person at his/her address as set out on the application for the sign permit;\n\nii) the owner of the lot on which the sign has been erected according to the last\nrevised assessment roll; or\n\niii) where a sign permit was not applied for, the owner of the sign;\n\nand such order shall be effective as of the date on which such registered mail is\n\nposted.\n\nRemoval of Signs Erected or Placed on Municipal Property:\n\na) Where a sign has been erected or placed on municipal property or on facilities\nowned by or under the jurisdiction of the Municipality, including on any street:\ni) without authorization;\nii) in contravention of any provision of this By-Law; or\niii) that has become unsafe;\nas an alternative to any other remedy provided for under this By-Law, the Chief\nBuilding Official or designate may remove and impound the sign without notice to\nthe owner of the sign or the business advertised on the sign.\n\nb) Where the Chief Building Official or designate has removed and impounded a\nsign as set out in Part a) above, such sign shall be retained by the Municipality\nfor a minimum three (3) months following its removal, unless reclaimed by the\nowner of the sign or the business advertised on the sign through payment of a\n$50.00 removal and impound fee to the City.\n\nlf, after three (3) months following removal and impounding of the sign, the\nowner of the sign or the business advertised on the sign has not reclaimed the\nsign, the Chief Building Official or designate may dispose of such sign in any\nmanner the Chief Building Official or designate sees fit, and no compensation\n\n23\n"
    },
    {
      "page_number": 24,
      "text": "6.4\n\n6.5\n\n6.6\n\nshall be payable by the Municipality to the owner of the sign or the business\nadvertised on the sign.\n\nc) For purposes of this By-Law, the City's Superintendent of Public Works shall be\ndeemed a designate of the Chief Building Official with respect to the removal and\nimpounding of signs located on municipal property or on municipal facilities in\ncontravention of the provisions of this By-Law.\n\nOffences\n\n(1)\n\n(2)\n\nEvery person who:\n\ni) knowingly furnishes false information in any application for a sign permit or any\ndocuments or plans accompanying such application for a permit under this\nBy-Law;\n\nii) fails to comply with any order, notice, direction or other requirement given in\naccordance with or pursuant to this By-Law; or\n\niii) contravenes any provision of this By-Law;\n\nis guilty of an offence and shall be liable upon conviction to the penalties prescribed\n\nby the Provincial Offences Act, R.S.O. 1990, Chapter P.33 or any legislation passed\n\nin succession thereto.\n\nEach day in which a contravention of this By-Law is continued or permitted to\ncontinue shall constitute a separate offence and shall be punishable as such\nhereunder.\n\nMinor Variances\n\n(1)\n\n(2)\n\n(3)\n\n(4)\n\nWhere a person cannot comply with the provisions of this By-Law, application may\nbe made to the Council of the Corporation of the City of Belleville for a minor\nvariance to the provisions of this By-Law.\n\nApplication to Council for a variance shall clearly set out why the provisions of the\nBy-Law can not be met and shall be accompanied by a fee in the amount of $250.00,\nwhich fee shall be non-refundable.\n\nNotwithstanding the foregoing, no fee shall be payable respecting:\n\ni) any application to permit a Sandwich Board sign on a street outside the area set\nout in Schedule 'A', or\n\nii) any application to erect a banner over a street in the area set out in Schedule ‘A’\nhereto.\n\nCouncil may, upon receipt of an application for a minor variance from the provisions\nof this By-Law, authorize such minor variances as may be requested provided in the\nopinion of the Council the general intent and purpose of this By-Law are maintained.\n\nCouncil may delegate its authority to approve minor variances to this By-Law as\npermitted by law.\n\nAdditional Provisions for Signs on and over Streets\n\n(1)\n\n(2)\n\nSigns and marquees permitted by this By-Law to project over or to be located on a\nstreet are permitted at the pleasure of the Municipality, and the Council of the\nCorporation of the City of Belleville reserves the right to amend this By-Law to\nprohibit such encroachments, whereupon such encroachments shall be removed.\n\nThe Municipality reserves the right to require that an owner of a sign or marquee that\nprojects over or is located on a street to enter into an encroachment agreement with\nthe Municipality and provide any liability insurance to the Municipality as it may\nrequire.\n\n24\n"
    },
    {
      "page_number": 25,
      "text": "6.7\n\n6.8\n\n6.9\n\nValidity\n\nIf any section, clause or provision of this By-Law is for any reason declared by a Court of\ncompetent jurisdiction to be invalid, the same shall not affect the validity of the By-Law as a\nwhole or any part thereof other than the section, clause or provision so declared to be\ninvalid, and it is hereby declared to be the intention of this By-Law that all the remaining\nsections, clauses or provisions of this By-Law shall remain in full force and effect until\nrescinded, notwithstanding that one or more provisions thereof may be declared to be\ninvalid.\n\nRescind\n\nBy-Law Number 8409 adopted by The Corporation of the City of Belleville in 1967, By-Law\nNumber 11786 adopted by The Corporation of the City of Belleville in 1985, By-Law\nNumber 13845 adopted by The Corporation of the City of Belleville in 1995, and By-Law\nNumber 3093-94 adopted by the former Corporation of the Township of Sidney in 1994, and\nall amendments thereto, are hereby repealed.\n\nEffective Date\n\nThis By-Law shall come into force and take effect immediately upon its final passing thereof.\n\nRead a first time this 27 day of March, 2006.\nRead a second time this 27 day of March, 2006.\nRead a third time and finally passed this 27 day of March, 2006.\n\nMARY-ANNE SILLS, MAYOR\n\nJULIE C. ORAM, CITY CLERK\n\n25\n"
    },
    {
      "page_number": 26,
      "text": "26\n\n—\n\nW777 AREA SUBJECT TO SPECIAL PROVISIONS\nY RESPECTING SIGNS\n\nST.PAUL ST.\n\n=\nlaa\n=|\n\nChoe\n\nF\nLs\n; |\n\nLCL)\nUy)\n\noA,\nA,\nbi\nny\nCLL,\n7\nYY\n4\nYW\nCLE,\nUZ\n—\n\nGY\nGh\n\nSS\n\nZ\nY\n\n~\nG\n\nSCHEDULE \"A\"\nTHE CITY OF BELLEVILLE SIGN BY-LAW\nSoh A\n\nP NIWNSSSRE NSS SENS\nS\\N\n\nmus : SEEDS :\n= me\n\nee\n\nYY\nyess.\n\\\n\nol\n\n4;\nLy\nBo\n\ny\n\\\n\\\n\nY\n\nK\\\n\nLi\n\n|\ni\n\nU\nVICTORIA PAR\n\n"
    }
  ]
}