{
  "file_name": "BL 2007-184 A Bylaw to amend BL 2005-206 Control of owner.pdf",
  "pages": [
    {
      "page_number": 1,
      "text": "THE CORPORATION OF THE CITY OF BELLEVILLE\nBY-LAW NO. 2007-184\n\nA BY-LAW TO AMEND BY-LAW NUMBER 2005-206, BEING A BY-LAW TO\nPROVIDE FOR THE LICENSING, REGULATION AND REGISTRATION OF DOGS,\nWITHIN THE CITY OF BELLEVILLE\n\nWHEREAS the Municipal Act, 2001 authorizes the Councils of Municipalities to pass by-laws with\nrespect to animals;\n\nAND WHEREAS Council of the City of Belleville deems it advisable to amend by-law number\n2005-206, the Animal Control By-law;\n\nNOW THEREFORE THE COUNCIL OF THE CORPORATION OF THE CITY OF BELLEVILLE\nENACTS as follows:\n\n1. THAT Section 1 of By-law 2005-206 is hereby amended by the addition of\nthe following definition immediately following the definition of “Society”:\n\n“under the control of its owner” means, in the case of a dog, being kept\non a leash and leashed by its owner or by another person acting on the\nowner's behalf;\n\n2. THAT By-law 2005-206 is further amended by replacing section 3.3(i) with\nthe following:\n\n“It shall constitute an offence for an owner of a dog born in the City to fail\nto licence and register the dog within three (3) months after its date of\nbirth.”\n\n3. THAT By-law 2005-206 is further amended by replacing section 4.1(iii)\nwith the following:\n\n“This section does not apply to dogs under the age of three (3) months.”\n\n4. THAT By-law 2005-206 is further amended by replacing section 8.3 with\nthe following:\n\nThe regulation set out in section 8.1 does not apply to a dog that is\nrunning at large on a property with the express permission of the owner or\noccupant of that property or where the dog is running at large within the\nconfines of the City of Belleville dog park.\n\nww l2\n"
    },
    {
      "page_number": 2,
      "text": "-2-\n\nTHIS BY-LAW SHALL COME INTO FORCE AND TAKE EFFECT IMMEDIATELY ON\nAND AFTER THE PASSING THEREOF.\n\nRead a first time this 29\" day of October 2007.\n\nRead a second time this 29\" day of October 2007.\n\nRead a third time and finally passed this 29\" day of\\Octo\nNEIL ELLIS MAYOR\n\nCITY CLERK\n"
    }
  ]
}